Repository: spyder-ide/spyder-docs
Catalog: doc/locales/*/LC_MESSAGES/faq.po
Languages: es

source: Frequently Asked Questions
es: Preguntas frecuentes (FAQ)

source: Installing and updating
es: Instalar y actualizar

source: Q: How do I install Spyder?
es: P: ¿Cómo puedo instalar Spyder?

source: The easiest way to install Spyder is with the Anaconda Python distribution, which comes with everything you need to get started in an all-in-one package. Download it from its `webpage`_.
es: La forma más fácil de instalar Spyder es con la distribución de Anaconda Python, que viene con todo lo que necesitas para empezar con un paquete todo en uno. Descárgalo de su `página web`_.

source: For more information, visit our :doc:`/installation`.
es: Para más información, visita nuestro :doc:`/installation`.

source: Q: How do I install Spyder on Windows Subsystem for Linux 2 (WSL2)?
es: P: ¿Cómo puedo instalar Spyder en el Windows Subsystem for Linux 2 (WSL2)?

source: If you already installed Spyder on your Windows machine, you do not need to reinstall it on a WSL2-based Linux environment if your code must run there.
es: Si ya has instalado Spyder en tu equipo Windows, no necesitas reinstalarlo en un entorno Linux basado en WSL2 si el código debe ejecutarse allí.

source: Instead, just install `Miniconda`_ inside WSL2 and create a new conda environment (or use an existing conda- or virtualenv), then install Spyder-Kernels into that environment with e.g. ``conda install spyder-kernels``. You must manually install ``ipython_genutils`` with e.g. ``conda install ipython_genutils``.
es: En su lugar, simplemente instala `Miniconda`_ dentro de WSL2 y crea un nuevo entorno conda o también puedes usar un conda o virtualenv existente. Luego instala Spyder-Kernels en ese entorno con, por ejemplo, ``conda install spyder-kernels``. Debes instalar manualmente ``ipython_genutils`` con, por ejemplo, ``conda install ipython_genutils``.

source: Windows creates a network path located at ``\\wsl$`` that points to the partitions of your WSL2 machines, e.g. ``\\wsl$\Ubuntu-20.04``. You **must** map a network drive letter to your machine path, e.g. ``W:``, for Spyder to correctly see its files and folders.
es: Windows crea una ruta de red ubicada en ``\\wsl$`` que apunta a las particiones de sus máquinas WSL2, por ejemplo, ``\\wsl$\Ubuntu-20. 4``. **Debes** mapear una letra de unidad de red a la ruta de su máquina, por ejemplo ``W:``, para que Spyder vea correctamente sus archivos y carpetas.

source: To start a Spyder kernel, from your Linux terminal run
es: Para iniciar un kernel de Spyder, desde tu terminal Linux ejecuta

source: It will run the kernel as a subprocess and create a file named :file:`remotemachine.json` in your WSL home folder.
es: Esto ejecutará el kernel como un subproceso y creará un archivo llamado :file:`remotemachine.json` en su carpeta de inicio WSL.

source: Finally, under the options menu of Spyder's :doc:`panes/ipythonconsole`, select :guilabel:`Connect to an existing kernel` as described in :ref:`connecting-external-kernel`. Insert the absolute path of :file:`remotemachine.json` into the :guilabel:`Connection file` field. If you mapped ``W:`` as mentioned in above note, the path should be :file:`W:/home/{username}/remotemachine.json`. A new console will open in Spyder, running in the Linux environment. Try running ``os.system('ls -la')`` and see if it lists your WSL home folder. If you run ``exit()`` from Spyder, the kernel running on Linux will be stopped.
es: Finalmente, bajo el menú de opciones de Spyder :doc:`panes/ipythonconsole`, selecciona :guilabel:`Conectarse a un núcleo existente` como se describe en :ref:`connecting-external-kernel`. Inserta la ruta absoluta de :file:`remotemachine.json` en el campo de :guilabel:`Archivo de conexión`. Si has mapeado ``W:``, como se menciona en la nota anterior, la ruta debería ser :file:`W:/home/{username}/remotemachine.json`. Una nueva consola se abrirá en Spyder, corriendo en el entorno Linux. Intenta ejecutar ``os.system('ls -la')`` y observa si se lista tu carpeta de inicio WSL. Si ejecutas ``exit()`` desde Spyder, se detendrá el núcleo corriendo en Linux.

source: Q: How do I update Spyder using conda?
es: P: ¿Cómo puedo actualizar Spyder utilizando conda?

source: From the command line (or Anaconda prompt on Windows), run:
es: Desde la línea de comandos (o el prompt de Anaconda en Windows), ejecuta:

source: If this results in an error or does not update Spyder to the latest version, try:
es: Si esto da como resultado un error o no actualiza Spyder a la última versión, intenta:

source: Q: How do update I Spyder using Anaconda Navigator?
es: P: ¿Cómo puedo actualizar Spyder usando Anaconda Navigator?

source: Open the "gear" menu in Spyder's section under :guilabel:`Home` in Navigator. Go to :guilabel:`Install specific version` and select the version of Spyder you want to use. We strongly recommend the latest available, to benefit from new features, bug fixes, performance improvements and usability enhancements.
es: Abre el menú "engranaje" en la sección de Spyder bajo :guilabel:`Home` en Navigator. Ve a :guilabel:`Install specific version` y selecciona la versión de Spyder que quieres usar. Recomendamos encarecidamente que uses las últimas disponibles, para beneficiarte de nuevas características, correcciones de errores, mejoras de rendimiento y de usabilidad.

source: Navigator showing installing specific version of Spyder
es: Navigator mostrando la instalación de una versión específica de Spyder

source: Running Spyder
es: Lanzar Spyder

source: Q: How do I run Spyder?
es: P: ¿Cómo puedo ejecutar Spyder?

source: You can launch it in any of the following ways:
es: Puedes lanzarlo de cualquiera de las siguientes formas:

source: **From the command line**: Type ``spyder`` in your terminal (or Anaconda prompt on Windows).
es: **Desde la línea de comandos**: Escribe ``spyder`` en tu terminal (o en el Anaconda prompt en Windows).

source: **From Anaconda Navigator**: Scroll to :guilabel:`Spyder` under :guilabel:`Home`, and click :guilabel:`Launch`.
es: **Desde Anaconda Navigator**: desplázete hasta :guilabel:`Spyder` en :guilabel:`Home`, y haz clic en :guilabel:`Launch`.

source: Navigator showing running a specific version of Spyder
es: Navigator mostrando la ejecución de una versión específica de Spyder

source: ***Windows Only***: Launch it via the Start menu shortcut.
es: ***Solo para Windows***: Lánzalo a través del acceso directo al menú Inicio.

source: Spyder shortcut in the Windows Start menu
es: Acceso directo a Spyder en el menú Inicio de Windows

source: Q: Can I try Spyder without installing it?
es: P: ¿Puedo ensayar Spyder sin instalarlo?

source: Yes! With `Binder`_, you can work with a fully functional copy of Spyder that runs right in your web browser. Try it `here`_.
es: ¡Sí! Con `Binder`_ puedes trabajar con una copia totalmente funcional de Spyder que se ejecuta en tu navegador web. Pruébalo `aquí`_.

source: Q: What are the system requirements for Spyder? How resource-intensive is it?
es: P: ¿Cuáles son los requisitos del sistema para Spyder? ¿Qué tan intensivo es su uso de recursos?

source: Spyder works on modern versions of Windows, macOS and Linux (see the table below for recommended versions) via Anaconda, as well as other methods. It typically uses relatively minimal CPU when idle, and 0.5 GB - 1 GB of RAM, depending on how long you've been using it and how many files, projects, panes and consoles you have open. It should work on any system with a dual-core or better x64 processor and at least 4 GB of RAM, although 8 GB is *strongly* recommended for best performance when running other applications. However, the code you run, such as scientific computation and deep learning models, may require additional resources beyond this baseline for Spyder itself.
es: Spyder funciona con versiones modernas de Windows, macOS y Linux (ver la tabla de abajo para ver las versiones recomendadas) mediante Anaconda, así como con otros métodos. Normalmente usa una CPU relativamente mínima cuando está inactiva, y 0.5 GB - 1 GB de RAM, dependiendo del tiempo que lo has estado usando y cuántos archivos, proyectos, paneles y consolas que has abierto. Debería funcionar en cualquier sistema con un procesador de núcleo dual o mejor con x64, y al menos 4 GB de RAM, aunque 8 GB es *altamente* recomendado para un mejor rendimiento al ejecutar otras aplicaciones. Sin embargo, el código que ejecutas, como la computación científica y los modelos de aprendizaje profundo, puede requerir recursos adicionales más allá de esta línea base para Spyder mismo.

source: Operating system
es: Sistema operativo

source: Version
es: Versión

source: Q: How do I run Spyder installed in a conda environment using Anaconda Navigator?
es: P: ¿Cómo puedo ejecutar Spyder en un entorno de conda usando Anaconda Navigator?

source: Select the environment you want to launch Spyder from under :guilabel:`Applications on`. If Spyder is installed in this environment, you will see it in Navigator's :guilabel:`Home` window. Click :guilabel:`Launch` to start Spyder in your selected environment.
es: Selecciona el entorno en el que quieres lanzar Spyder desde :guilabel:`Applications on. Si Spyder está instalado en este entorno, lo verás en la ventana :guilabel:`Home` del Navigator. Haz clic en :guilabel:`Launch` para iniciar Spyder en el entorno seleccionado.

source: Navigator showing running Spyder in a specific environment
es: Navigator mostrando cómo se ejecuta Spyder en un entorno específico

source: Q: How do I run Spyder installed in a conda environment using the command line?
es: P: ¿Cómo puedo ejecutar Spyder en un entorno de conda usando la línea de comandos?

source: Activate your conda environment by typing the following in your terminal (or Anaconda Prompt on Windows):
es: Activa tu entorno conda escribiendo lo siguiente en tu terminal (o en el Anaconda Prompt en Windows):

source: Then, type ``spyder`` to launch the version installed in that environment.
es: Luego, escribe ``spyder`` para lanzar la versión instalada en ese entorno.

source: Using Spyder
es: Usar Spyder

source: Q: How do I install Python packages to use within Spyder if I installed Spyder with conda?
es: P: ¿Cómo puedo instalar paquetes de Python para usar en Spyder si fue instalado con conda?

source: The first approach for installing a package should be using conda. In your system terminal (or Anaconda Prompt on Windows), type:
es: El primer método para instalar un paquete debería ser usar conda. En tu terminal del sistema (o en el Anaconda Prompt en Windows), escribe:

source: If your installation is not successful, follow steps 3 through 5 of Part 2 in our video on solving and avoiding problems with pip, Conda and Conda-Forge.
es: Si la instalación no se ha realizado correctamente, sigue los pasos 3 a 5 de la Parte 2 en nuestro vídeo sobre la resolución y prevención de problemas con pip, Conda y Conda-Forge.

source: Q: How do I get Spyder to work with my existing Python packages/environment?
es: P: ¿Cómo hago que Spyder funcione con mi entorno o paquetes de Python existentes?

source: To work with an existing environment in Spyder, change the default Python interpreter for new :doc:`/panes/ipythonconsole`\s to point to this environment.
es: Para trabajar con un entorno existente en Spyder, cambia el intérprete predeterminado de Python para las nuevas :doc:`/panes/ipythonconsole` para que apunten a este entorno.

source: To do so, open the :guilabel:`Python interpreter` section of Spyder's preferences (:menuselection:`Tools --> Preferences`, or :menuselection:`Spyder --> Preferences` on macOS). Here, select the option :guilabel:`Use the following Python interpreter`, and use the dropdown below to select your preferred environment. If it's not listed, see :ref:`the note below <faq-env-not-listed>`.
es: Para hacerlo, abre la sección :guilabel:`intérprete de Python` de las preferencias de Spyder (:menuselection:`Herramientas --> Preferencias`, o :menuselection:`Spyder --> Preferences` en macOS). Aquí, selecciona la opción :guilabel:`Usar el siguiente intérprete`, y utiliza el menú desplegable de abajo para seleccionar tu entorno preferido. Si no está listado, consulta :ref:`la nota debajo de <faq-env-not-listed>`.

source: Preferences showing changing Python interpreter
es: Preferencias mostrando cómo se cambia de intérprete de Python

source: If you installed Miniconda (or another Conda-based distribution) to a non-default path, or are using a virtual environment managed by a tool other than ``pyenv``, your environments likely won't be listed.
es: Si instalaste Miniconda (u otra distribución basada en Conda) en una ruta no predeterminada, o estás usando un entorno virtual administrado por una herramienta que no sea ``pyenv``, es probable que los entornos no aparezcan en la lista.

source: Instead, use the text box or the :guilabel:`Select file` button to enter the path to the Python interpreter you want to use. You can find this path by activating the venv or Conda env you want to use in your terminal (Anaconda Prompt on Windows), and running the command:
es: En su lugar, utiliza el cuadro de texto o el botón :guilabel:`Seleccionar archivo` para ingresar la ruta al intérprete de Python que deseas utilizar. Puedes encontrar esta ruta activando el env o la env de Conda que deseas usar en tu terminal (Anaconda Prompt en Windows), y ejecutando el comando:

source: Finally, click :guilabel:`Restart kernel` in the :guilabel:`Consoles` menu for this change to take effect. If ``spyder-kernels`` is not already installed, the :doc:`/panes/ipythonconsole` will display instructions on how to install the right version. Execute the given command in your terminal (the Anaconda Prompt on Windows) with the environment activated, and finally restart the kernel once more.
es: Finalmente, haz clic en :guilabel:`Reiniciar el núcleo` en el menú :guilabel:`Consolas` para que este cambio surta efecto. Si ``spyder-kernels`` no está instalado, el :doc:`/panes/ipythonconsole` te mostrará instrucciones sobre cómo instalar la versión correcta. Ejecuta el comando dado en tu terminal (Anaconda Prompt en Windows) con el entorno activado, y finalmente reinicia el núcleo una vez más.

source: Q: How do I install Python packages to use within Spyder if I downloaded Spyder from the standalone installers?
es: P: ¿Cómo puedo instalar paquetes de Python para usarlos en Spyder si descargué los instaladores independientes?

source: Watch our video on using additional packages or follow the instructions below.
es: Ve nuestro vídeo sobre el uso de paquetes adicionales o sigue las instrucciones que aparecen a continuación.

source: If you want to use other packages in Spyder that don't come with our installer, you need to have your own Python distribution installed; we recommend `Miniconda`_ or another Conda-based option. For Spyder to recognize it automatically, you should use a Conda-based distribution with its default install path.
es: Si quieres usar otros paquetes en Spyder que no vienen con nuestro instalador, necesitas tener tu propia distribución de Python instalada; recomendamos `Miniconda`_ u otra opción basada en Conda. Para que Spyder lo reconozca automáticamente, debes utilizar una distribución basada en Conda con su ruta de instalación predeterminada.

source: Create a new conda environment containing ``spyder-kernels`` and the packages that you want to use. For example, if you want to use ``scikit-learn``, open your terminal (or Anaconda prompt on Windows) and run the following command:
es: Crea un nuevo entorno conda que contenga ``spyder-kernels`` y los paquetes que quieres usar. Por ejemplo, si deseas usar ``scikit-learn``, abre tu terminal (o Anaconda Prompt en Windows) y ejecuta el siguiente comando:

source: Finally, connect Spyder to this ``my-env`` environment by changing Spyder's default Python interpreter, following the instructions in :ref:`the above answer <using-existing-environment>`.
es: Finalmente, conecta Spyder al entorno ``my-env`` cambiando el intérprete predeterminado de Python de Spyder, siguiendo las instrucciones en :ref:`la respuesta anterior <using-existing-environment>`.

source: Q: How do I reset Spyder's preferences to the defaults?
es: P: ¿Cómo restauro las preferencias de Spyder a sus valores por defecto?

source: Either use the :guilabel:`Reset Spyder to factory defaults` under :guilabel:`Tools` in Spyder's menu bar, the :guilabel:`Reset Spyder settings` Start menu shortcut (Windows), or run ``spyder --reset`` in your system terminal (Anaconda prompt on Windows).
es: Puedes usar el :guilabel:`Restablecer Spyder a su configuración por defecto` bajo :guilabel:`Herramientas` en la barra de menú de Spyder; el acceso directo del menú de inicio :guilabel:`Reset Spyder settings` (Windows), o ejecuta ``spyder --reset`` en tu terminal del sistema (Anaconda Prompt en Windows).

source: Spyder reset button in tools
es: Botón de reseteo de Spyder en herramientas

source: Q: How do I change Spyder's language?
es: P: ¿Cómo puedo cambiar el lenguaje de Spyder?

source: Under :guilabel:`General` in Spyder's :guilabel:`Preferences`, go to the :guilabel:`Advanced settings` tab and select your language from the options displayed under :guilabel:`Language`.
es: En :guilabel:`Aplicación` en las :guilabel:`Preferencias` de Spyder, ve a la pestaña :guilabel:`Opciones avanzadas` y selecciona tu idioma de las opciones que se muestran en :guilabel:`Lenguaje`.

source: Spyder change language in preferences.
es: Cambio del lenguaje de Spyder en preferencias.

source: Q: How do I use code cells in Spyder?
es: P: ¿Cómo puedo usar las celdas de código en Spyder?

source: To create a cell in Spyder's :doc:`/panes/editor`, type ``#%%`` in your script. Each ``#%%`` will make a new cell. To run a cell, press :kbd:`Shift-Enter` (while your cursor is focused on it) or use the :guilabel:`Run current cell` button in Spyder's toolbar.
es: Para crear una celda en el :doc:`/panes/editor` de Spyder, escribe ``#%%`` en tu script. Cada ``#%%`` hará una nueva celda. Para ejecutar una celda, presiona :kbd:`Shift-Enter` (mientras tu cursor está centrado en la celda) o usa el botón :guilabel:`Ejecutar la celda actual` en la barra de herramientas de Spyder.

source: Spyder showing cell generation.
es: Spyder mostrando la generación de celdas.

source: Q: How do I use plugins with Spyder (e.g. Spyder-Notebook, Spyder-Terminal, Spyder-Unittest)?
es: P: ¿Cómo puedo usar plugins en Spyder (por ejemplo, Spyder-Notebook, Spyder-Terminal, Spyder-Unittest)?

source: Spyder plugins are available in the ``conda-forge`` conda channel. To install one, type on the command line (or Anaconda Prompt on Windows):
es: Los plugins de Spyder están disponibles en el canal conda ``conda-forge``. Para instalar uno, escribe en la línea de comandos (o en el Anaconda Prompt en Windows):

source: Replace ``<PLUGIN>`` with the name of the plugin you want to use. For more information on a specific plugin, go to the its repository:
es: Reemplaza ``<PLUGIN>`` con el nombre del plugin que quieres usar. Para más información sobre un plugin específico, ve a su repositorio:

source: Q: How do I clear all variables before executing my code?
es: P: ¿Cómo puedo eliminar todas las variables antes de ejecutar mi código?

source: Check the option :guilabel:`Remove all variables before execution` in the :guilabel:`Configuration per file...` dialog under the :guilabel:`Run` menu.
es: Revisa la opción :guilabel:`Eliminar todas las variables antes de la ejecución` en el diálogo :guilabel:`Configuración por archivo...` bajo el menú :guilabel:`Ejecutar`.

source: Q: How do I run my code in a dedicated console or an external system terminal?
es: P: ¿Cómo puedo ejecutar mi código en una terminal dedicada o en una consola del sistema externa?

source: Select the appropriate option in the :guilabel:`Configuration per file...` dialog under the :guilabel:`Run` menu.
es: Seleccione la opción apropiada en el diálogo :guilabel:`Configuración por archivo...` bajo el menú :guilabel:`Ejecutar`.

source: Q: How do I change the syntax highlighting theme in the Editor?
es: P: ¿Cómo puedo cambiar el tema de coloreado de sintaxis en el Editor?

source: Go to :guilabel:`Preferences` and select the theme you want under :guilabel:`Syntax highlighting theme` in the :guilabel:`Appearance` section.
es: Ve a :guilabel:`Preferencias` y selecciona el tema que quieras bajo el tema :guilabel:`Tema de coloreado de sintaxis` en la sección :guilabel:`Apariencia`.

source: Troubleshooting
es: Solución de problemas

source: Q: I've found a bug or issue with Spyder. What do I do?
es: P: He encontrado un error o problema en Spyder. ¿Qué puedo hacer?

source: You should first follow the steps in our :doc:`troubleshooting guide</troubleshooting/first-steps>`. If you can't solve your problem, open an issue by following the instructions in our :doc:`/troubleshooting/submit-a-report` section.
es: Primero debes seguir los pasos en nuestra guía :doc:`solución de problemas</troubleshooting/first-steps>`. Si no puedes resolver tu problema, abre un "issue" siguiendo las instrucciones de nuestra sección :doc:`/troubleshooting/submit-a-report`.

source: Q: I get an error in the IPython console running my code! Help!
es: P: ¡Tengo un error en la terminal IPython al ejecutar mi código! ¡Ayuda!

source: First, make sure the error you are seeing is not a bug in your code. To confirm this, try running it in any standard Python interpreter. If the error still occurs, the problem is likely with your code and a site like `Stack Overflow`_ might be the best place to start. Otherwise, start at the :doc:`/troubleshooting/basic-first-aid` section of our troubleshooting guide.
es: Primero, asegúrate de que el error que estás viendo no es un error en tu código. Para confirmar esto, intenta ejecutarlo en cualquier intérprete estándar de Python. Si el error persiste, es probable que el problema esté en el código y un sitio como `Stack Overflow`_ podría ser el mejor lugar para empezar. De lo contrario, empieza por la sección :doc:`/troubleshooting/basic-first-aid` de nuestra guía de solución de problemas.

source: Q: Code completion/help doesn't work; what can I do?
es: P: El completado de código o la ayuda no funcionan; ¿qué puedo hacer?

source: If nothing is displayed in the calltip, hover hint or :doc:`/panes/help` pane, make sure the object you are inspecting has a docstring, and try executing your code in the :doc:`/panes/ipythonconsole` to get help and completions there. If this doesn't work, try restarting PyLS by right-clicking the :guilabel:`LSP Python` label item in the statusbar at the bottom of Spyder's main window, and selecting the :guilabel:`Restart Python Language Server` option.
es: Si no se muestra nada en el calltip, pase el cursor o usa el panel :doc:`/panes/help`, asegúrate de que el objeto que estás inspeccionando tiene un docstring, y prueba a ejecutar tu código en el :doc:`/panes/ipythonconsole` para obtener ayuda y completar el código allí. Si esto no funciona, prueba a reiniciar PyLS haciendo clic derecho en la etiqueta :guilabel:`LSP Python` en la barra de estado en la parte inferior de la ventana principal de Spyder, y seleccionando la opción :guilabel:`Reiniciar el Servidor de lenguaje de Python`.

source: For more information, go to the :ref:`code-completion-problems-ref` section in the :doc:`/troubleshooting/common-illnesses` page of our troubleshooting guide.
es: Para obtener más información, ve a la sección :ref:`code-completion-problems-ref` en la página :doc:`/troubleshooting/common-illnesses` de nuestra solución de problemas.

source: Q: I get the message "An error occurred while starting the kernel". How do I fix this?
es: P: Recibí el mensaje "Ocurrió un error mientras iniciaba el núcleo". ¿Cómo puedo arreglarlo?
