Repository: spyder-ide/spyder-docs
Catalog: doc/locales/*/LC_MESSAGES/faq.po
Languages: es

source: First, make sure your version of Spyder-Kernels is compatible with that of Spyder. See the table in the :ref:`spyder-kernels-version-ref` section of the troubleshooting guide to check.
es: Primero, asegúrate de que tu versión de Spyder-Kernels es compatible con la de Spyder. Revisa la tabla en la sección :ref:`spyder-kernels-version-ref` de la guía de solución de problemas para comprobar.

source: To install the right version, type the following on the command line (or Anaconda Prompt on Windows)
es: Para instalar la versión correcta, escribe lo siguiente en la línea de comandos (o Anaconda Prompt en Windows)

source: For more information, go to the :ref:`starting-kernel-problems-ref` section in the :doc:`/troubleshooting/common-illnesses` page of our troubleshooting guide.
es: Para obtener más información, ve a la sección :ref:`starting-kernel-problems-ref` en la página :doc:`/troubleshooting/common-illnesses` de nuestra solución de problemas.

source: Q: Spyder doesn't launch or is slow on macOS Big Sur. How can I get it working?
es: P: Spyder no arranca o es lento en macOS Big Sur. ¿Cómo puedo hacer que funcione bien?

source: Spyder is in the final stages of being updated for full compatibility with macOS 11 Big Sur, which will be released by the end of 2020 as part of version 4.2.1. However, you can get it working right now with the workaround below. Make sure you have the Anaconda or Miniconda distribution installed, and run the following commands in the Terminal to install Spyder from Conda-Forge in a clean environment:
es: Spyder está en las etapas finales de ser actualizado para total compatibilidad con macOS 11 Big Sur, que se publicará a finales de 2020 como parte de la versión 4.2.1. Sin embargo, puedes ponerlo en marcha ahora mismo con la solución a continuación. Asegúrate de tener la distribución Anaconda o Miniconda instalada, y ejecutar los siguientes comandos en la Terminal para instalar Spyder desde Conda-Forge en un entorno limpio:

source: Then, whenever you want to start Spyder, run the following from the Terminal:
es: Entonces, cada vez que quieras iniciar Spyder, ejecuta lo siguiente desde la Terminal:

source: About Spyder
es: Acerca de Spyder

source: Q: What's Spyder's licensing situation? Is commercial use allowed?
es: P: ¿Cuál es la situación de licenciamiento de Spyder? ¿Está permitido su uso comercial?

source: Spyder is 100% free and open source; there is no paid version or prohibition on commercial use. It is developed by its international user community, and supported by its users through `OpenCollective`_ and by its generous sponsoring organizations, including `Quansight`_ and `NumFOCUS`_. Our source code, standalone installers and most of our distribution methods (Pip/PyPI, Linux distros, MacPorts, WinPython, etc) can be freely redistributed, used and modified by anyone, for any purpose, including commercial use. For more details about the situation with Anaconda, see `that question`_.
es: Spyder es 100% gratuito y de código abierto; no hay ninguna versión de pago ni prohibición sobre el uso comercial. Es desarrollado por su comunidad internacional de usuarios, y soportado por sus usuarios a través de `OpenCollective`_ y por sus generosas organizaciones patrocinadoras, incluyendo `Quansight`_ y `NumFOCUS`_. Nuestro código fuente, instaladores independientes y la mayoría de nuestros métodos de distribución (Pip/PyPI, distribuciones Linux, MacPorts, WinPython, etc) pueden ser libremente redistribuidos, utilizados y modificados por cualquier persona, para cualquier propósito, incluyendo uso comercial. Para más detalles sobre la situación con Anaconda, vea `esa pregunta`_.

source: Q: What do the Anaconda licensing changes mean for Spyder?
es: P: ¿Qué significan los cambios de licenciamiento de Anaconda para Spyder?

source: If you use Spyder with the Anaconda distribution, they `recently changed`_ their `Terms of Service`_ to add restrictions on large (> 200 employee) for-profit companies using Anaconda on a large scale. However, these terms only apply to the package infrastructure (the full Anaconda distribution and the ``defaults`` conda channel). Instead, you can simply download the similar `Miniforge distribution`_, which is 100% open source and identical to full Anaconda (aside from not bundling the Python packages installed by default in the Anaconda ``base`` environment, which we recommend you avoid using anyway given any problems here can break your whole installation). Then, simply install the packages you need (including Spyder, if you aren't using our recommended :ref:`install-standalone`) with ``conda`` as you usually do. Miniforge will automatically use the community-maintained Conda-Forge repository, which has a much wider variety of packages and is generally more up to date than the Anaconda equivalent, in addition to being free of any commercial restrictions. For more, see our :doc:`/installation`.
es: Si usas Spyder con la distribución Anaconda, ellos recientemente cambiaron (`recently changed`_) sus términos de servicio (`Terms of Service`_) para añadir restricciones a grandes empresas (> 200 empleados) con fines de lucro que utilizan Anaconda a gran escala. Sin embargo, estos términos solo aplican a la infraestructura de paquetes (la distribución completa de Anaconda y el canal conda ``defaults``). En su lugar, puedes descargar la distribución Miniforge (`Miniforge distribution`_) que es 100% de código abierto e idéntica a Anaconda (aparte de no incluir los paquetes de Python instalados por defecto en el entorno ``base`` de Anaconda, que recomendamos que evites usar de todos modos dado que cualquier problema puede romper tu instalación). Luego, simplemente instala los paquetes que necesitas (incluyendo Spyder, si no estás usando nuestro :ref:`install-standalone` recomendado) con ``conda`` como lo haces normalmente. Miniforge utilizará automáticamente el repositorio Conda-Forge mantenido por la comunidad, que tiene una variedad de paquetes mucho más amplia y generalmente está más actualizada que el equivalente de Anaconda, además de estar libre de cualquier restricción comercial. Para más información, visita nuestra :doc:`/installation`.
