Repository: spyder-ide/spyder-docs
Catalog: doc/locales/*/LC_MESSAGES/index.po
Languages: es

source: FAQ
es: Preguntas Frecuentes (FAQ)

source: Welcome to Spyder's Documentation
es: Bienvenidos a la documentación de Spyder

source: Screenshot of the Spyder main window, with the default panel layout
es: Captura de pantalla de la ventana principal de Spyder, con el diseño de paneles por defecto

source: Spyder is a powerful scientific environment written in Python, for Python, and designed by and for scientists, engineers and data analysts. It features a unique combination of the advanced editing, analysis, debugging, and profiling functionality of a comprehensive development tool with the data exploration, interactive execution, deep inspection, and beautiful visualization capabilities of a scientific package.
es: Spyder es un poderoso entorno de desarrollo científico escrito en Python, para Python, y diseñado por y para científicos, ingenieros y analistas de datos. Ofrece una combinación única de las funcionalidades avanzadas de edición, análisis, depuración (debugging) y perfilado (profiling) de una completa herramienta de desarrollo, junto con las capacidades de exploración de datos, ejecución interactiva, inspección a profundidad y hermosas visualizaciones de un paquete científico.

source: Where to go now?
es: ¿A dónde ir ahora?

source: Spyder's documentation provides a variety of resources that will help you learn how to use the application and explore each one of its panes. These include video tutorials, in-depth descriptions and how-to guides covering a wide range of needs and experience levels with Spyder.
es: La documentación de Spyder proporciona una gran variedad de recursos que te ayudarán a aprender cómo usar la aplicación y a explorar cada uno de sus paneles. Estos incluyen video tutoriales, descripciones a profundidad y guías prácticas que cubren una amplia gama de necesidades y niveles de experiencia con Spyder.

source: If you are looking for a summary of its features and interface, check out the :doc:`quickstart`.
es: Si estás buscando un resumen de sus características e interfaz, revisa el :doc:`quickstart`.

source: If you don't have Spyder installed and want to get started, follow the :doc:`/installation`.
es: Si no tienes Spyder instalado y quieres empezar a usarlo, sigue la :doc:`/installation`.

source: If you are completely new to Spyder, watch our basic tutorial series, :doc:`videos/first-steps-with-spyder`.
es: Si no has usado Spyder antes, mira nuestra serie de tutoriales básicos, :doc:`videos/first-steps-with-spyder`.

source: If you are familiar with Spyder and want to explore the functionality of its panes in more detail, go to :doc:`panes/index`.
es: Si ya conoces Spyder y quieres explorar la funcionalidad de sus paneles en más detalle, ve a :doc:`panes/index`.

source: If you've run into a Spyder problem and need help solving it, take a look at our :doc:`troubleshooting guide<troubleshooting/first-steps>`.
es: Si tienes un problema con Spyder y necesitas ayuda para resolverlo, dale un vistazo a nuestra guía de :doc:`troubleshooting guide<troubleshooting/first-steps>`.

source: If you have a question about Spyder, visit the :doc:`faq` section.
es: Si tienes alguna pregunta sobre Spyder, visita la sección de :doc:`faq`.

source: Join our community
es: Únete a nuestra comunidad

source: Spyder is open source software, which means that is free for everyone to use and anyone can contribute to it. We encourage everyone to become a part of our community and help develop Spyder!
es: Spyder es software de código abierto, lo que significa que es gratuito para todos y que cualquiera puede contribuir al mismo. ¡Animamos a todos a formar parte de nuestra comunidad y a contribuir al desarrollo de Spyder!

source: Looking to contribute your code?
es: ¿Deseas contribuir tu código?

source: Spyder is written in the same Python language that you use it to develop, so its easy to get started contributing to it. You can follow our `contributing guide`_ to set up a development environment, and you can get involved with the project through our `Github repository`_. The easiest way to get started is helping us resolve items on our `issue tracker`_, either by fixing bugs in Spyder, or helping users troubleshoot their problems (which doesn't require writing any code).
es: Spyder está escrito en el mismo lenguaje (Python) que usas para tu código, por lo que es fácil empezar a contribuir al mismo. Puedes seguir nuestra `guía de contribución <contributing guide_>`_ para configurar un entorno de desarrollo e involucrarte en el proyecto a través de nuestro `repositorio de Github`_. La forma más sencilla de comenzar es ayudándonos a resolver los reportes en nuestro `issue tracker`_, ya sea corrigiendo errores en Spyder, o ayudando a los usuarios a solucionar sus problemas (lo que no requiere escribir ningún código).

source: Want to help writing docs?
es: ¿Quieres ayudar a escribir documentación?

source: We welcome your contributions of corrections, additions and enhancements to these docs. Check out the `docs contributing guide`_ to learn how to submit a PR with your changes on our `docs repo`_.
es: Agradecemos tus aportes en cuanto a correcciones, adiciones y mejoras a esta documentación. Echa un vistazo a la `guía de contribución de documentación`_ en nuestro `repositorio`_ para aprender cómo enviar una PR con tus cambios.

source: Interested in translating Spyder?
es: ¿Estás interesado en traducir Spyder?

source: In order to reach more users around the world in need of a powerful scientific Python environment, we welcome your help translating the documentation and the interface into different languages.
es: A fin de llegar a más usuarios alrededor del mundo que necesiten un poderoso entorno científico para Python, agradecemos tu ayuda para traducir la documentación e interfaz a diferentes idiomas.

source: For this purpose we use `Crowdin`_, which provides a simple web based interface for translators, proofreaders and managers, so everyone can help us translate Spyder into any language.
es: Para ello utilizamos `Crowdin`_, que proporciona una interfaz web sencilla para traductores, revisores y managers, de forma que todos puedan ayudarnos a traducir Spyder a cualquier idioma.

source: Want to be part of our social media?
es: ¿Quieres formar parte de nuestras redes sociales?

source: Connect with Spyder through our social media channels to stay up to date with our current developments!
es: ¡Conéctate con Spyder a través de nuestras redes sociales para estar al día de nuestras últimas novedades!
