Repository: spyder-ide/spyder-docs
Catalog: doc/locales/*/LC_MESSAGES/installation.po
Languages: es

source: Also, the Spyder versions they install may be out of date relative to the current release, and thus be missing the latest features and bug fixes.
es: Además, las versiones de Spyder que instalan pueden estar desactualizadas respecto a la versión actual, y por lo tanto faltan las últimas características y correcciones de errores.

source: Therefore, we recommend you switch to our :ref:`install-standalone` (Windows and macOS) or a :ref:`install-conda` if you encounter installation issues you are unable to solve on your own.
es: Por lo tanto, te recomendamos cambiar a nuestro :ref:`install-standalone` (Windows y macOS) o a un :ref:`install-conda` si encuentras problemas de instalación que no puedes resolver por ti mismo.

source: Spyder is included in the `WinPython`_ scientific Python distribution, along with many other common numerical computing and data analysis packages. You can use Spyder immediately after installing, similar to Anaconda.
es: Spyder está incluido en la distribución científica de Python `WinPython`_, junto con muchos otros paquetes comunes de cálculo y análisis de datos. Puedes usar Spyder inmediatamente después de la instalación, similar a Anaconda.

source: Spyder is available as `a cask`_ through `Homebrew`_.
es: Spyder está disponible como un `cask`_ a través de `Homebrew`_.

source: To install it using the ``brew`` package manager, run:
es: Para instalarlo usando el gestor de paquetes ``brew``, ejecuta:

source: It is also available as a `a port`_ through `MacPorts`_.
es: También está disponible como un `port`_ a través de `MacPorts`_.

source: To install it using the ``port`` package manager, run:
es: Para instalarlo usando el gestor de paquetes ``port``, ejecuta:

source: Spyder can be installed via third-party distro packages on most common Linux distributions.
es: Spyder se puede instalar a través de paquetes de distribución de terceros en las distribuciones de Linux más comunes.

source: Running Spyder installed this way will generally be the same as any other distro-installed application. Alternatively, it can be launched from the terminal with ``spyder`` (or ``spyder3``, on older versions of some distros).
es: Al instalar Spyder de esta forma, puede ser ejecutado al igual que cualquier otra aplicación obtenida a través de tu distribución. Alternativamente, puede ser lanzado desde la terminal con ``spyder`` (o ``spyder3``, en versiones antiguas de algunas distribuciones).

source: Spyder is available as `a Ubuntu package`_ and `a Debian package`_.
es: Spyder está disponible como `un paquete Ubuntu`_ y `un paquete Debian`_.

source: To install it using the ``apt`` package manager, run:
es: Para instalarlo usando el gestor de paquetes ``apt``, ejecuta:

source: Other distributions
es: Otras distribuciones

source: Spyder is also available in other GNU/Linux distributions, including:
es: Spyder también está disponible en otras distribuciones GNU/Linux, incluyendo:

source: Please refer to the links or your distribution's documentation for how to install Spyder.
es: Por favor, consulta los enlaces o la documentación de tu distribución sobre cómo instalar Spyder.

source: Development builds
es: Versiones de desarrollo

source: If you want to try the next Spyder version before it is released, you can! You may want to do this for fixing bugs in Spyder, adding new features, learning how Spyder works or just getting a taste of what the IDE can do. For more information, please see the `Contributing Guide`_ included with the Spyder source or on Github, and for further detail consult the `Spyder development wiki`_.
es: Si quieres probar la siguiente versión de Spyder antes de que sea lanzada, ¡puedes hacerlo! Es posible que quieras hacer esto para corregir errores en Spyder, añadir nuevas características, aprender cómo funciona Spyder o simplemente probar lo que el IDE puede hacer. Para más información, por favor vea la `Guía de Contribución`_ incluida con el código fuente de Spyder o en Github, y para más detalles consulte la `Guía de Desarrollo de Spyder`_.

source: Additional help
es: Ayuda adicional

source: *Looking for general information about Spyder and its ecosystem?* See our `main website`_.
es: *¿Buscas información general sobre Spyder y su ecosistema?* Ve a nuestro `sitio web principal`_.

source: *Need to submit a bug report or feature request?* Check out our `Github repository`_.
es: *¿Necesitas enviar un informe de error o solicitud de características?* Revisa nuestro `repositorio de Github`_.

source: *Want development-oriented help and information?* Consult our `Github wiki`_.
es: *¿Quieres ayuda e información orientada al desarrollo?* Consulta nuestro `Github wiki`_.

source: *Have a help request or discussion topic?* Subscribe to our `Google Group`_.
es: *¿Tienes una solicitud de ayuda o un tema de discusión?* Suscríbete a nuestro `Grupo de Google`_.

source: *Asking a quick question or want to chat with the dev team?* Stop by our `Gitter chatroom`_.
es: *¿Hacer una pregunta rápida o quieres chatear con el equipo de desarrolladores?* Pásate por nuestro `chat de Gitter`_.

source: *Seeking personalized help from expert Spyder consultants?* Visit `OpenTeams`_.
es: *¿Buscando ayuda personalizada de consultores expertos de Spyder?* Visita `OpenTeams`_.
