Repository: spyder-ide/spyder-docs
Catalog: doc/locales/*/LC_MESSAGES/installation.po
Languages: es

source: Install Guide
es: Guía de instalación

source: Spyder is relatively easy to install on Windows, Linux and macOS. Just make sure to read and follow these instructions with care.
es: Spyder es relativamente fácil de instalar en Windows, Linux y macOS. Solo asegúrate de leer y seguir estas instrucciones con cuidado.

source: If you run into problems, before posting a report, *please* consult our comprehensive :doc:`troubleshooting guide</troubleshooting/first-steps>` and search the `issue tracker`_ for your error message and problem description. These methods generally fix or isolate the great majority of install-related difficulties. Thanks!
es: Si tienes problemas antes de publicar un informe *por favor* consulta nuestra guía completa :doc:`guía de solución de problemas</troubleshooting/first-steps>` y busca en el `seguimiento de incidencias`_ tu mensaje de error y descripción de problema. Estos métodos generalmente arreglan o aislan la gran mayoría de las dificultades relacionadas con la instalación. ¡Gracias!

source: For most users on Windows and macOS, we recommend our :ref:`install-standalone` as the most straightforward and robust option to obtain Spyder. For users needing Linux support, third-party Spyder plugins or Variable Explorer compatibility with custom-installed packages—all capabilities which the standalone installers currently do not yet provide—we advise using a :ref:`install-conda`. Linux, plugin and package/environment management support in the standalone installers are currently under active development for future Spyder versions.
es: Para la mayoría de los usuarios en Windows y macOS, recomendamos nuestra :ref:`install-standalone` como la opción más sencilla y robusta para obtener Spyder. Para los usuarios que necesitan soporte para Linux, plugins Spyder de terceros o compatibilidad con Variable Explorer con paquetes instalados a medida, todas las capacidades que los instaladores independientes aún no proporcionan, recomendamos usar :ref:`install-conda`. Linux, plugin y soporte de gestión de paquetes/entorno en los instaladores independientes están actualmente en activo desarrollo para las futuras versiones de Spyder.

source: Try Spyder online
es: Probar Spyder en línea

source: Want to try out Spyder without installing it? With `Binder`_ you can work with a fully functional copy of Spyder online that runs right in your web browser, no installation needed. Visit the `Spyder Binder`_ to get started using Spyder.
es: ¿Quieres probar Spyder sin instalarlo? Con `Binder`_ puedes trabajar con una copia completamente funcional de Spyder online que se ejecuta directamente en tu navegador web, sin necesidad de instalación. Visita el `Spyder Binder`_ para comenzar a usar Spyder.

source: Spyder running on Binder
es: Spyder corriendo en Binder

source: Standalone installers
es: Instaladores independientes

source: The standalone installers are our recommended method for most users on Windows and macOS, with experimental Linux support under active development. They work like any other IDE, where Spyder can be installed and updated independently of the Python environments you use to run your code. This avoids the problems with incompatible packages and broken installations users often face when mixing Spyder with the (Conda, etc) environments they use to run their code.
es: Los instaladores independientes son nuestro método recomendado para la mayoría de los usuarios en Windows y macOS, con soporte experimental para Linux bajo activo desarrollo. Estos funcionan como cualquier otro IDE, donde Spyder puede ser instalado y actualizado independientemente de los entornos Python que utilices para ejecutar tu código. Esto evita los problemas con paquetes incompatibles e instalaciones rotas que los usuarios suelen enfrentar cuando mezclan Spyder con los entornos (Conda, etc) que usan para ejecutar su código.

source: The installers include a built-in Python environment with the most common scientific libraries (e.g. NumPy, Pandas, Matpotlib, etc), which can be used out of the box for basic data analysis tasks. However, to manage your own packages and environments, you'll currently need to connect an external Python distribution (such as `Anaconda`_, `Miniconda`_, `Miniforge/Mambaforge`_, `WinPython`_ or `Python.org <Python_>`__) to your standalone copy of Spyder. For more information on this, see our :ref:`FAQ entry on the subject <using-packages-installer>`.
es: Los instaladores incluyen un entorno Python integrado con las librerías científicas más comunes (NumPy, Pandas, Matpotlib, etc), que se puede utilizar de forma automática para las tareas básicas de análisis de datos. Sin embargo, para gestionar tus propios paquetes y entornos, actualmente necesitarás conectar una distribución externa de Python (como `Anaconda`_, `Miniconda`_, `Miniforge/Mambaforge`_, `WinPython`_ o `Python.org <Python_>`__) a tu copia independiente de Spyder. Para más información sobre esto, ve nuestra entrada :ref:`FAQ sobre el asunto <using-packages-installer>`.

source: The standalone installers do not yet support installing third-party Spyder plugins not already bundled with them, though this feature is currently under development. For now, if you need this capability, we recommend a :ref:`install-conda`.
es: Los instaladores independientes todavía no soportan la instalación de complementos Spyder de terceros que no están ya empaquetados con ellos, aunque esta característica está actualmente en desarrollo. Por ahora, si necesitas esta capacidad, recomendamos un :ref:`install-conda`.

source: Downloading and installing
es: Descargar e instalar

source: To download the supported Spyder installer for your platform, simply click the appropriate link below (for Linux, see the :ref:`install-conda` section). Then, double-click the downloaded file to open the installer. If a security warning pops up, you may need to click :guilabel:`Yes`, :guilabel:`OK`, :guilabel:`Open`, :guilabel:`Allow` or similar.
es: Para descargar el instalador Spyder soportado para tu plataforma, simplemente haz clic en el enlace apropiado de abajo (para Linux, consulta la sección :ref:`install-conda`). Luego, haz doble clic en el archivo descargado para abrir el instalador. Si aparece una advertencia de seguridad, puede que necesites hacer clic en :guilabel:`Sí`, :guilabel:`OK`, :guilabel:`Abrir`, :guilabel:`Permitir` o similares.

source: On Windows, if a "SmartScreen" dialog appears, click :guilabel:`More info` followed by :guilabel:`Run anyway`, and then proceed through the steps in the installer.
es: En Windows, si aparece un diálogo "SmartScreen", haz clic en :guilabel:`Más información` seguido por :guilabel:`Ejecutar de todos modos`, y luego procede a través de los pasos del instalador.

source: On macOS, open the disk image and drag Spyder to your :guilabel:`Applications` folder.
es: En macOS, abre la imagen del disco y arrastra Spyder a tu carpeta de :guilabel:`Aplicaciones`.

source: "Lite" versions of both installers are also available from the `releases page`_, which are somewhat smaller than the full installers. These lack a number of optional but recommended dependencies, such as NumPy, SciPy and Pandas, meaning that a few :doc:`/panes/variableexplorer` features, including graphical data import wizards and support for rich display and editing of NumPy arrays and Pandas DataFrames, will not be available. Given this only saves a modest amount of space while missing out on significant features, we recommend using the full installers unless minimizing download/install size and memory usage is a priority.
es: Las versiones "Lite" de ambos instaladores también están disponibles en `releases page`_, que son algo más pequeñas que los instaladores completos. Estas carecen de un número de dependencias opcionales pero recomendadas, como NumPy, SciPy y Pandas, lo que significa que algunas características de :doc:`/panes/variableexplorer`, incluyendo asistentes gráficos de importación de datos y soporte para la visualización y edición enriquecida de matrices NumPy y Pandas DataFrames, no estarán disponibles. Dado que esto solo ahorra una modesta cantidad de espacio mientras se pierden características significativas, recomendamos usar los instaladores completos a menos que minimizar el tamaño de descarga/instalación y el uso de memoria sea una prioridad.

source: Running from a standalone install
es: Ejecutar desde una instalación independiente

source: To run Spyder when installed standalone, you can simply use your operating system's typical method of launching applications, such as opening it from the :guilabel:`Start` menu on Windows (or the Taskbar, if you've pinned it there), or from Launchpad, Spotlight or the :guilabel:`Applications` folder on macOS (or the Dock, if you've added it there).
es: Para ejecutar Spyder cuando se instala de forma autónoma, simplemente puedes utilizar el método típico de tu sistema operativo para iniciar aplicaciones, tal como abrirlo desde el menú :guilabel:`Inicio` en Windows (o la barra de tareas, si lo has anclado ahí), o desde Launchpad, Spotlight o la carpeta :guilabel:`Aplicaciones` en macOS (o el Dock, si lo has añadido allí).

source: Updating a standalone install
es: Actualizar una instalación independiente

source: By default, Spyder checks for updates automatically on startup, and you can also check manually with :menuselection:`Help --> Check for updates`. The standalone installers for Spyder 5.4.0+ include update functionality built right into Spyder, which after checking for updates will display a prompt to automatically download and install the current version. On earlier versions, you'll need to manually download and install the latest release (if on Windows, make sure to remove the old version first from Control Panel/System Settings).
es: Por defecto, Spyder comprueba las actualizaciones automáticamente al iniciar, y también puede comprobar manualmente con :menuselection:`Ayuda --> Buscar actualizaciones`. Los instaladores autónomos para Spyder 5.4.0+ incluyen la funcionalidad de actualización incorporada directamente en Spyder, que después de comprobar si hay actualizaciones, mostrará un mensaje para descargar e instalar automáticamente la versión actual. En versiones anteriores, necesitarás descargar e instalar manualmente la última versión (en Windows, asegúrate de eliminar la versión antigua primero en la Configuración del Panel de Control/Sistema).

source: Conda-based distributions
es: Distribuciones basadas en Conda

source: Spyder is included by default in the `Anaconda`_ Python distribution, which comes with everything you need to get started in an all-in-one package. It can also be easily installed in the much lighter-weight `Miniconda`_ and `Miniforge/Mambaforge`_, which include just Python and the Conda/Mamba package and environment manager by default (with Miniforge defaulting to the Conda-Forge channel, and Mambaforge using Mamba, a much faster alternative to Conda). This is our recommended installation method on Linux and for users with third-party Spyder plugins, as support for both of these in our standalone installers is still under active development.
es: Spyder se incluye por defecto en la distribución `Anaconda`_ de Python, que viene con todo lo que necesitas para empezar con un paquete todo en uno. También puede instalarse fácilmente en el mucho más ligero `Miniconda`_ y `Miniforge/Mambaforge`_, que solamente incluyen Python y el paquete y gestor de entorno Conda/Mamba por defecto (con Miniforge por defecto en el canal Conda-Forge, y Mambaforge utilizando Mamba, una alternativa mucho más rápida a Conda). Este es nuestro método de instalación recomendado en Linux y para usuarios con plugins Spyder de terceros, ya que el soporte para ambos en nuestros instaladores independientes todavía está en proceso de desarrollo.

source: Conda environment
es: Entorno Conda

source: With Miniconda/Miniforge/Mambaforge, or to get a more reliable and up-to-date Spyder version with Anaconda, we strongly recommend installing Spyder into its own dedicated Conda environment.
es: Con Miniconda/Miniforge/Mambaforge, o para obtener una versión más fiable y actualizada de Spyder con Anaconda, te recomendamos encarecidamente instalar Spyder en tu propio entorno Conda.

source: If using Mamba/Mambaforge, substitute ``mamba`` for ``conda`` in the following commands.
es: Si usas Mamba/Mambaforge, sustituye ``mamba`` por ``conda`` en los siguientes comandos.

source: Installing with Conda
es: Instalar con Conda

source: For a full install of Spyder and all optional dependencies, run the following command in your Anaconda Prompt (Windows) or terminal:
es: Para una instalación completa de Spyder y todas las dependencias opcionales, ejecuta el siguiente comando en tu Anaconda Prompt (Windows) o terminal:

source: For a minimal install without the optional functionality and integration with the above packages, you can instead run:
es: Para una instalación mínima sin la funcionalidad opcional y la integración con los paquetes anteriores, puedes ejecutar:

source: This installs Spyder into a new environment called ``spyder-env``, using the more up-to-date, community-run Conda-Forge channel. To make sure future installs/updates in this environment also use Conda-Forge and are faster and more reliable, make sure to set it as your environment's default channel with strict channel priority enabled, if this isn't the case already (as it is with Miniforge/Mambaforge or if you've manually configured it):
es: Esto instala Spyder en un nuevo ambiente llamado ``spyder-env``, usando el canal Conda-Forge más actualizado, ejecutado por la comunidad. Para asegurarse de que futuras instalaciones/actualizaciones en este entorno también utilizan Conda-Forge y que sean más rápidas y confiables, asegúrate de establecerlo como el canal predeterminado de tu entorno con la prioridad estricta de canal activada, si este no es el caso (como lo es con Miniforge/Mambaforge o si lo has configurado manualmente):

source: Here's a summary of the main steps.
es: Aquí tienes un resumen de los pasos principales.

source: Running Spyder installation with conda
es: Ejecutando una instalación de Spyder con conda

source: Running with Conda
es: Ejecutar con Conda

source: You can then run Spyder by the same methods :ref:`as with Anaconda <install-anaconda-running>`, except that you need to make sure to launch the Start menu shortcut with ``(spyder-env)`` in the name, select the ``spyder-env`` environment on the left before launching it with Navigator, or type ``conda activate spyder-env`` before launching it on the command line.
es: Luego puedes ejecutar Spyder por los mismos métodos :ref:`que con Anaconda <install-anaconda-running>`, excepto que necesitas asegurarte de iniciar el acceso directo del menú Inicio con ``(spyder-env)`` en el nombre, selecciona el entorno ``spyder-env`` a la izquierda antes de lanzarlo con Navigator, o escribe ``conda activate spyder-env`` antes de lanzarlo en la línea de comandos.

source: See :ref:`our FAQ question <using-existing-environment>` for more information about how to use Spyder with your existing Conda environments.
es: Ve a :ref:`nuestras preguntas frecuentes FAQ <using-existing-environment>` para más información sobre cómo usar Spyder con sus entornos Conda existentes.

source: Updating with Conda
es: Ejecutar con Conda

source: With any Conda-based distribution and Spyder installed in its own environment (recommended), update Conda itself, active the environment, and finally update Spyder. In your system terminal (or Anaconda Prompt if on Windows), run:
es: Con cualquier distribución basada en Conda y Spyder instalados en su propio entorno (recomendado), actualiza Conda en sí mismo, activa el entorno y finalmente actualiza Spyder. En tu terminal del sistema, o en el Anaconda Prompt si estás en Windows, ejecuta:

source: In case you get an error trying to update, just remove the existing environment (if using one other than ``base``):
es: En caso de que se produzca un error al intentar actualizar, simplemente elimina el entorno existente (si se utiliza otro que no sea ``base``):

source: And then :ref:`recreate a fresh one <install-conda-installing>`.
es: Y luego :ref:`recrea uno nuevo <install-conda-installing>`.

source: While we recommend always using a dedicated environment, with Anaconda you can also run the bundled copy of Spyder from the built-in ``base`` environment.
es: Aunque recomendamos utilizar siempre un entorno dedicado, con Anaconda también puede ejecutar la copia empaquetada de Spyder desde el entorno ``base`` incorporado.

source: The bundled Spyder version can often be quite out of date, missing new features and bug fixes from the latest version, and if you install, change or remove other packages, there is a significant chance of dependency conflicts or a broken Spyder installation. Therefore, we recommend :ref:`installing Spyder into a new Conda environment <install-conda-installing>` to avoid all these issues.
es: La versión empaquetada de Spyder a menudo puede estar bastante desactualizada, faltando nuevas características y correcciones de errores que están en la última versión, y si instalas, cambias o eliminar otros paquetes, hay una gran probabilidad de conflictos de dependencias o de una instalación rota de Spyder. Por lo tanto, recomendamos que :ref:`instales Spyder en un nuevo entorno Conda <install-conda-installing>` para evitar todos estos problemas.

source: Running with Anaconda
es: Ejecutar con Anaconda

source: To run the bundled version of Spyder after installing it with Anaconda, the recommended method on Windows is to launch it via the Start menu shortcut. On other platforms, open Anaconda Navigator, scroll to Spyder under :guilabel:`Home` and click :guilabel:`Launch`.
es: Para ejecutar la versión empaquetada de Spyder después de instalarla con Anaconda, el método recomendado en Windows es lanzarlo a través del acceso directo al menú Inicio. En otras plataformas, abre Anaconda Navigator, desplázate a Spyder bajo :guilabel:`Home` y haz clic en :guilabel:`Launch`.

source: Anaconda Navigator showing Spyder
es: Anaconda Navigator mostrando Spyder

source: If Spyder does not start via this method or you prefer to use the command line, open Anaconda Prompt (Windows) or your terminal (other platforms), type ``conda activate base`` then ``spyder``.
es: Si Spyder no se inicia a través de este método o prefieres utilizar la línea de comandos, abre el Anaconda Prompt (Windows) o tu terminal (otras plataformas), escribe ``conda activate base`` y luego ``spyder``.

source: Updating with Anaconda
es: Actualizar con Anaconda

source: With Spyder installed in Anaconda's ``base`` environment, first update the ``anaconda`` meta-package, and then Spyder itself (in case there is a newer version than that pinned to the ``anaconda`` metapackage). In your system terminal (or Anaconda Prompt if on Windows), run:
es: Con Spyder instalado en el entorno Anaconda ``base``, primero actualiza el meta-paquete ``anaconda``, y luego Spyder en sí, en caso de que haya una versión más reciente que la fijada al metapaquete ``anaconda``. En tu terminal de sistema (o Anaconda Prompt si en Windows), ejecutar:

source: These commands also update all your other packages, which is one reason we strongly recommend you use an isolated conda environment to avoid any potential unintended effects on other installed packages.
es: Estos comandos también actualizan todos los demás paquetes, es una de las razones por las que recomendamos que utilices un entorno conda aislado para evitar posibles efectos no intencionados en otros paquetes instalados.

source: In case you get an error resolving dependencies, try uninstalling Spyder and re-installing it:
es: En caso de que obtengas un error resolviendo las dependencias, intenta desinstalar Spyder y reinstalarlo:

source: Using pip
es: Usar Pip

source: While this installation method is a viable option for experienced users, installing Spyder (and other PyData-stack packages) with pip can sometimes lead to tricky issues, particularly on Windows and macOS. While you are welcome to try it on your own, we are typically not able to provide individual support for installation problems with pip, except to recommend our :ref:`install-standalone` (Windows and macOS) or a :ref:`install-conda`.
es: Si bien este método de instalación es una opción viable para usuarios experimentados, instalar Spyder (y otros paquetes de PyData-stack) con pip a veces puede llevar a problemas complicados, particularmente en Windows y macOS. Aunque eres bienvenido a probarlo por tu cuenta, normalmente no somos capaces de proporcionar soporte individual para problemas de instalación con pip excepto para recomendar nuestro :ref:`install-standalone` (Windows y macOS) o un :ref:`install-conda`.

source: You can install Spyder with the pip package manager, which is included by default with most Python installations. Before installing Spyder itself by this method, you need to download the `Python`_ programming language.
es: Puedes instalar Spyder con el gestor de paquetes pip, que se incluye por defecto en la mayoría de las instalaciones de Python. Antes de instalar Spyder en sí mismo mediante este método, necesitas descargar el lenguaje de programación `Python`_.

source: Due to a known issue with some DEB-based Linux distributions (Debian, Ubuntu, Mint), you might also need to install the ``pyqt5-dev-tools`` package first, with ``sudo apt install pyqt5-dev-tools``.
es: Debido a un problema conocido con algunas distribuciones Linux basadas en DEB (Debian, Ubuntu, Mint), podrías necesitar instalar primero el paquete ``pyqt5-dev-tools`` con ``sudo apt install pyqt5-dev-tools``.

source: You'll first want to create and activate a virtual environment in which to install Spyder, via one of the following methods.
es: Primero querrás crear y activar un entorno virtual en el cual instalar Spyder, mediante uno de los siguientes métodos.

source: With ``virtualenvwrapper``:
es: Con ``virtualenvapper``:

source: Otherwise, on macOS/Linux/Unix:
es: De lo contrario, en macOS/Linux/Unix:

source: or on Windows:
es: o en Windows:

source: After activating your environment, to install Spyder and its optional dependencies, run:
es: Después de activar tu entorno, para instalar Spyder y sus dependencias opcionales, ejecuta:

source: Or for a minimal installation, run:
es: O para una instalación mínima, ejecuta:

source: Running Spyder installation with pip
es: Ejecutando una instalación de Spyder con pip

source: To launch Spyder after installing it, ensure your environment is activated and run the ``spyder`` or ``spyder3`` command.
es: Para iniciar Spyder después de instalarlo, asegúrate de que tu entorno está activado y ejecuta el comando ``spyder`` o ``spyder3``.

source: And to update Spyder, with your Spyder environment activated, run:
es: Y para actualizar Spyder, con tu entorno Spyder activado, ejecuta:

source: Alternative methods
es: Métodos alternativos

source: While we describe alternative Spyder installation options for users who prefer them, as these are third-party distributions that we have no direct involvement in, we are usually not able to offer useful individual assistance for problems specific to installing via these alternative methods.
es: Mientras describimos opciones alternativas de instalación de Spyder para los usuarios que las prefieren, ya que se trata de distribuciones de terceros en las que no tenemos ninguna implicación directa, normalmente no podemos ofrecer asistencia individual útil para problemas específicos de instalación a través de estos métodos alternativos.
