Repository: spyder-ide/spyder-docs
Catalog: doc/locales/*/LC_MESSAGES/panes.po
Languages: es

source: Debugger
es: Depurador (Debugger)

source: **Debugging** in Spyder is supported through integration with the enhanced ``ipdb`` debugger in the :doc:`ipythonconsole`. This allows breakpoints and the execution flow to be viewed and controlled right from the Spyder GUI, as well as with all the familiar IPython console commands.
es: La **depuración** en Spyder es compatible a través de la integración con el depurador mejorado de ``ipdb`` en la consola :doc:`ipythonconsole`. Esto permite que los puntos de interrupción y el flujo de ejecución sean vistos y controlados directamente desde el Spyder GUI, así como con todos los comandos conocidos de la consola IPython.

source: Debugging with ipdb
es: Depurando con ipdb

source: You can fully control debugger execution from the :guilabel:`Debug` menu, :guilabel:`Debug toolbar` and via configurable keyboard shortcuts, along with the standard ``ipdb`` `console commands`_.
es: Puedes controlar completamente la ejecución del depurador desde el menú :guilabel:`Depurar` de la :guilabel:`Barra de herramientas de depuración` y a través de atajos de teclado configurables, junto con el estándar ``ipdb`` `comandos de consola`_.

source: Additionally, the :doc:`editor` shows the line of code the debugger is currently stopped on with an arrow.
es: Además, el :doc:`editor` muestra la línea de código en la que el depurador se detiene con una flecha.

source: Spyder's debugger offers syntax highlighting, code completion and command history, which work exactly like they do in the normal interactive interpreter.
es: El depurador de Spyder ofrece resaltado de sintaxis, terminación de código e historial de comandos, que funcionan exactamente como lo hacen en el intérprete interactivo normal.

source: Use the up and down arrows to recall previous commands, and press :kbd:`Tab` to trigger autocomplete suggestions.
es: Usa las flechas arriba y abajo para recordar comandos anteriores, y pulsa :kbd:`Tab` para activar sugerencias de autocompletado.

source: Furthermore, IPython's `magic functions`_ are available in debugging mode. You can, for example, run ``%ls`` to list the contents of your current working directory or ``%timeit`` to check how fast a given snippet of code is.
es: Además, las `funciones mágicas`_ de IPython están disponibles en modo de depuración. Puedes, por ejemplo, ejecutar ``%ls`` para listar los contenidos de tu directorio de trabajo actual o ``%timeit`` para comprobar cuán rápido es un fragmento de código dado.

source: Finally, you can enter and execute multiline statements in Spyder's debugger just like with the regular IPython prompt, to easily run complex code.
es: Por último, puedes introducir y ejecutar sentencias multilíneas en el depurador de Spyder de la misma forma que con la petición IPython habitual, para ejecutar fácilmente código complejo.

source: Breakpoints
es: Puntos de interrupción

source: Spyder's debugger is integrated with the :guilabel:`Breakpoints` pane, which lists the file, line, and condition (if any) of every breakpoint defined. To open it, select :menuselection:`Debug --> List breakpoints`, or press :kbd:`Ctrl-Shift-B` (:kbd:`Cmd-Shift-B` on macOS).
es: El depurador de Spyder está integrado con el panel de :guilabel:`Breakpoints`, el cual muestra el archivo, la línea y la condición (si existe) de cada punto de interrupción definido. Para abrirlo, selecciona :menuselection:`Depurar --> Listar puntos de interrupción`, o pulsa :kbd:`Ctrl-Shift-B` (:kbd:`Cmd-Shift-B` en macOS).

source: There are several different ways to set and clear breakpoints:
es: Hay varias maneras diferentes de establecer y limpiar los puntos de interrupción:

source: With the :guilabel:`Set/clear breakpoint` option in the Debug menu.
es: Con la opción :guilabel:`Añadir o eliminar un punto de interrupción` en el menú depuración.

source: Through pressing the configurable keyboard shortcut (:kbd:`F12` for normal, or :kbd:`Shift-F12` for conditional breakpoints by default).
es: Presionando el atajo de teclado configurable (:kbd:`F12` para normal, o :kbd:`Shift-F12` para puntos de interrupción condicional por defecto).

source: By clicking to the left of the line number in an open file in the Editor (adding :kbd:`Shift` for a conditional breakpoint).
es: Al hacer clic a la izquierda del número de línea en un archivo abierto en el Editor (agregando :kbd:`Shift` para un punto de interrupción condicional).

source: With the ``breakpoint()`` builtin function in your code.
es: Con la función incorporada ``breakpoint()`` en tu código.

source: Interactively, using the ``b`` command in a debugging session.
es: Interactivamente, usando el comando ``b`` en una sesión de depuración.

source: You can access and edit local and global variables at each breakpoint through the :doc:`variableexplorer`.
es: Puedes acceder y editar variables locales y globales en cada punto de interrupción a través del :doc:`variableexplorer`.

source: Advanced features
es: Funcionalidades avanzadas

source: You can avoid stepping through other Python packages while debugging by enabling the new :guilabel:`Ignore Python libraries while debugging` option in Spyder's preferences, under :menuselection:`IPython Console --> Debugger --> Debug`. This will skip all the built-in and third-party Python modules you have installed.
es: Puedes evitar pasar por otros paquetes de Python mientras depuras activando :guilabel:`Ignorar las librerías de Python mientras se depura` en las preferencias de Spyder, bajo :menuselection:`Terminal de IPython --> Depurador --> Depurar`. Esto omitirá todos los módulos Python integrados y de terceros que haya instalado.

source: If your code has variables with the same names as Pdb commands (e.g. ``b`` or ``step``), you can still refer to them as normal while debugging. To call the respective Pdb command, just add an exclamation point before it (e.g. ``!b`` or ``!step``).
es: Si tu código tiene variables con los mismos nombres que los comandos Pdb (por ejemplo, ``b`` o ``step``), todavía puedes referirte a ellos como normales mientras depuras. Para llamar al comando Pdb correspondiente, simplemente agrega un punto de exclamación antes de él (por ejemplo, ``!b`` o ``!step``).

source: You can have Spyder automatically execute a custom snippet of code every time the debugger stops. For example, you can use this to set specific variables, or import commonly-used modules so they are always available while debugging. To set this up, go to :menuselection:`Preferences --> IPython Console --> Debugger --> Run code while debugging`, and enter the code that you want to be executed with each step.
es: Puedes hacer que Spyder ejecute automáticamente un fragmento de código personalizado cada vez que el depurador se detiene. Por ejemplo, puedes usar esto para establecer variables específicas, o importar módulos usados comúnmente para que estén siempre disponibles durante la depuración. Para configurar esto, vaya a :menuselection:`Preferencias --> Terminal de IPython --> Depurador --> Ejecutar código al depurar`, e introduce el código que deseas que se ejecute con cada paso.

source: Matplotlib support
es: Soporte Matplotlib

source: Generating Matplotlib figures is fully supported while the debugger is active, including all the different graphics backends. Use the ``%matplotlib`` magic to change to an interactive backend (e.g. ``%matplotlib qt5``) to pan, zoom and adjust your plots in a separate window, or switch back to the default ``inline`` (``%matplotlib inline``) to see them displayed right in the :doc:`plots` pane.
es: La generación de figuras de Matplotlib está totalmente soportada mientras el depurador está activo, incluyendo todos los diferentes backends gráficos. Utilice la magia ``%matplotlib`` para cambiar a un backend interactivo (por ejemplo, ``%matplotlib qt5``) para anclar, acercar y ajustar tus gráficas en una ventana separada, o vuelve al ``inline`` predeterminado (``%matplotlib inline``) para verlos mostrados directamente en el panel :doc:`plots`.

source: To avoid showing plots while debugging, deactivate the :guilabel:`Process execute events while debugging` option in :menuselection:`Preferences --> IPython console --> Debugger`.
es: Para evitar mostrar gráficos mientras se depura, desactiva la opción :guilabel:`Procesar ejecución de eventos al depurar` en :menuselection:`Preferencias --> Terminal de IPython --> Depurador`.

source: Related panes
es: Paneles relacionados

source: Spyder's multi-language **Editor** pane is the key element of the IDE, where you can create, open, and modify source files. The Editor offers a variety of core features, such as autocompletion, real-time analysis, syntax highlighting, horizontal and vertical splitting, and much more. In addition, it integrates a number of powerful tools for an easy to use, efficient editing experience.
es: El panel del **Editor** de varios lenguajes de Spyder es el elemento clave del IDE, donde puedes crear, abrir y modificar los archivos de origen. El editor ofrece una variedad de características básicas, tales como autocompletado, análisis en tiempo real, resaltado de sintaxis, división horizontal y vertical, y mucho más. Además, integra una serie de poderosas herramientas para una experiencia de edición fácil y eficiente.

source: Key components
es: Componentes clave

source: The Editor pane consists of the following areas:
es: El panel del Editor consta de las siguientes áreas:

source: The left sidebar shows line numbers and displays any code analysis warnings that exist in the current file. Clicking a line number selects the text on that line, and clicking to the right of it sets a :ref:`breakpoint <debugging-breakpoints>`.
es: La barra lateral izquierda muestra los números de línea y muestra las advertencias de análisis de código que existen en el archivo actual. Al hacer clic en un número de línea selecciona el texto en esa recta, y haciendo clic a la derecha se establece un :ref:`punto de interrupción<debugging-breakpoints>`.

source: The scrollbars allow vertical and horizontal navigation in a file.
es: Las barras de desplazamiento permiten la navegación vertical y horizontal en un archivo.

source: The context (right-click) menu displays actions relevant to whatever was clicked.
es: El menú contextual (clic derecho) muestra acciones relevantes a cualquier cosa que se haya seleccionado.

source: The options menu ("Hamburger" icon at top right) includes useful settings and actions relevant to the Editor.
es: El menú de opciones (icono "Hamburguesa" en la parte superior derecha) incluye opciones útiles y acciones relevantes para el Editor.

source: The location bar at the top of the Editor pane shows the full path of the current file.
es: La barra de ubicación en la parte superior del panel del Editor muestra la ruta completa del archivo actual.

source: The tab bar displays the names of all opened files. It also has a :guilabel:`Browse tabs` button (at left) to show every open tab and switch between them—which comes in handy if many are open.
es: La barra de pestañas muestra los nombres de todos los archivos abiertos. También tiene un botón :guilabel:`Navegar por las pestañas` (a la izquierda) para mostrar cada pestaña abierta y cambiar entre ellas, que es útil si muchas están abiertas.

source: Interface
es: Interfaz

source: Tabs
es: Pestañas

source: You can browse and navigate between open files in the Editor with tabs. Click the :guilabel:`Browse tabs` button on the left of the tab bar to display a list of open files, with the active tab checked.
es: Puedes explorar y navegar entre archivos abiertos en el Editor con pestañas. Haz clic en el botón :guilabel:`Navegar por las pestañas` a la izquierda de la barra de pestañas para mostrar una lista de archivos abiertos, con la pestaña activa seleccionada.

source: Reorder files by dragging and dropping, or with :guilabel:`Sort tabs alphabetically` in the options menu, which also allows closing all tabs to the right of, or all tabs but the active one.
es: Reordenar archivos arrastrando y soltando, o con :guilabel:`Ordenar las pestañas alfabéticamente` en el menú de opciones, que también permite cerrar todas las pestañas a la derecha de, o todas las pestañas excepto la activa.

source: File switcher
es: Cambiador de archivos

source: The Editor features a file switcher, which enables you to navigate and switch between multiple open files. The file switcher is helpful for locating any file when there are several files opened.
es: El Editor incluye un cambiador de archivos, que te permite navegar y cambiar entre varios archivos abiertos. El cambiador de archivos es útil para localizar cualquier archivo cuando hay varios archivos abiertos.

source: It can be accessed from the :menuselection:`File --> File Switcher` menu or :kbd:`Ctrl-P`, and includes a search function. You can type in any part of an open file's name and—if exists—it can be switched to by pressing :kbd:`Enter`.
es: Se puede acceder desde el menú :menuselection:`Archivo --> Cambiador de archivos` o :kbd:`Ctrl-P`, e incluye una función de búsqueda. Puedes escribir cualquier parte del nombre de un archivo abierto y, si existe, puede ser cambiado pulsando :kbd:`Enter`.

source: Split panels
es: Dividir paneles

source: The Editor can be split horizontally and vertically into as many distinct panels as desired. This allows viewing and editing the contents of several files (or different parts of the same file) at the same time.
es: El Editor puede dividirse horizontal y verticalmente en tantos paneles distintos como se desee. Esto permite visualizar y editar el contenido de varios archivos (o partes diferentes del mismo archivo) al mismo tiempo.

source: Split the Editor with the :guilabel:`Split vertically` (:kbd:`Ctrl-Shift-{`) and :guilabel:`Split horizontally` (:kbd:`Ctrl-Shift--`) commands in the options menu, and use :guilabel:`Close this panel` (:kbd:`Alt-Shift-W`) to close the selected split panel.
es: Divide el Editor con los comandos en el menú de opciones :guilabel:`Dividir verticalmente` (:kbd:`Ctrl-Shift-{`) y :guilabel:`Dividir horizontalmente` (:kbd:`Ctrl-Shift--`), y utiliza :guilabel:`Cerrar este panel` (:kbd:`Alt-Shift-W`) para cerrar el panel de división seleccionado.

source: :menuselection:`Close this panel` closes a split panel, while :menuselection:`Close` hides the entire Editor *pane* (including all splits, which are restored when the Editor is re-opened).
es: :menuselection:`Cerrar este panel` cierra un panel dividido, mientras que :menuselection:`Cerrar` oculta todo el *panel* del editor (incluyendo todas las divisiones, que se restauran cuando se vuelve a abrir el Editor).

source: Editing features
es: Editar características

source: Syntax highlighting
es: Coloreado de sintaxis

source: To improve the readability of your code, Spyder has a syntax highlighting feature that determines the color and style of text in the Editor, as well as in the :doc:`ipythonconsole`.
es: Para mejorar la legibilidad de tu código, Spyder tiene una función de resaltado de sintaxis que determina el color y el estilo del texto en el editor, así como en el :doc:`ipythonconsole`.

source: You can configure and preview syntax highlighting themes and fonts under :menuselection:`Preferences --> Appearance`. The :guilabel:`Syntax highlighting theme` section allows you to change the color and style of the syntax elements and background to match your preferences. You can switch between available themes in the drop-down menu, modify the selected theme, create a new theme, and more. The :guilabel:`Fonts` section lets you change the text font and size.
es: Puedes configurar y previsualizar los temas y fuentes de resaltado de sintaxis bajo :menuselection:`Preferencias --> Apariencia`. La sección :guilabel:`Tema de coloreado de sintaxis` te permite cambiar el color y el estilo de los elementos de sintaxis y el fondo para que coincida con tus preferencias. Puedes cambiar entre los temas disponibles en el menú desplegable, modificar el tema seleccionado, crear un nuevo tema y más. La sección :guilabel:`Tipo de letra` te permite cambiar el tamaño y la fuente de texto.

source: Changes made to the syntax highlighting theme and font settings are common to all source files, regardless of their language.
es: Los cambios realizados al tema de resaltado de sintaxis y a la configuración de fuentes son comunes a todos los archivos de fuente, independientemente de su idioma.

source: Code cells
es: Celdas de código

source: A "code cell" in Spyder is a block of lines, typically in a script, that can be easily executed all at once in the current :doc:`ipythonconsole`. This is similar to "cell" behavior in Jupyter Notebook and MATLAB. You can divide your scripts into as many cells as needed, or none at all—the choice is yours.
es: Una "celda de código" en Spyder es un bloque de líneas, normalmente un script, que puede ser fácilmente ejecutado todo a la vez en el :doc:`ipythonconsole`. Esto es similar al comportamiento de "celda" en Jupyter Notebook y MATLAB. Puedes dividir tus scripts en tantas celdas como necesites o ninguna en absoluto, la elección es tuya.

source: You can separate cells by lines starting with either:
es: Puedes separar las celdas por líneas comenzando por:

source: ``# %%`` (standard cell separator), or
es: ``# %%`` (separador estándar de celda), o

source: ``# <codecell>`` (IPython notebook cell separator)
es: ``# <codecell>`` (separador de celdas de notebook IPython)

source: Providing a description to the right of the separator will give that cell its own name in the :doc:`outline`. You can also create "subsections" by adding more ``%`` signs to the cell separator, e.g. ``# %%%`` to create a level 2 subsection, ``# %%%%`` for level 3, etc. This displays multiple levels in the :doc:`outline` pane.
es: Proporcionar una descripción a la derecha del separador dará a esa celda su propio nombre en el :doc:`outline`. También puedes crear "subsecciones" añadiendo más signos de ``%`` al separador de celda, por ejemplo ``# %%%`` para crear una subsección de nivel 2, ``# %%%%`` para el nivel 3, etc. Esto muestra varios niveles en el panel :doc:`outline`.

source: This only affects how the cell is displayed in the :doc:`outline`, and doesn't affect running it in the Editor.
es: Esto solo afecta a cómo se muestra la celda en el :doc:`outline`, y no afecta a ejecutarla en el Editor.

source: To run the code in a cell, use :menuselection:`Run --> Run cell`, the :guilabel:`Run cell` button in the toolbar or the keyboard shortcut (:kbd:`Ctrl-Enter`/:kbd:`Cmd-Return` by default). You can also run a cell and then jump to the next one, letting you quickly step through multiple cells, using :menuselection:`Run --> Run cell and advance` (:kbd:`Shift-Enter` by default).
es: Para ejecutar el código en una celda, usa :menuselection:`Ejecutar --> Ejecutar la celda`, el botón :guilabel:`Ejecutar la celda` actual en la barra de herramientas o el atajo de teclado (:kbd:`Ctrl-Enter`/:kbd:`Cmd-Return` por defecto). También puedes ejecutar una celda y luego saltar a la siguiente, permitiéndote pasar rápidamente por varias células, usando :menuselection:`Ejecutar --> Ejecutar la celda y avanzar` (:kbd:`Shift-Enter` por defecto).

source: Automatic formatting
es: Formato automático

source: The Editor has built-in support for automatically formatting your code using several popular tools, including `Autopep8 <https://github.com/hhatto/autopep8>`_ and `Black <https://black.readthedocs.io/en/stable/>`_. The :guilabel:`Format file or selection with {tool}` command in the :guilabel:`Source` or context menu will format either the selected fragment (if text is selected) or the entire active file.
es: El editor tiene soporte integrado para formatear automáticamente tu código usando varias herramientas populares, incluyendo `Autopep8 <https://github.com/hhatto/autopep8>`_ y `Black <https://black.readthedocs.io/en/stable/>`_. El comando :guilabel:`Formatear archivo o selección con {tool}`, en el :guilabel:`Source` o en el menú contextual, formatearán el fragmento seleccionado (si se selecciona el texto) o todo el archivo activo.

source: You can have the Editor automatically autoformat a file every time you save your work. To set this up, go to :menuselection:`Preferences --> Completion and linting --> Code style and formatting --> Code formatting` and check the :guilabel:`Autoformat files on save` option.
es: Puedes tener el Editor automáticamente para autoformatear un archivo cada vez que guardes tu trabajo. Para configurarlo, ve a :menuselection:`Preferencias --> Completado y análisis del código --> Estilo y formato de código --> Formato de código` y activa la opción :guilabel:`Autoformatear archivos al guardar`.

source: Running code
es: Ejecutar código

source: The Editor lets you run an entire file as well as specific lines, selections or cells.
es: El Editor te permite ejecutar un archivo completo, así como líneas específicas, selecciones o celdas.

source: As your code is running,
es: Mientras tu código se ejecuta,

source: The :doc:`ipythonconsole` will display output and errors.
es: La :doc:`ipythonconsole` mostrará salida y errores.

source: The :doc:`variableexplorer` allows you to browse and interact with the objects generated.
es: El :doc:`variableexplorer` te permite navegar e interactuar con los objetos generados.

source: The :doc:`plots` pane renders the figures and images created.
es: El panel :doc:`plots` muestra las figuras e imágenes creadas.

source: Run file
es: Ejecutar archivo

source: Run an entire Editor file using the :menuselection:`Run --> Run` menu item, the :guilabel:`Run file` toolbar button or the :kbd:`F5` key. Use :menuselection:`Run --> Re-Run last script` to re-run the most recent file executed with the above.
es: Ejecuta un archivo completo del Editor usando el elemento del menú :menuselection:`Ejecutar --> Ejecutar`, el botón de la barra de herramientas :guilabel:`Ejecutar archivo` o la tecla :kbd:`F5`. Usa :menuselection:`Ejecutar --> Ejecutar de nuevo el último archivo` para volver a ejecutar el archivo más reciente ejecutado con el anterior.

source: Run line/selection
es: Ejecutar línea/selección

source: You can execute the current line—or multiple selected lines—using the :guilabel:`Run selection or current line` option from the toolbar or the :menuselection:`Run` menu, as well as with the :kbd:`F9` key. After running the current line, the cursor automatically advances to the next one, so you can step through your code line by line. Unlike :guilabel:`Run file`, the executed lines are shown in the :doc:`ipythonconsole`.
es: Puedes ejecutar la línea actual o varias líneas seleccionadas usando la opción :guilabel:`Ejecutar selección o línea actual` desde la barra de herramientas o en el menú :menuselection:`Ejecutar`, así como con la tecla :kbd:`F9`. Después de ejecutar la línea actual, el cursor avanza automáticamente a la siguiente, así que puedes pasar a través de tu código línea por línea. A diferencia de :guilabel:`Ejecutar archivo`, las líneas ejecutadas se muestran en la :doc:`ipythonconsole`.

source: Run cell
es: Ejecutar celda
