Repository: spyder-ide/spyder-docs
Catalog: doc/locales/*/LC_MESSAGES/panes.po
Languages: es

source: The module's file location is linked to the right of the doc's title, which you can click to view its source code.
es: La ubicación del archivo del módulo está enlazada a la derecha del título del documento, al cual puedes hacer clic para ver su código fuente.

source: Standard library modules also have a link to the corresponding `Python docs`_, which can be viewed right inside of the pane.
es: Los módulos de biblioteca estándar también tienen un enlace a los correspondientes `Python docs`_, que pueden ser vistos justo dentro del panel.

source: If you're not sure of the name of the object you want help on, or are looking for a specific keyword, use the :guilabel:`Search` field to get a list of results.
es: Si no estás seguro del nombre del objeto en el que deseas obtener ayuda, o estás buscando una palabra clave específica, usa el campo :guilabel:`Search` para obtener una lista de resultados.

source: Links above the search field provide an index of topics with general help and a list of Python keywords linked to their corresponding docs.
es: Los enlaces que están por encima del campo de búsqueda proporcionan un índice de temas con ayuda general y una lista de palabras clave Python vinculadas a sus documentos correspondientes.

source: Toolbar items
es: Elementos de la barra de herramientas

source: Just like in a web browser, the forward and back buttons move through the pages you have visited, and the home button (house icon) returns you to the module index.
es: Al igual que en un navegador web, los botones de adelante y atrás se mueven a través de las páginas que has visitado, y el botón de inicio (icono de la casa) te devuelve al índice de módulos.

source: Perform a realtime search within a page's content with the :guilabel:`Find` button (magnifying glass icon top left) or :kbd:`Ctrl-F`, navigate through matches with the Up and Down buttons, and make matching case sensitive with the :guilabel:`Aa` button.
es: Realiza una búsqueda en tiempo real dentro del contenido de una página con el botón :guilabel:`Encontrar texto` (icono de lupa arriba a la derecha) o :kbd:`Ctrl-F`, y navega a través de coincidencias con los botones Arriba y Abajo; además puedes hacer que coincida mayúsculas y minúsculas con el botón :guilabel:`Aa`.

source: You can view and re-run previous searches from the drop-down menu in the :guilabel:`Package` field.
es: Puedes ver y volver a ejecutar búsquedas anteriores desde el menú desplegable en el campo :guilabel:`Paquete`.

source: You can also use the zoom in/out buttons (:guilabel:`-` and :guilabel:`+`, top right) to change the font size to suit your preferences.
es: También puedes usar los botones de acercar/alejar (:guilabel:`-` y :guilabel:`+`, arriba a la derecha) para cambiar el tamaño de la fuente según tus preferencias.

source: To cancel searching or page loading, click the stop button (red square), and to reload the page (such as when you change your own package's documentation), press the refresh button (circular arrow).
es: Para cancelar la búsqueda o la carga de la página, haz clic en el botón de detener (cuadrado rojo), y para recargar la página, como cuando cambias la documentación de tu propio paquete, pulsa el botón de actualizar (flecha circular).

source: Outline
es: Explorador de código

source: The **Outline** pane allows you to view and navigate the functions, classes, methods, cells and comments in open Python files. To show or hide the Outline pane, use :menuselection:`View --> Panes --> Outline` or :kbd:`Ctrl-Shift-O` / :kbd:`Cmd-Shift-O`. Click an entry in the outline to jump to its source file location, and use the :guilabel:`Go to cursor position` toolbar button to highlight the item corresponding to the current :doc:`editor` position.
es: El panel **Explorador de código** te permite ver y navegar las funciones, clases, métodos, celdas y comentarios en archivos Python abiertos. Para mostrar u ocultar el panel de Explorador de código, usa :menuselection:`Ver --> Paneles --> Explorador de código` o :kbd:`Ctrl-Shift-O` / :kbd:`Cmd-Shift-O`. Haz clic en una entrada del esquema para saltar a la ubicación de su archivo de origen y utiliza el botón de la barra de herramientas :guilabel:`Ir a la posición del cursor` para resaltar el elemento correspondiente a la posición actual del :doc:`editor`.

source: The options menu in the top-right of the pane allows customizing how the outline is displayed.
es: El menú de opciones en la parte superior derecha del panel te permite personalizar la forma en que se muestra el explorador de código.

source: These customization settings include:
es: Estas opciones de personalización incluyen:

source: :guilabel:`Show absolute path`: Display the full path to each file instead of just the name.
es: :guilabel:`Mostrar la ruta completa`: Muestra la ruta completa a cada archivo en lugar de solo el nombre.

source: :guilabel:`Show all files`: List every open file rather than just the current one. This allows using the Outline as a file switcher.
es: :guilabel:`Mostrar todos los archivos`: lista cada archivo abierto en lugar de solo el actual. Esto permite usar el explorador de código como un selector de archivos.

source: :guilabel:`Group code cells`: Group code cells in multiple nested levels in the outline rather than showing all cells in one level. You can create subsections by adding more ``%`` signs to the cell separator.
es: :guilabel:`Agrupar celdas`: agrupa celdas de código anidadas en múltiples niveles en el explorador de código en lugar de mostrar todas las celdas en un solo nivel. Puedes crear subsecciones añadiendo más signos de ``%`` al separador de celdas.

source: :guilabel:`Display variables and attributes`: Display top-level variable/constant definitions and class attributes in the outline.
es: :guilabel:`Mostrar variables y atributos`: muestra las definiciones de variable/constante de nivel superior y los atributos de clase en el explorador de código.

source: :guilabel:`Follow cursor position`: Automatically highlight and expand the entry corresponding to the current cursor position in the :doc:`editor`.
es: :guilabel:`Ir a la posición del cursor`: resalta y expande automáticamente la entrada correspondiente a la posición actual del cursor en el :doc:`editor`.

source: :guilabel:`Show special comments`: List special comments in the outline, which start with ``# ----``.
es: :guilabel:`Mostrar comentarios especiales`: lista los comentarios especiales en el explorador de código, los cuales comienzan con ``# ----``.

source: :guilabel:`Sort files alphabetically`: Sort the file list in alphabetical order. When disabled, all tabs will be sorted by the tab order of the currently selected Editor panel.
es: :guilabel:`Organizar archivos alfabéticamente`: ordena la lista de archivos en orden alfabético. Cuando se deshabilita, todas las pestañas se ordenarán según el orden de las pestañas del panel Editor seleccionado actualmente.

source: Icons
es: Iconos

source: The following icons are used for outline elements:
es: Los siguientes iconos se utilizan para elementos del explorador de código:

source: :guilabel:`m` for methods
es: :guilabel:`m` para métodos

source: :guilabel:`f` for functions
es: :guilabel:`f` para funciones

source: :guilabel:`c` for classes
es: :guilabel:`c` para clases

source: :guilabel:`%` for code cells
es: :guilabel:`%` para celdas de código

source: :guilabel:`#` for comments
es: :guilabel:`#` para comentarios

source: Plots
es: Gráficos

source: The **Plots** pane shows the static figures and images created during your session. It will show you plots from the :doc:`ipythonconsole`, produced by your code in the :doc:`editor` or generated by the :doc:`variableexplorer` allowing you to interact with them in several ways.
es: El panel **Gráficos** muestra las figuras e imágenes estáticas creadas durante tu sesión. Te mostrará gráficos de la :doc:`ipythonconsole` producidos por tu código en el :doc:`editor` o generados por el :doc:`variableexplorer` permitiéndote interactuar con ellos de varias maneras.

source: The figures shown in the Plots pane are those associated with the currently active :guilabel:`Console` tab; if you switch consoles, the list of plots displayed (or none at all, if a new console) will change accordingly.
es: Las figuras que se muestran en el panel de Gráficos son las asociadas con la pestaña activa :guilabel:`Terminal`. Si cambias de terminal, la lista de gráficos mostrados cambiará en consecuencia o no mostrará ninguno si abres una terminal nueva.

source: The options menu in the top right of the :guilabel:`Plots` pane offers several ways to customize how your plots are displayed.
es: El menú de opciones en la parte superior derecha del panel de :guilabel:`Gráficos` ofrece varias maneras de personalizar como se muestran tus gráficos.

source: Mute inline plotting
es: Silenciar los gráficos en línea

source: The :guilabel:`Mute inline plotting` option is enabled by default, preventing your plots from appearing in the Console. If you deactivate this option, figures will display in both the Plots pane and the Console.
es: La opción :guilabel:`Silenciar los gráficos en línea` está activada por defecto, evitando que tus gráficos aparezcan en la consola. Si desactivas esta opción, las figuras se mostrarán tanto en el panel Gráficos como en la Terminal.

source: Show plot outline
es: Mostrar el borde del gráfico

source: The :guilabel:`Show plot outline` option, off by default, shows a thin stroke surrounding the area of the figure area, which will also appear in the exported images.
es: La opción :guilabel:`Mostrar el borde del gráfico`, desactivada por defecto, muestra un trazo delgado alrededor del área de la figura, que también aparecerá en las imágenes exportadas.

source: Fit plots to window
es: Ajustar gráficos a la ventana

source: The :guilabel:`Fit plots to Window` option, also enabled by default, sizes the figures to match the pane. Disabling it will display plots at their native size, and allow you use the zoom buttons at the top of the pane to scale them manually.
es: La opción :guilabel:`Ajustar gráficos a la ventana`, también activada por defecto,ajusta el tamaño de las figuras para que coincidan con el panel. Al deshabilitarlo, se mostrarán los gráficos en su tamaño nativo y podrás usar los botones de zoom en la parte superior del panel para escalarlos manualmente.

source: Toolbar options
es: Opciones de la barra de herramientas

source: The toolbar at the top of the Plots pane provides several useful features that allow you to interact with your figures. For example, you can cycle sequentially through the plot list with the forward and back arrows.
es: La barra de herramientas en la parte superior del panel de Gráficos proporciona varias funciones útiles que te permiten interactuar con sus figuras. Por ejemplo, puede recorrer secuencialmente la lista de gráficos con las flechas hacia adelante y hacia atrás.

source: You can also save one or all the plots in the pane to file(s) by clicking the respective "save"/"save all" icons in the toolbar. Plots are rendered and saved as PNG by default, but SVG can be selected as an option under :menuselection:`Preferences --> IPython console --> Graphics --> Inline backend --> Format`.
es: También puedes guardar uno o todos los gráficos en el panel a archivo(s) haciendo clic en los iconos respectivos "guardar gráfico como..."/"guardar todos los gráficos..." en la barra de herramientas. Los gráficos son procesados y guardados como PNG por defecto, aunque también puedes seleccionar SVG como una opción bajo :menuselection:`Preferencias --> Terminal de IPython --> Gráficas --> Salida en línea --> Formato`.

source: Additionally, if you want to use a figure in another document, you can click the "copy to clipboard" button and paste your plot wherever you want, such as a word processor.
es: Además, si deseas utilizar una figura en otro documento, puedes hacer clic en el botón "Copiar gráfico al portapapeles como imagen" y pegar tu gráfico donde quieras, por ejemplo en un procesador de textos.

source: Finally, you can use the "remove" and "remove all" buttons in the toolbar to clear plots from the list.
es: Por último, puedes utilizar los botones "Borrar gráfico" y "Borrar todos los gráficos" de la barra de herramientas para borrar los gráficos de la lista.

source: Profiler
es: Perfilador (Profiler)

source: The **Profiler** pane recursively determines the run time and number of calls for every function and method called in a file, breaking down each procedure into its smallest individual units. This allows you to easily identify the bottlenecks in your code, points you toward the exact statements most critical for optimization, and measures the performance delta after followup changes.
es: El panel **Perfilador (Profiler)** determina recursivamente el tiempo de ejecución y el número de llamadas para cada función, y el método llamado en un archivo, dividiendo cada procedimiento en sus unidades individuales más pequeñas. Esto te permite identificar fácilmente los cuellos de botella en tu código, te indica las sentencias exactas más críticas para la optimización, y mide el delta del rendimiento después de los cambios de seguimiento.

source: Running the Profiler
es: Ejecutando el Perfilador (Profiler)

source: You can browse for a file using the open button to the right of the Profiler's path box (top left of the pane), which will run profiling over this file automatically.
es: Puedes buscar un archivo usando el botón "Seleccionar archivo de Python", ubicado a la derecha del cuadro de ruta del perfil (arriba a la izquierda del panel), que ejecutará automáticamente el perfilador sobre este archivo.

source: You can manually enter the path in the pane's path box and then run the analysis on the file by pressing :guilabel:`Profile` in the Profiler pane.
es: Puedes introducir manualmente la ruta en el cuadro de ruta del panel y luego ejecutar el análisis en el archivo pulsando :guilabel:`Ejecutar el perfilador` en el panel del Perfilador (Profiler).

source: You can also run profiling for the file that is currently open in the :doc:`editor` by clicking :menuselection:`&Run --> Profile` in the menu bar, or by using a configurable shortcut (:kbd:`F10` by default).
es: También puedes ejecutar perfiles para el archivo que está actualmente abierto en el :doc:`editor` haciendo clic en :menuselection:`&Ejecutar --> Ejecutar el perfilador` en la barra de menú, o usando un acceso directo configurable (:kbd:`F10` por defecto).

source: If you'd like to cancel an in-progress run, click the :guilabel:`Stop` button in the top right, and if profiling fails for any reason, the :guilabel:`Output` dialog will be displayed, indicating the error that occurred.
es: Si quieres cancelar una ejecución en curso, haz clic en el botón :guilabel:`Detener el perfilador` en la parte superior derecha, y si el perfil falla por cualquier razón, se mostrará el diálogo :guilabel:`Salida del perfilador` indicando el error que ha ocurrido.

source: By double-clicking an item in the Profiler, you will be taken to the file and line in the :doc:`editor` where it was called.
es: Al hacer doble clic en un elemento del Perfilador, serás llevado al archivo y a la línea en el :doc:`editor` donde fue llamado.

source: You can increase the number of levels displayed for a particular object by clicking the dropdown arrows to the left of the name, and expand/collapse all the items with the buttons in the top left.
es: Puedes aumentar el número de niveles mostrados para un objeto en particular haciendo clic en las flechas desplegables a la izquierda del nombre, y expandir/contraer todos los elementos con los botones de la parte superior izquierda.

source: By clicking the dropdown or press the :kbd:`Down Arrow` key in the filename field, you can recall paths of previous profiled files.
es: Haciendo clic en el menú desplegable o pulsando la tecla :kbd:`Flecha abajo` en el campo de nombre de archivo, puedes recuperar las rutas de acceso de los archivos perfilados anteriormente.

source: Finally, you can save the data for a given run to disk as a file with the ``.Result`` extension using the :guilabel:`Save data` button. This can be loaded to compare with a previous run of the same file using the :guilabel:`Load data` button. To remove the loaded data, click the :guilabel:`Clear comparison` button.
es: Finalmente, puedes guardar los datos para una ejecución dada en el disco como un archivo con el ``.Result`` usando el botón :guilabel:`Guardar información de perfilado`. Esto se puede cargar para comparar con una ejecución anterior del mismo archivo usando el botón :guilabel:`Cargar datos`. Para eliminar los datos cargados, haga clic en el botón :guilabel:`Limpiar comparación`.

source: Interpreting the results
es: Interpretar los resultados

source: Results are broken down by function/method/statement, with each sub-element listed hierarchically under the top-level item that called them. :guilabel:`Total Time` is that taken by the specified item and every function "underneath" (*i.e.* called by) it, while :guilabel:`Local Time` only counts the time spent in the particular callable object's own scope. The :guilabel:`Calls` column displays the total number of times the specified object was called at that level inside its parent calling function (or within the ``__main__`` scope, if a top-level object). Finally, the numbers in the :guilabel:`Diff` columns for each of the three appear if a comparison is loaded, and indicate the deltas between each measurement.
es: Los resultados son desglosados por función/método/sentencia, con cada subelemento listado jerárquicamente bajo el elemento de nivel superior que los llama. :guilabel:`Tiempo total` es el tiempo que tarda el objeto especificado y todas las funciones "debajo" del objeto(es decir, las llamadas por el objeto), mientras que :guilabel:`Tiempo Local` solo cuenta el tiempo empleado en el ámbito propio del objeto en particular. La columna :guilabel:`Llamados` muestra el número total de veces que el objeto especificado fue llamado en ese nivel dentro de su función de llamada primaria o dentro del ámbito ``__main__``, si se trata de un objeto de nivel superior. Finalmente, los números en la columna :guilabel:`Diff` para cada uno de los tres aparecen si se carga una comparación, e indican los deltas entre cada medición.

source: For example, suppose you ran the :guilabel:`Profiler` on a file calling a function ``sleep_wrapper()`` that in turn called the ``sleep()`` function, and the ``sleep_wrapper()`` function took a total of 3.87 ms to run, with 3.86 ms of that spent executing the ``sleep()`` function inside it. Therefore, if ``sleep()`` called nothing else itself, its :guilabel:`Total Time` and :guilabel:`Local Time` would both be identical, at 3.87 ms. Meanwhile, :guilabel:`Total Time` for ``sleep_wrapper()`` would be 3.86 ms, but :guilabel:`Local Time` only 0.01 ms as the rest was spent inside the ``sleep()`` function it called.
es: Por ejemplo, supongamos que ejecutaste el :guilabel:`Perfilador (Profiler)` en un archivo que llama a una función ``sleep_wrapper()``, que a su vez llama a la función ``sleep()``; y la función ``sleep_wrapper()`` tardó un total de 3.87 ms en ejecutarse, de los cuales 3,86 ms se dedicaron a ejecutar la función ``sleep()`` dentro de ella. Por lo tanto, si ``sleep()`` no llama a ninguna otra función, su :guilabel:`Tiempo total` y su :guilabel:`Tiempo local` serían idénticos a 3.87 ms. Mientras tanto, el :guilabel:`Tiempo total` para ``sleep_wrapper()`` sería de 3.86 ms, pero el :guilabel:`Tiempo local` sería solo de 0.01 ms , ya que el resto se gastó en la función ``sleep()`` a la que llamó.

source: Profiler plugins
es: Plugins del perfilador

source: There are two additional plugins that you can install to enable other types of profiling in Spyder. First, Spyder Line Profiler allows you to benchmark each line of your code individually. To learn more, visit the `spyder-line-profiler git repository`_.
es: Hay dos plugins adicionales que puedes instalar para habilitar otros tipos de perfiles en Spyder. En primer lugar, Spyder Line Profiler te permite analizar cada línea de tu código individualmente. Para obtener más información, visita el `spyder-line-profiler git repository`_.

source: Second, Spyder Memory Profiler measures the memory usage of your code. For more information, go to the `spyder-memory-profiler git repository`_.
es: Segundo, el Spyder Memory Profiler mide el uso de memoria de tu código. Para más información, ve a `spyder-memory-profiler git repository`_.

source: Projects
es: Proyectos

source: Spyder allows you to associate a given directory with a **Project**, which automatically saves and restores the files you have open in the :doc:`editor` from the last time you opened that project. With the :ref:`Project <project-explorer>` pane, you can browse all your project's files, regardless of your current working directory or :doc:`fileexplorer` location.
es: Spyder te permite asociar un directorio determinado con un **Proyecto**, el cual automáticamente guarda y restaura los archivos que has abierto en el :doc:`editor` desde la última vez que abriste ese proyecto. En el panel :ref:`Proyecto <project-explorer>` puedes navegar todos los archivos de tu proyecto, independientemente de tu directorio de trabajo actual o de la ubicación de :doc:`fileexplorer`.

source: In addition, your project's root folder is used to set your working directory, and automatically added to the ``PYTHONPATH``, so you can easily ``import`` and work with any modules and packages you create inside of it.
es: Además, la carpeta raíz del proyecto se utiliza para establecer tu directorio de trabajo, y se añade automáticamente al ``PYTHONPATH``, para que puedas ``importar`` fácilmente y trabajar con cualquier módulo y paquetes que crees dentro de él.

source: Projects are completely optional and not imposed on users. All of Spyder' functionality (code completion, session saving, File Explorer, working directory, etc) is available without creating a :guilabel:`Project`.
es: Los proyectos son completamente opcionales y no se imponen a los usuarios. Todas las funcionalidades de Spyder (finalización de código, guardado de sesión, Explorador de archivos, directorio de trabajo, etc) están disponibles sin crear un :guilabel:`Proyecto`.

source: Creating a Project
es: Crear un proyecto

source: To create a :guilabel:`Project`, click the :guilabel:`New Project` entry in the :guilabel:`Projects` menu, choose whether you'd like to associate a :guilabel:`Project` with an existing directory or make a new one, and enter the :guilabel:`Project`'s name and path.
es: Para crear un :guilabel:`Proyecto`, haz clic en la entrada :guilabel:`Nuevo Proyecto` en el menú :guilabel:`Proyectos`. Elige si quieres asociar un :guilabel:`Proyecto` con un directorio existente o crear uno nuevo, e introduce el nombre y la ruta del :guilabel:`Proyecto`.

source: Using the Projects Pane
es: Usar el panel de Proyectos

source: Once a :guilabel:`Project` is opened, the :guilabel:`Project` pane is shown, presenting a tree view of the current :guilabel:`Project`'s files and directories. It allows you to perform all the same :ref:`operations<file-operations>` as Spyder's :doc:`fileexplorer` pane.
es: Una vez que se abre un :guilabel:`Proyecto`, se muestra el panel :guilabel:`Project`, presentando una vista de árbol de los archivos y directorios del :guilabel:`Proyecto` actual. Esto te permite realizar las mismas :ref:`operaciones <file-operations>` que el panel :doc:`fileexplorer` de Spyder.

source: Working with version control
es: Trabajar con control de versiones
