Repository: spyder-ide/spyder-docs
Catalog: doc/locales/*/LC_MESSAGES/panes.po
Languages: es

source: To run a cell, place your cursor inside it and use the :menuselection:`Run --> Run cell` menu item, the :guilabel:`Run current cell` toolbar button or the :kbd:`Ctrl-Enter` / :kbd:`Cmd-Return` keyboard shortcut. Use :guilabel:`Run cell and advance` in the :guilabel:`Run` menu/toolbar or :kbd:`Shift-Enter` to jump to the next cell after running, useful for stepping through cells quickly.
es: Para ejecutar una celda, coloca tu cursor dentro de ella y usa el elemento de menú :menuselection:`Ejecutar --> Ejecutar la celda`, el botón de la barra de herramientas :guilabel:`Ejecutar la celda actual` o el atajo de teclado :kbd:`Ctrl-Enter` / :kbd:`Cmd-Return`. Usa :guilabel:`Ejecutar la celda y avanzar a la siguiente` en el menú/barra de herramientas :guilabel:`Ejecutar` o :kbd:`Shift-Enter` para saltar a la siguiente celda después de ejecutar, esto es útil para atravesar rápidamente las celdas.

source: Run configuration
es: Configuración de ejecución

source: You can use the :guilabel:`Run configuration per file` dialog to set each file's working directory, console mode (current, dedicated or external), command line arguments, execution options (clear all variables, run in an existing/empty namespace, debug on error), and more.
es: Puedes utilizar el cuadro de diálogo :guilabel:`Configuración de ejecución por archivo` para establecer el directorio de trabajo de cada archivo, el modo de consola (actual, dedicada o terminal de comandos del sistema), argumentos de línea de comandos, opciones de ejecución (borrar todas las variables, ejecutar en un espacio de nombres existente/vacío, depurar en un error) y más.

source: To access it, click :menuselection:`Run --> Configuration per file...` or press :kbd:`Ctrl-F6` / :kbd:`Cmd-F6`.
es: Para acceder a él, haz clic en :menuselection:`Ejecutar --> Configuración por archivo...` o pulsa :kbd:`Ctrl-F6` / :kbd:`Cmd-F6`.

source: Code navigation
es: Navegación por código

source: Find and replace
es: Buscar y reemplazar

source: To search for text in the current file, use :menuselection:`Search --> Find text` or :kbd:`Ctrl-F` / :kbd:`Cmd-F`, and to replace it, use :menuselection:`Search --> Replace text` or :kbd:`Ctrl-R` / :kbd:`Cmd-R`. Typing your search string in the resulting panel below the Editor highlights each result and counts the total. Navigate between matches with the :guilabel:`Find Previous` and :guilabel:`Find Next` buttons in the find/replace panel, their corresponding entries in the :guilabel:`Search` menu, or use the :kbd:`F2` and :kbd:`F3` keys. Use the :guilabel:`.*` button to process search text as a `regular expression <https://docs.python.org/3/library/re.html>`_, :guilabel:`Aa` to treat it as case-sensitive and :guilabel:`[–]` to only match whole words (e.g. for ``data``, match ``data()`` but not ``dataframe``).
es: Para buscar texto en el archivo actual, usa :menuselection:`Buscar --> Buscar texto` o :kbd:`Ctrl-F` / :kbd:`Cmd-F`, y para reemplazarlo, usa :menuselection:`Buscar --> Reemplazar texto` o :kbd:`Ctrl-R` / :kbd:`Cmd-R`. Escribiendo la cadena de búsqueda en el panel resultante debajo del Editor resalta cada resultado y cuenta el total. Navega entre los resultados con los botones :guilabel:`Buscar anterior` y :guilabel:`Buscar siguiente` en el panel de buscar/reemplazar, sus correspondientes entradas en el menú :guilabel:`Buscar`, o utiliza las teclas :kbd:`F2` y :kbd:`F3`. Usa :guilabel:`. *` para procesar texto de búsqueda como una `expresión regular <https://docs.python.org/3/library/re.html>`_, :guilabel:`Aa` para tratarlo como sensible a mayúsculas y :guilabel:`[–]` para que solo coincida con palabras enteras (por ejemplo, para ``data``, coincide con ``data()`` pero no con ``dataframe``).

source: Go to line
es: Ir a la línea

source: The :guilabel:`Go to line` dialog allows jumping to a specific line in the active file. Open it with :menuselection:`Search --> Go to line` or :kbd:`Ctrl-L` / :kbd:`Cmd-L`, type the line number you want to scroll to and press :kbd:`Enter` (or click :guilabel:`OK`).
es: El diálogo :guilabel:`Ir a la línea` permite saltar a una línea específica en el archivo activo. Abrelo con :menuselection:`Buscar --> Ir a la línea` o :kbd:`Ctrl-L` / :kbd:`Cmd-L`, escribe el número de línea al que quieres desplazarte y pulsa :kbd:`Enter` (o haz clic en :guilabel:`OK`).

source: It also shows the current line number and total line count in the file.
es: También muestra el número de línea actual y el recuento total de líneas en el archivo.

source: Class/function selector
es: Selector de clase/función

source: This panel, activated under :menuselection:`Source --> Show selector for classes and functions`, displays (as applicable) the name of the cell, function/method and class the Editor cursor is located inside. Use its dropdowns to view and jump to the functions, methods and classes in the current file.
es: Este panel, activado bajo :menuselection:`Código fuente--> Mostrar selector para clases y funciones`, muestra (como aplicable) el nombre de la celda, la función/método y la clase en la que el cursor del Editor se encuentra dentro. Utiliza el menú desplegable para ver y saltar a las funciones, métodos y clases del archivo actual.

source: Code analysis and completions
es: Completado y análisis del código

source: Spyder uses the `Language Server Protocol <https://microsoft.github.io/language-server-protocol/>`_ (LSP) to provide code completion and linting for the Editor, similar to VSCode, Neovim, and other popular editors/IDEs.
es: Spyder utiliza el `Protocolo de Servidor de Idioma <https://microsoft.github.io/language-server-protocol/>`_ (LSP) para proporcionar el completado de código y linting para el Editor, similar a VSCode, Neovim, y otros editores/IDE populares.

source: Many issues with completion and linting are outside of Spyder's control, and are either limitations with the LSP or the code that is being introspected, but some can be worked around. See :ref:`code-completion-problems-ref` for troubleshooting steps.
es: Muchos problemas con el completado y el linting están fuera del control de Spyder y son o bien limitaciones con el LSP o el código que se está introduciendo, pero algunas pueden ser trabajadas. Vea :ref:`code-completion-problems-ref` para los pasos de solución de problemas.

source: Python is supported out of the box, and advanced users can add completion and linting support for other languages by setting up LSP servers for them under :menuselection:`Preferences --> Completion and Linting --> Other languages`.
es: Python está soportado por defecto, y los usuarios avanzados pueden añadir soporte de completado y linting para otros idiomas configurando los servidores LSP en :menuselection:`Preferencias --> Completado y análisis de código --> Otros idiomas`.

source: Code completion
es: Completado de código

source: Automatic code completion as you type is enabled by default in the Editor, and can also be triggered manually with :kbd:`Ctrl-Space`/:kbd:`Cmd-Space`, showing you possible completions (with pop-up help for each) and available code snippets. For example, typing ``cla`` will display the keyword ``class``, the decorator ``classmethod`` and two built-in snippets with class templates. Select the desired completion with the arrow keys and :kbd:`Enter`, or by double clicking.
es: El completado automático de código está activado de forma predeterminada en el Editor mientras escribes, pero también puede ser activado manualmente con :kbd:`Ctrl-Space`/:kbd:`Cmd-Space`, el cual muestra las posibles formas de completar (con una ayuda emergente para cada una) y los fragmentos de código disponibles. Por ejemplo, escribir ``cla`` mostrará la palabra clave ``class``, el decorador ``classmethod`` y dos fragmentos incorporados con plantillas de clases. Selecciona la terminación deseada con las teclas de flecha y :kbd:`Enter`, o haciendo doble clic.

source: You can enable or disable on-the-fly code completion, as well as modify when it is triggered and what results are shown, under :menuselection:`Preferences --> Completion and Linting --> General --> Completions`. Spyder also allows you to define custom completion snippets to use, in addition to the ones offered by the LSP, under :menuselection:`Preferences --> Completion and Linting --> Advanced`.
es: Puedes activar o desactivar el completado de código sobre la marcha, así como modificar cuando se activa y qué resultados se muestran, bajo :menuselection:`Preferencias --> Completado y análisis del código --> General --> Completado`. Spyder también te permite definir fragmentos de completado personalizados a utilizar, además de los ofrecidos por el LSP, bajo :menuselection:`Preferencias --> Completado y análisis del código --> Opciones avanzadas`.

source: Linting and code style
es: Linting y estilo de código

source: Spyder can optionally highlight syntax errors, style issues, and other potential problems with your code in the Editor, which can help you spot bugs quickly and make your code easier to read and understand.
es: Spyder puede resaltar opcionalmente errores de sintaxis, problemas de estilo y otros problemas potenciales con tu código en el Editor, lo que puede ayudarte a detectar errores rápidamente y hacer que tu código sea más fácil de leer y entender.

source: The Editor's basic linting, powered by `Pyflakes <https://github.com/PyCQA/pyflakes>`_, warns of syntax errors and likely bugs in your code. It is on by default, and can be disabled or customized under :menuselection:`Preferences --> Completion and Linting --> Linting`.
es: El linting básico del Editor, desarrollado por `Pyflakes <https://github.com/PyCQA/pyflakes>`_, advierte los errores de sintaxis y posibles errores en tu código. Está activado por defecto, y puede ser deshabilitado o personalizado bajo :menuselection:`Preferencias --> Completado y análisis de código --> Análisis de código`.

source: Code style analysis, powered by `Pycodestyle <https://pycodestyle.pycqa.org/en/stable/>`_, flags deviations from the style conventions in :pep:`8`. It is not active by default, but you can enable it and customize the `Pycodestyle error codes <https://pycodestyle.pycqa.org/en/stable/intro.html#error-codes>`_ shown with the options under :menuselection:`Preferences --> Completion and Linting --> Code style and formatting --> Code Style`.
es: El análisis de estilo de código, desarrollado por `Pycodestyle <https://pycodestyle.pycqa.org/en/stable/>`_, señala las desviaciones de las convenciones de estilo en :pep:`8`. No está activo por defecto, pero puedes activarlo y personalizar los `códigos de error Pycodestyle <https://pycodestyle.pycqa.org/en/stable/intro.html#error-codes>`_ mostrados con las opciones :menuselection:`Preferencias --> Completado y análisis de código --> Estilo y formato de código --> Estilo del código`.

source: Introspection features
es: Características de introspección

source: If there's a function, class or variable for which you would like to check its definition, you need to :kbd:`Ctrl`/:kbd:`Cmd`-click its name in the Editor (or click its name and press :kbd:`Ctrl-G` / :kbd:`Cmd-G` to jump to the file and line where it is declared.
es: Si hay una función, clase o variable para la que desea comprobar su definición, necesitas hacer :kbd:`Ctrl`/:kbd:`Cmd`-clic en su nombre en el Editor (o haz clic en su nombre y pulsa :kbd:`Ctrl-G` / :kbd:`Cmd-G` para saltar al archivo y línea donde se declara.

source: You can hover over the name of an object for pop-up help, as :ref:`described in the Help pane docs <help-hover-hints>`.
es: Puedes pasar por encima del nombre de un objeto para ayuda emergente, como se describió :ref:`en la documentación del panel de ayuda <help-hover-hints>`.

source: Finally, if you type the name of a function, method or class constructor and then an open parenthesis, a calltip will pop up which shows the function's parameters as you type them, as well as a summary of its documentation. These features can be enabled and customized under :menuselection:`Preferences --> Completion and Linting --> Introspection`.
es: Finalmente, si escribes el nombre de una función, método o constructor de clase y luego un paréntesis abierto, aparecerá un calltip que mostrará los parámetros de la función a medida que los escribas, así como un resumen de su documentación. Estas características pueden ser habilitadas y personalizadas bajo :menuselection:`Preferencias --> Completado y análisis de código --> Introspección`.

source: Keyboard shortcuts
es: Atajos de teclado

source: To view the Editor's primary keyboard shortcuts, consult its section under :menuselection:`Help --> Shortcuts Summary`. The full list can be browsed, searched and customized (on double-click) in :menuselection:`Preferences --> Keyboard shortcuts`.
es: Para ver los atajos de teclado primarios del Editor, consulta la sección bajo :menuselection:`Ayuda --> Resumen de atajos`. La lista completa se puede buscar, buscar y personalizar (en doble clic) en :menuselection:`Preferencias --> Atajos de teclado`.

source: Files
es: Archivos

source: The **Files** pane is a filesystem and directory browser built right into Spyder. You can view and filter files according to their type and extension, open them with the :doc:`editor` or an external tool, and perform many common operations.
es: El panel **Archivos** es un navegador de archivos y directorios construido directamente en Spyder. Puedes ver y filtrar archivos de acuerdo a su tipo y extensión, abrirlos con el :doc:`editor` o con una herramienta externa, y realizar muchas operaciones comunes.

source: File operations
es: Operaciones de archivo

source: To browse the files on your system, use the arrows at the top of the pane. You can expand/collapse the folders in the pane to display the files and subdirectories hierarchically. Double-clicking a folder will open it, showing the files inside and making it your working directory.
es: Para navegar por los archivos de tu sistema, usa las flechas en la parte superior del panel. Puedes expandir/contraer las carpetas en el panel para mostrar los archivos y subdirectorios jerárquicamente. Al hacer doble clic en una carpeta se abrirá, mostrando los archivos dentro y haciéndolos tu directorio de trabajo.

source: To open a file in the :guilabel:`Editor` from the :guilabel:`Files` pane, double-click its name. If you right-click over it, you will see a context menu that allows you to access a number of functions, including running scripts; creating, renaming, moving, deleting files; and opening them in your computer's file manager.
es: Para abrir un archivo en el :guilabel:`Editor` desde el panel :guilabel:`Archivos`, haz doble clic en su nombre. Si haces clic con el botón derecho sobre él, verás un menú contextual que te permite acceder a una serie de funciones, incluyendo ejecutar scripts; crear, renombrar, mover, eliminar archivos; y abrirlos en el gestor de archivos de su computadora.

source: You can copy and paste one or several files to and from the pane, and copy their absolute or relative paths to the clipboard as text. If copying the paths for multiple files, they will be automatically formatted so you can paste them directly into a Python list.
es: Puedes copiar y pegar uno o varios archivos desde y hacia el panel, y copiar sus rutas absolutas o relativas al portapapeles como texto. Si se copian las rutas para múltiples archivos, se formatearán automáticamente para que se puedan pegar directamente en una lista de Python.

source: Version control support
es: Soporte de control de versiones

source: The :guilabel:`Files` pane allows you to perform basic operations with the `Git`_ distributed version control system, like committing your changes and browsing the repository a given file or folder is part of. This is :ref:`particularly useful<vcs-section>` when you're working in Spyder :doc:`projects`.
es: El panel :guilabel:`Archivos` te permite realizar operaciones básicas con el sistema de control de versiones distribuidas `Git`_ como hacer "commit" a los cambios y navegar por el repositorio del que forma parte un archivo o carpeta determinado. Esto es :ref:`particularmente útil<vcs-section>` cuando estás trabajando en Spyder :doc:`projects`.

source: Options menu
es: Menú de opciones

source: The options menu in the top right of the :guilabel:`Files` pane offers several ways to customize how your files are displayed.
es: El menú de opciones en la parte superior derecha del panel :guilabel:`Archivos` ofrece varias maneras de personalizar cómo se muestran tus archivos.

source: By default, the pane displays the contents of your working directory without filtering. However, it can filter the list to show only files matching the patterns set under :guilabel:`Show filenames with these extensions...`, if you toggle the :guilabel:`Filter filenames` button in the pane toolbar.
es: Por defecto, el panel muestra el contenido de su directorio de trabajo sin filtrar. Sin embargo, puedes filtrar la lista para mostrar sólo archivos que coincidan con los patrones establecidos bajo :guilabel:`Mostrar nombres de archivo con estas extensiones...`, si activa el botón :guilabel:`Filtrar nombre de archivo` en la barra de herramientas del panel.

source: You can also activate the :guilabel:`Show hidden files` option, which will display files that are invisible by default in your operating system.
es: También puedes activar la opción :guilabel:`Mostrar archivos ocultos`, que mostrará archivos que son invisibles por defecto en su sistema operativo.

source: Additionally, you can change which file attributes you want to see by hiding or displaying the :guilabel:`Type`, :guilabel:`Size` and :guilabel:`Date Modified` columns using the corresponding menu options.
es: Además, puedes cambiar qué atributos de archivo deseas ver ocultando o mostrando las columnas :guilabel:`Tipo`, :guilabel:`Tamaño` y :guilabel:`Fecha de modificación` usando las opciones de menú correspondientes.

source: The menu also gives you the option to open files and directories with a single instead of a double click, to suit your preferences.
es: El menú también te da la opción de abrir archivos y directorios con un solo clic en lugar de un doble clic, para que se adapte a tus preferencias.

source: File associations
es: Asociaciones de archivos

source: :guilabel:`Files` allows you to associate different external applications with specific file extensions they can open. Under the :guilabel:`File associations` tab of the :guilabel:`Files` preferences pane, you can add file types and set the external program used to open each of them by default.
es: :guilabel:`Archivos` te permite asociar diferentes aplicaciones externas con extensiones específicas de archivo que pueden abrir. Bajo la pestaña :guilabel:`Asociaciones de archivos` del panel de preferencias :guilabel:`Archivos`, puedes añadir tipos de archivo y establecer el programa externo usado para abrir cada uno de ellos por defecto.

source: Once you've set this up, files will automatically launch in the associated application when opened from Spyder's :guilabel:`Files` pane. Additionally, when you right-click a file, you will find an :guilabel:`Open with...` option that will allow you to select from the applications associated with this extension.
es: Una vez que lo hayas configurado, los archivos se ejecutarán automáticamente en la aplicación asociada cuando se abran desde el panel :guilabel:`Archivos` de Spyder. Además, cuando haces clic derecho en un archivo, encontrarás un :guilabel:`Abrir con...` que te permitirá seleccionar entre las aplicaciones asociadas a esta extensión.

source: Find
es: Buscar

source: The **Find** pane allows you to search the content of text files in a user-defined location, with advanced features to filter your results.
es: El panel **Buscar** te permite buscar el contenido de los archivos de texto en una ubicación definida por el usuario, con características avanzadas para filtrar tus resultados.

source: Using the Find pane
es: Usar el panel Buscar

source: To search for text in the Find pane, enter it in the field in the top left and press the search button. This will allow you to view and navigate through all the occurrences of your search text in your working directory. You can expand or collapse the search results to view the matches in each file. Clicking on a match will automatically open the file and highlight the line where the text was found.
es: Para buscar texto en el panel Buscar, ingrésalo en el campo de la parte superior izquierda y pulsa el botón de búsqueda. Esto te permitirá ver y navegar a través de todas las ocurrencias de tu texto de búsqueda en el directorio de trabajo. Puedes expandir o contraer los resultados de la búsqueda para ver los resultados en cada archivo. Al hacer clic en una coincidencia se abrirá automáticamente el archivo y se resaltará la línea donde se encontró el texto.

source: If you want to change the scope of your search, select another directory, project or file in the :guilabel:`Search in` menu. The locations that you select for your search will be stored in the list so you can access them easily in the future. To erase all of these saved directories, select the :guilabel:`Clear the list` option from the dropdown menu in the :guilabel:`Search in` field.
es: Si quieres cambiar el alcance de tu búsqueda, selecciona otro directorio, proyecto o archivo en el menú :guilabel:`Buscar` . Las ubicaciones que selecciones para tu búsqueda se almacenarán en la lista para poder acceder fácilmente a ellas en el futuro. Para borrar todos estos directorios guardados selecciona la opción :guilabel:`Limpiar la lista` en el menú desplegable en el campo :guilabel:`Buscar en`.

source: Choosing search options
es: Elegir opciones de búsqueda

source: You can select from a number of options to enable searches as broad or refined as you need.
es: Puedes seleccionar entre una serie de opciones para permitir búsquedas tan amplias o refinadas como necesites.

source: To enable case sensitivity, which only returns matches with identical capitalization to your search text, toggle the :guilabel:`Aa` button on.
es: Para habilitar la sensibilidad a mayúsculas, que solo devuelve coincidencias con una mayúscula idéntica al texto de búsqueda, activa el botón :guilabel:`Aa`.

source: To parse your search string as a `regular expression`_, enable the :guilabel:`.*` button.
es: Para analizar tu cadena de búsqueda como una `expresión regular`_, activa el botón :guilabel:`.*`.

source: To exclude certain filenames, extensions or directories from your search, click the :guilabel:`Plus` button to display the advanced options for the pane, and then enter them in the :guilabel:`Exclude` text box.
es: Para excluir ciertos nombres de archivos, extensiones o directorios de su búsqueda, haz clic en el botón :guilabel:`Plus` para mostrar las opciones avanzadas para el panel, y luego introdúcelas en el cuadro de texto :guilabel:`Exclude`.

source: Finally, to change the number of matches displayed, select the :guilabel:`Set maximum number of results` option under the pane's Options menu in the top right.
es: Finalmente, para cambiar el número de coincidencias mostradas, selecciona la opción :guilabel:`Establecer número máximo de resultados` en el menú Opciones del panel en la parte superior derecha.

source: Help
es: Ayuda
