Repository: spyder-ide/spyder-docs
Catalog: doc/locales/*/LC_MESSAGES/panes.po
Languages: es

source: You can use the **Help** pane to find, render and display rich documentation for any object with a docstring, including modules, classes, functions and methods. This allows you to access documentation easily directly from Spyder, without having to interrupt your workflow.
es: Puedes usar el panel de **Ayuda** para encontrar, renderizar y mostrar la documentación enriquecida para cualquier objeto con una cadena de documentación, incluyendo módulos, clases, funciones y métodos. Esto te permite acceder fácilmente a la documentación directamente desde Spyder, sin tener que interrumpir tu flujo de trabajo.

source: You can also access Spyder's tutorial from here, which will guide you through some basic steps for using its key features.
es: También puedes acceder al tutorial de Spyder desde aquí, que te guiará a través de algunos pasos básicos para usar sus características clave.

source: Getting help
es: Obtener ayuda

source: Help can be retrieved both by static analysis of open files in the :doc:`editor`, or by dynamically inspecting an object in an :doc:`ipythonconsole`. You can trigger help manually by pressing the configurable help shortcut (:kbd:`Ctrl-I` by default).
es: La ayuda se puede recuperar tanto mediante el análisis estático de los archivos abiertos en el :doc:`editor`, o inspeccionando dinámicamente un objeto en una :doc:`ipythonconsole`. Puedes activar la ayuda manualmente pulsando el atajo de ayuda configurable (:kbd:`Ctrl-I` por defecto).

source: You can also manually enter the object's name into the :guilabel:`Object` textbox at the top of the pane, if :guilabel:`Console` is selected as the :guilabel:`Source`.
es: También puedes introducir manualmente el nombre del objeto en el cuadro de texto :guilabel:`Objeto` en la parte superior del panel, si :guilabel:`Terminal` es seleccionado como el :guilabel:`Origen`.

source: Automatic help can be individually enabled for both the :guilabel:`Editor` and the :guilabel:`Console` under :menuselection:`Preferences --> Help --> Automatic Connections`, and turned on and off dynamically via the lock icon in the top right corner of the :guilabel:`Help` pane. If enabled, simply typing a left parenthesis (``(``) after a function or method name will show its associated help.
es: La ayuda automática puede ser habilitada individualmente tanto para el :guilabel:`Editor` como para la :guilabel:`Terminal` bajo :menuselection:`Preferencias --> Ayuda --> Conexiones automáticas`, y se activa y desactiva dinámicamente mediante el icono de bloqueo en la esquina superior derecha del panel :guilabel:`Ayuda`. Si está habilitado, simplemente tecleando un paréntesis izquierdo (``(``) después de una función o nombre del método te mostrará su ayuda asociada.

source: Understanding help modes
es: Entender los modos de ayuda

source: You can use the options menu (:guilabel:`Hamburger` icon) in the top right of the :guilabel:`Help` pane to toggle the help display mode.
es: Puedes usar el menú de opciones ( icono :guilabel:`Hamburguesa`) en la parte superior derecha del panel :guilabel:`Ayuda` para cambiar el modo de visualización de ayuda.

source: :guilabel:`Rich Text` mode renders the object's docstrings with ``Sphinx``, :guilabel:`Plain Text` mode displays the docstring without formatting while :guilabel:`Show Source` displays the docstring inline with the code for the selected object, or any Python portion of it (if the object is not pure Python). The latter can be useful when docstrings are not available or insufficient to document the object.
es: El modo :guilabel:`Texto enriquecido` renderiza las cadenas de documentación del objeto con ``Sphinx``, El modo :guilabel:`Texto plano` muestra la docstring sin formatear, mientras que :guilabel:`Mostrar código fuente` muestra la docstring en línea con el código para el objeto seleccionado, o cualquier porción de Python (si el objeto no es Python puro). Esto último puede ser útil cuando los docstrings no están disponibles o son insuficientes para documentar el objeto.

source: Getting help by hovering
es: Obtener ayuda al pasar el cursor

source: You can also get summary help for objects by hovering over them in the :guilabel:`Editor`. Clicking the hover popup will open the full documentation in the :guilabel:`Help` pane.
es: También puedes obtener ayuda resumida para objetos pasando el cursor sobre ellos en el :guilabel:`Editor`. Al hacer clic en la ventana emergente se abrirá la documentación completa en el panel de :guilabel:`Ayuda`.

source: Control automatic import
es: Controlar importación automática

source: When you get help in the :guilabel:`IPython Console` for an object that has not been previously imported, it is automatically loaded in Spyder's own internal interpreter so that documentation can be shown when available. This can be disabled in the :guilabel:`Help` pane's top-right options menu so that only documentation from imported objects is displayed.
es: Cuando obtienes ayuda en la :guilabel:`IPython Console` para un objeto que no ha sido importado previamente, se carga automáticamente en el intérprete interno de Spyder para que la documentación pueda mostrarse cuando esté disponible. Esto puede deshabilitarse en el menú de opciones de :guilabel:`Ayuda` en la parte superior derecha del panel para que sólo se muestre la documentación de objetos importados.

source: History
es: Historial

source: With the **History** pane, you can view the recent code and commands you've entered into any :doc:`ipythonconsole`, along with their timestamp.
es: Con el panel **Historial** puedes ver el código y comandos recientes que has introducido en cualquier :doc:`ipythonconsole`, junto con su marca de tiempo.

source: Using the History pane
es: Usar el panel Historial

source: Navigating the :guilabel:`History` pane is very straightforward. Each Spyder session is marked by a date and timestamp, making it easy to remember when you executed a certain command. Statements can be selected and copied from the context menu or with the normal system shortcuts. Just like in the Editor, selecting a word or phrase displays all other occurrences, and full syntax highlighting is also supported. The last ≈1000 lines entered are stored in the pane.
es: Navegar por el panel :guilabel:`Historial` es muy sencillo. Cada sesión de Spyder está marcada por una fecha y una marca de tiempo, haciendo que sea fácil recordar cuando ejecutaste un determinado comando. Las sentencias pueden ser seleccionadas y copiadas desde el menú contextual o con los atajos normales del sistema. Al igual que en el Editor, seleccionar una palabra o frase muestra todas las demás incidencias, y también se admite el resaltado completo de sintaxis. En el panel se almacenan las últimas ≈1000 líneas.

source: Options Menu
es: Menú de opciones

source: The top-right options menu (:guilabel:`Hamburger` icon) allows you to toggle wrapping of long lines (:guilabel:`Wrap lines`), and whether the line number is displayed to the left of the text (:guilabel:`Show line numbers`).
es: El menú de opciones de arriba a la derecha (icono :guilabel:`Hamburguesa`) te permite cambiar el ajuste de líneas largas (:guilabel:`Ajuste de línea automático`), y también si el número de línea se muestra a la izquierda del texto (:guilabel:`Mostrar números de línea`).

source: Advanced usage
es: Uso avanzado

source: The list of commands shown in the :guilabel:`History` pane are stored in :file:`history.py` in the :file:`.spyder-py3` directory in your user home folder (by default, :file:`C:/Users/{username}` on Windows, :file:`/Users/{username}` for macOS, and typically :file:`/home/{username}` on GNU/Linux). You might need to show invisible files in order to see it on a non-Windows operating system.
es: La lista de comandos mostrados en el panel :guilabel:`Historial` se almacenan en :file:`history.py` en el directorio :file:`.spyder-py3` en tu carpeta de inicio del usuario (por defecto, :file:`C:/Users/{username}` en Windows, :file:`/Users/{username}` para macOS, y normalmente :file:`/home/{username}` en GNU/Linux). Puede que necesites mostrar archivos invisibles para poder verlos en un sistema operativo no Windows.

source: While there is currently no built-in way to clear history from the Spyder interface aside from resetting preferences, you can do so by closing Spyder, deleting this file and restarting Spyder again.
es: Aunque actualmente no hay ninguna forma integrada de borrar el historial de la interfaz Spyder aparte de restablecer las preferencias, puedes hacerlo cerrando Spyder, eliminando este archivo y reiniciando Spyder de nuevo.

source: IPython Console
es: Terminal de IPython

source: The **IPython Console** allows you to execute commands and interact with data inside `IPython`_ interpreters.
es: La **Terminal IPython** te permite ejecutar comandos e interactuar con datos dentro de los intérpretes `IPython`_.

source: To launch a new IPython instance, go to :guilabel:`New console (default settings)` under the :guilabel:`Consoles` menu, or use the keyboard shortcut :kbd:`Ctrl-T` (:kbd:`Cmd-T` on macOS) when the console is focused.
es: Para lanzar una nueva instancia de IPython, vaya a :guilabel:`Nueva terminal (configuración por defecto)` en el menú :guilabel:`Terminales`, o usa el atajo de teclado :kbd:`Ctrl-T` (:kbd:`Cmd-T` en macOS) cuando la consola está focalizada.

source: From the same menu, you can stop currently executing code with :guilabel:`Interrupt kernel`, clear a console's namespace with :guilabel:`Remove all variables`, or relaunch a fresh one with :guilabel:`Restart kernel`. As each console is executed in a separate process, this won't affect any others you've opened, and you will be able to easily test your code in a clean environment without disrupting your primary session.
es: Desde el mismo menú, puedes dejar de ejecutar código con el :guilabel:`Interrumpir el núcleo`, limpia el namespace de una consola con :guilabel:`Eliminar todas las variables`, o relanza una nueva con :guilabel:`Reiniciar el núcleo`. Como cada consola se ejecuta en un proceso separado, esto no afectará a ningún otro que hayas abierto, y podrás probar fácilmente tu código en un entorno limpio sin interrumpir tu sesión principal.

source: Supported features
es: Funciones disponibles

source: Any :guilabel:`IPython Console`, whether :ref:`external<connecting-external-kernel>` or started by Spyder, supports:
es: Cualquier :guilabel:`Terminal de IPython`, ya sea :ref:`externa<connecting-external-kernel>` o iniciada por Spyder, soporta:

source: Automatic code completion
es: Completado automático de código

source: Real-time function calltips
es: Información sobre la función en tiempo real

source: Full GUI integration with the enhanced Spyder :doc:`Debugger<debugging>`.
es: Integración GUI completa con el :doc:`depurador<debugging>` mejorado de Spyder.

source: The :doc:`variableexplorer`, with GUI-based editors for many built-in and third-party Python objects.
es: El :doc:`variableexplorer`, con editores gráficos para muchos objetos de Python incorporados y de terceros.

source: Display of Matplotlib graphics in Spyder's :doc:`plots` pane, if the :guilabel:`Inline` backend is selected under :menuselection:`Preferences --> IPython console --> Graphics --> Graphics backend`, and inline in the console if :guilabel:`Mute inline plotting` is unchecked under the :guilabel:`Plots` pane's options menu.
es: Visualización de gráficos de Matplotlib en el panel de :doc:`plots` de Spyder, si se selecciona el backend :guilabel:`En línea` en :menuselection:`Preferencias ‣ Terminal de IPython ‣ Gráficas ‣ Salida gráfica`, y en línea en la consola si la opción :guilabel:`Silenciar los gráficos en línea` no está marcada en el menú de opciones del panel de :guilabel:`Gráficos`.

source: For information on the features, commands and capabilities built into IPython itself, see the `IPython documentation`_.
es: Para obtener información sobre las características, comandos y capacidades incorporadas en IPython mismo, vea la `IPython documentation`_.

source: Special consoles
es: Consolas especiales

source: Spyder also supports several types of specialized consoles. A `Sympy console`_ enables creating and displaying symbolic math expressions right inside Spyder. A `Cython console`_ allows you to use the Cython language to speed up your code and call C functions directly from Python. Finally, a `Pylab console`_ loads common Numpy and Matplotlib functions by default; while this is deprecated and strongly discouraged for new code, it can still be used if necessary for legacy scripts that need it.
es: Spyder también soporta varios tipos de consolas especializadas. Una `Sympy console`_ permite crear y mostrar expresiones matemáticas simbólicas dentro de Spyder. Una `Cython console`_ te permite usar el lenguaje de Cython para acelerar tu código y llamar a funciones C directamente desde Python. Finalmente, una `Pylab console`_ carga las funciones comunes Numpy y Matplotlib por defecto; mientras que esto está obsoleto y fuertemente desaconsejado para el nuevo código, todavía puede ser usado si es necesario para scripts heredados que lo necesiten.

source: The options menu allows you to inspect your current environment variables (:guilabel:`Show environment variables`), and the contents of your system's ``PATH`` (:guilabel:`Show sys.path contents`). In addition, you can have each console display how long it has been running with :guilabel:`Show elapsed time`.
es: El menú de opciones te permite inspeccionar tus variables de entorno actuales (:guilabel:`Mostrar las variables de entorno`), y los contenidos de su sistema ``PATH`` (:guilabel:`Contenidos del sys.path`). Además, puedes tener que cada consola muestre cuánto tiempo ha estado funcionando con :guilabel:`Mostrar el tiempo transcurrido`.

source: You can also change the name of the current :guilabel:`IPython console` tab with the :guilabel:`Rename tab` option, or by simply double-clicking it.
es: También puedes cambiar el nombre de la pestaña :guilabel:`IPython console` con la opción :guilabel:`Renombrar la pestaña`, o simplemente haciendo doble clic en ella.

source: Using external kernels
es: Usar núcleos externos

source: You can connect to external local and remote kernels (including those managed by Jupyter Notebook or QtConsole) through the :guilabel:`Connect to an existing kernel` dialog under the :guilabel:`Consoles` menu. For this feature to work, a compatible version of the ``spyder-kernels`` package :ref:`must be installed <starting-kernel-problems-ref>` in the environment or machine in which the external kernel is running.
es: Puedes conectarte a los núcleos externos locales y remotos (incluidos los administrados por Jupyter Notebook o QtConsole) a través del diálogo :guilabel:`Conectarse a un núcleo existente` bajo el menú de :guilabel:`Terminales`. Para que esta característica funcione, una versión compatible del paquete ``spyder-kernels`` :ref:`debe ser instalado <starting-kernel-problems-ref>` en el entorno o máquina en la que el núcleo externo está corriendo.

source: Connect to a local kernel
es: Conectar a un núcleo local

source: To connect to a local kernel that is already running (e.g. one started by Jupyter notebook),
es: Para conectarse a un núcleo local que ya se está ejecutando (por ejemplo, uno iniciado por Jupyter notebook):

source: Run ``%connect_info`` in the notebook or console you want to connect to, and copy the name of its kernel connection file, shown after ``jupyter <app> --existing``.
es: Ejecuta ``%connect_info`` en el notebook o la consola a la que quieres conectarte, y copia el nombre de su archivo de conexión al núcleo, que se muestra después de ``jupyter <app> --existing``.

source: In Spyder, click :guilabel:`Connect to an existing kernel` from the :guilabel:`Consoles` menu, and paste the name of the :guilabel:`Connection file` from the previous step.
es: En Spyder, haz clic en :guilabel:`Conectarse a un núcleo existente` desde el menú :guilabel:`Terminales`, y pega el nombre del :guilabel:`Archivo de conexión` del paso anterior.

source: As a convenience, kernel ID numbers (e.g. ``1234``) entered in the connection file path field will be expanded to the full path of the file, i.e. :file:`{jupyter/runtime/dir/path}/kernal-{id}.json`.
es: Por conveniencia, los números de ID del núcleo (por ejemplo ``1234``) ingresados en el campo de ruta del archivo de conexión se ampliarán a la ruta completa del archivo, por ejemplo :file:`{jupyter/runtime/dir/path}/kernal-{id}.json`.

source: Click :guilabel:`OK` to connect to the kernel.
es: Haz clic en :guilabel:`OK` para conectarte al núcleo.

source: Connect to a remote kernel
es: Conectar a un núcleo remoto

source: To connect to a kernel on a remote machine,
es: Para conectarse a un núcleo en una máquina remota:

source: Launch a Spyder kernel on the remote host if one is not already running, with ``python -m spyder_kernels.console``.
es: Inicia un núcleo Spyder en el host remoto, si aún no se está ejecutando, con ``python -m spyder_kernels.console``.

source: Copy the kernel's connection file (:file:`{jupyter/runtime/dir/path}/kernel-{pid}.json`) to the machine you're running Spyder on.
es: Copia el archivo de conexión del núcleo (:file:`{jupyter/runtime/dir/path}/kernel-{pid}.json`) a la máquina en la que estás ejecutando Spyder.

source: You can get :file:`{jupyter/runtime/dir/path}` by executing ``jupyter --runtime-dir`` in the same Python environment as the kernel. Usually, the connection file you are looking for will be one of the newest in this directory, corresponding to the time you started the external kernel.
es: Puedes obtener :file:`{jupyter/runtime/dir/path}` ejecutando ``jupyter --runtime-dir`` en el mismo entorno de Python que el kernel. Generalmente, el archivo de conexión que estás buscando será uno de los más recientes en este directorio, correspondiente a la hora en que inició el núcleo externo.

source: Click :guilabel:`Connect to an existing kernel` from the :guilabel:`Consoles` menu, and browse for or enter the path to the connection file from the previous step.
es: Haz clic en :guilabel:`Conectarse a un núcleo existente` desde el menú :guilabel:`Terminales`, y busca o ingresa la ruta al archivo de conexión desde el paso anterior.

source: As a convenience, kernel ID numbers (e.g. ``1234``) entered in the connection file path field will be expanded to :file:`{jupyter/runtime/dir/path}/kernal-{id}.json` on your local machine, if you've copied the connection file there.
es: Por conveniencia, los números de ID del núcleo (por ejemplo, ``1234``) introducidos en el campo de ruta del archivo de conexión se expandirán a :file:`{jupyter/runtime/dir/path}/kernal-{id}.json` en tu máquina local, si has copiado el archivo de conexión allí.

source: Check the :guilabel:`This is a remote kernel (via SSH)` box and enter the :guilabel:`Hostname` or IP address, username and port to connect to on the remote machine. Then, enter *either* :file:`{username}`'s password on the remote machine, or browse to an SSH keyfile (typically in the :file:`.ssh` directory in your home folder on the local machine, often called :file:`id_rsa` or similar) registered on it; only one is needed to connect. If you check :guilabel:`Save connection settings`, these details will be remembered and filled for you automatically next time you open the dialog.
es: Marca la casilla :guilabel:`Este es un núcleo remoto (via SSH)` e ingresa el :guilabel:`Servidor` o dirección IP, nombre de usuario y puerto al cual conectarse en la máquina remota. Luego, ingresa la contraseña de :file:`{nombre de usuario}` en la máquina remota, **o** selecciona un archivo de clave SSH registrado en la máquina remota, normalmente ubicado en el directorio :file:`.ssh` en tu carpeta de inicio en la máquina local y llamado a menudo :file:`id_rsa`. Si marcas :guilabel:`Guardar ajustes de conexión`, estos detalles serán recordados y rellenados automáticamente la próxima vez que abras el diálogo.

source: Note that :guilabel:`Port` is the port number on your remote machine that the SSH daemon (``sshd``) is listening on, typically 22 unless you or your administrator has configured it otherwise.
es: Ten en cuenta que :guilabel:`Puerto` es el número de puerto en tu máquina remota en el que el daemon SSH (``sshd``) está escuchando, típicamente 22 a menos que tú o tu administrador lo hayan configurado de otra manera.

source: Click :guilabel:`OK` to connect to the remote kernel
es: Haz clic en :guilabel:`OK` para conectarte al núcleo

source: For more technical details about connecting to remote kernels, see the `Connecting to a remote kernel`_ page in the IPython Cookbook.
es: Para obtener más detalles técnicos sobre la conexión a los núcleos remotos, consulta la página `Connecting to a remote kernel`_ en el libro de Cookbook IPython.

source: Reload changed modules
es: Recargar módulos modificados

source: When working in an interactive session, Python only loads a module from its source file once, the first time it is imported.
es: Al trabajar en una sesión interactiva, Python sólo carga un módulo desde su archivo fuente una vez, cuando se importa por primera vez.

source: Spyder's :guilabel:`User Module Reloader` (UMR) automatically reloads modules right in your existing IPython consoles whenever they are modified and re-imported. With the UMR enabled, you can test changes to your code without restarting the kernel.
es: El :guilabel:`Recargador de Módulos de usuario` (RMU) de Spyder recarga automáticamente módulos en las consolas de IPython existentes siempre que sean modificadas y reimportadas. Con la RMU activada, puedes probar los cambios en tu código sin reiniciar el núcleo.

source: UMR is enabled by default, and it will provide you with a red ``Reloaded modules:`` message in the console listing the files it has refreshed when it is activated. If desired, you can turn it on or off, and prevent specific modules from being reloaded, under :menuselection:`Preferences --> Python interpreter --> User Module Reloader (UMR)`.
es: RMU está activado por defecto, y te proporcionará un mensaje en rojo ``Módulos recargados:`` en la consola listando los archivos que se han actualizado cuando está activado. Si lo deseas, puedes activarlo o desactivarlo y evitar que se recargen módulos específicos, bajo :menuselection:`Preferencias --> intérprete de Python --> Recargador de Módulos de Usuario (RMU)`.

source: Online Help
es: Ayuda en línea

source: The **Online Help** pane provides a built-in web browser to explore dynamically generated Python documentation on installed modules—including your own—rendered by a `pydoc`_ server running in the background.
es: El panel de **Ayuda en línea** proporciona un navegador web integrado para explorar la documentación de Python generada dinámicamente en los módulos instalados, incluyendo el tuyo, renderizado por un servidor `pydoc`_ corriendo en segundo plano.

source: Using the Online Help
es: Usar la Ayuda en línea

source: The Online Help's home shows an index where you can browse the documentation of standard library modules, third party packages installed in your Python environment, and your own local code. Click on the name of any module to open its documentation.
es: En la página de inicio de la ayuda en línea se muestra un índice donde puedes navegar por la documentación de módulos de biblioteca estándar, paquetes de terceros instalados en tu entorno Python y tu propio código local. Haz clic en el nombre de cualquier módulo para abrir su documentación.

source: Enter the name of the item you'd like help on in the :guilabel:`Package` field to load its documentation directly.
es: Introduce el nombre del elemento en el que deseas ayuda en el campo :guilabel:`Paquete` para cargar su documentación directamente.
