Repository: spyder-ide/spyder-docs
Catalog: doc/locales/*/LC_MESSAGES/panes.po
Languages: es

source: The :guilabel:`Project` pane has basic integration with the `Git`_ distributed version control system, just like :ref:`in the Files pane<files-vcs-support>`. You can commit or browse a file, directory or the entire repository via the commands in the context menu.
es: El panel :guilabel:`Proyectos` tiene integración básica con el sistema de control de versiones distribuidas `Git`_ al igual que :ref:`en el panel de Archivos<files-vcs-support>`. Puedes hacer un commit o navegar por un archivo, directorio o el repositorio completo mediante los comandos en el menú contextual.

source: To use this functionality, the :guilabel:`Project` must be located in a ``git`` repository and the ``git`` and ``gitk`` commands must be on the system path.
es: Para utilizar esta funcionalidad, el :guilabel:`Proyecto` debe estar ubicado en un repositorio ``git`` y los comandos ``git`` y ``gitk`` deben estar en la ruta del sistema.

source: Code Analysis
es: Análisis del código

source: The **Code Analysis** pane detects style issues, bad practices, potential bugs, and other quality problems in your code, all without having to actually execute it. Based on these results, it also gives your code an overall quality score. Spyder's code analyzer is powered by the best-in-class `Pylint`_ back-end, which can intelligently detect an enormous and customizable range of potential errors, bad practices, quality issues, style violations, and more.
es: El panel **Análisis del código** detecta problemas de estilo, malas prácticas, posibles errores y otros problemas de calidad en tu código, todo sin tener que ejecutarlo realmente. Basado en estos resultados, también le da a tu código una puntuación de calidad general. El analizador del código de Spyder funciona con el mejor back-end de `Pylint`_ de su clase, que pueden detectar de forma inteligente una gama enorme y personalizable de posibles errores, malas prácticas, problemas de calidad, violaciones de estilo y mucho más.

source: Using the code analyzer
es: Usar el analizador del código

source: You can select the desired file to analyze directly in the :doc:`editor` by clicking anywhere within it. To run the analysis, press the configurable shortcut (:kbd:`F8` by default), select :menuselection:`Source --> Run code analysis` from the menu bar or click the :guilabel:`Analyze` button in the Code Analysis pane. If the Code Analysis pane is not visible, you can open it under :menuselection:`View --> Panes --> Code Analysis`. All standard checks are run by default. To go directly to a line in the :doc:`editor` highlighted by a failed check, just click its name.
es: Puedes seleccionar el archivo deseado para analizarlo directamente en el :doc:`editor` haciendo clic en cualquier lugar dentro de él. Para ejecutar el análisis, presiona el acceso directo configurable (:kbd:`F8` por defecto), selecciona :menuselection:`Código fuente --> Ejecutar análisis del código` desde la barra de menú o haz clic en el botón :guilabel:`Ejecutar análisis del código` en el panel de Análisis de código. Si el panel de análisis de código no está visible, puedes abrirlo en :menuselection:`Ver --> Paneles --> Análisis del código`. Todas las comprobaciones estándar se ejecutan de forma predeterminada. Para ir directamente a una línea en el :doc:`editor` que ha sido resaltada por una comprobación fallida, simplemente haz clic en su nombre.

source: You can also manually enter the path of a file you'd like it to check in the path entry box in the pane's toolbar. The analyzer works with both individual scripts and whole Python packages (directories containing an :file:`__init__.py` file).
es: También puedes introducir manualmente la ruta de un archivo que te gustaría comprobar en la casilla de entrada de la ruta de la barra de herramientas del panel. El analizador funciona tanto con scripts individuales como con paquetes completos de Python (directorios que contienen un archivo :file:`__init__.py`).

source: Cancel analyzing a file with the :guilabel:`Stop` button, and if analysis fails, click the :guilabel:`Output` button to find out why. If Pylint does succeed, the :guilabel:`Output` will show the raw plain text analysis results on the selected file, allowing you to easily browse and copy/paste the full message names and descriptions.
es: Cancela el análisis de un archivo con el botón :guilabel:`Detener`, y si se produce un error en el análisis, haz clic en el botón :guilabel:`Salida` para averiguar por qué. Si Pylint tiene éxito, la :guilabel:`Salida` mostrará los resultados de análisis de texto sin formato en el archivo seleccionado, permitiéndote navegar y copiar/pegar fácilmente los nombres de los mensajes completos y las descripciones.

source: Finally, you can click the dropdown or press the dropdown arrow in the filename field to view results of previous analyses.
es: Finalmente, puedes hacer clic en el menú desplegable o pulsar la flecha desplegable en el campo nombre del archivo para ver los resultados de análisis anteriores.

source: The number of recent runs Spyder should remember can be customized in the :guilabel:`History` dialog, available from the Code Analysis options menu.
es: El número de ejecuciones recientes que Spyder debe recordar puede personalizarse en el cuadro de diálogo :guilabel:`Historial`, disponible en el menú de opciones de Análisis del código.

source: You can also expand or collapse one or all the sections in the pane by using the corresponding options in the options menu.
es: También puedes expandir o contraer una o todas las secciones del panel usando las opciones correspondientes en el menú de opciones.

source: Advanced options
es: Opciones avanzadas

source: You can turn certain messages off at the line, block or file/module level by adding a ``# pylint: disable=MESSAGE-NAMES`` comment at the respective `scope`_, where ``MESSAGE_NAMES`` should be replaced with a comma-separated list (or single value) of `Pylint message names`_. For example, a directive might look like ``# pylint: disable=invalid-name``, or ``# pylint: disable=fixme, line-too-long``.
es: Puedes desactivar ciertos mensajes en el nivel de línea, bloque o archivo/módulo añadiendo un comentario ``# pylint: disable=MESSAGE-NAMES`` en el `scope`_ respectivo, donde ``MESSAGE_NAMES`` debe reemplazarse por una lista separada por comas (o valor único) de `Pylint message names`_. Por ejemplo, una directiva podría verse como ``# pylint: disable=invalid-name``, o ``# pylint: disable=fixme, line-too-long``.

source: Or, you can globally suppress specific messages and adjust other Pylint settings by editing the :file:`.pylintrc` configuration file in your user folder. If it doesn't exist, you can generate it by running ``pylint --generate-rcfile > .pylintrc`` in your user directory, from Anaconda Prompt (on Windows) or your terminal (macOS/Linux). For more details on configuring Pylint, see the `Pylint documentation`_.
es: O bien, puedes eliminar globalmente mensajes específicos y ajustar otras configuraciones de Pylint editando el archivo de configuración :file:`.pylintrc` en tu carpeta de usuario. Si no existe, puedes generarlo ejecutando ``pylint --generate-rcfile > . ylintrc`` en tu directorio de usuario, desde Anaconda Prompt (en Windows) o tu terminal (macOS/Linux). Para más detalles sobre la configuración de Pylint, consulta la `Pylint documentation`_.

source: Variable Explorer
es: Explorador de variables

source: The **Variable Explorer** allows you to interactively browse and manage the objects generated running your code.
es: El **Explorador de variables** te permite navegar y administrar de forma interactiva los objetos generados al ejecutar tu código.

source: It shows the namespace contents (including all global objects, variables, class instances and more) of the currently selected :doc:`ipythonconsole` session, and allows you to add, remove, and edit their values through a variety of GUI-based editors.
es: Muestra el contenido del espacio de nombres (incluyendo todos los objetos globales, variables, instancias de clase y más) de la sesión :doc:`ipythonconsole` seleccionada, y te permite agregar, eliminar y editar sus valores a través de una variedad de editores basados en GUI.

source: The Variable Explorer gives you information on the name, size, type and value of each object. To modify a scalar variable, like an number, string or boolean, simply double click it in the pane and type its new value.
es: El Explorador de variables te proporciona información sobre el nombre, tamaño, tipo y valor de cada objeto. Para modificar una variable escalar, como un número, cadena o booleano, simplemente haz doble clic en el panel y escribe su nuevo valor.

source: Object viewers
es: Visor de objetos

source: Spyder's :guilabel:`Variable Explorer` offers built in support for editing lists, strings, dictionaries, NumPy arrays, Pandas DataFrames, Series and more; as well as being able to plot and visualize them with one click.
es: El :guilabel:`Explorador de variables` de Spyder ofrece soporte integrado para editar listas, cadenas, diccionarios, matrices NumPy, Pandas DataFrames, Series y más; además de poder crear gráficos y visualizarlos con un solo clic.

source: Strings
es: Cadenas de texto

source: When a string variable is longer than forty characters, you can double click it to see its value in a text editor to more easily modify it.
es: Cuando una variable de cadena es más larga que cuarenta caracteres, puedes hacer doble clic en ella para ver su valor en un editor de texto para modificarla más fácilmente.

source: Dictionaries
es: Diccionarios

source: Double-clicking on dictionaries will show a viewer displaying each of its keys with its associated value. You can double click any of the values to modify them, which will open a new viewer if the value is itself an object.
es: Al hacer doble clic en los diccionarios se desplegará un visor que muestra cada una de sus llaves con su valor asociado. Puedes hacer doble clic en cualquiera de los valores para modificarlos, lo que abrirá un nuevo visor si el valor en sí mismo es un objeto.

source: Lists
es: Listas

source: For lists, the main Variable Explorer displays a preview of the first ten values. To see them all, double click the list to open a viewer that will display the index, type, size and value of each element of the list. Just like dictionaries, you can double-click values to edit them.
es: En el caso de las listas, el Explorador de variables principal muestra una vista previa de los diez primeros valores. Para verlos todos, haz doble clic en la lista para abrir un visor que te mostrará el índice, tipo, tamaño y valor de cada elemento de la lista. Al igual que los diccionarios, puedes hacer doble clic en los valores para editarlos.

source: Numpy arrays
es: Arreglos de NumPy

source: Like lists, for Numpy arrays the Variable Explorer shows a preview of their values. Double-clicking them will open a viewer displaying the array values in a "heat map", with each value in a grid cell colored based on its numeric quantity. You can deactivate the background color by unchecking the appropriate option in the viewer, which will happen automatically if the array is too large to improve performance.
es: Al igual que las listas, para las arreglos de Numpy el Explorador de variables muestra una vista previa de sus valores. Al hacer doble clic en ellos, se abrirá un visor que muestra los valores de la matriz en un "mapa de calor", con cada valor en una celda de cuadrícula coloreada en base a su cantidad numérica. Puedes desactivar el color de fondo desmarcando la opción apropiada en el visor, lo que sucederá automáticamente si la matriz es demasiado grande para mejorar el rendimiento.

source: If supported by the datatype, you can also change the format of the array's values, choosing the number of decimals that you want the array to display. For this, click the :guilabel:`Format` button and and set the desired formatting in the dialog that appears, using standard `Printf-style syntax`_.
es: Si es compatible con el tipo de datos, también puedes cambiar el formato de los valores del arreglo, eligiendo el número de decimales que desea que el arreglo muestre. Para esto, haz clic en el botón :guilabel:`Formato` y establece el formato deseado en el diálogo que aparece, usando la sintaxis estándar `Printf-style syntax`_.

source: Additionally, you can adjust the size of the rows and columns of the array by expanding or contracting their headers. Clicking the :guilabel:`Resize` button will set it automatically.
es: Además, puedes ajustar el tamaño de las filas y columnas del arreglo expandiendo o contrayendo sus encabezados. Al hacer clic en el botón :guilabel:`Cambiar tamaño` se establecerá automáticamente.

source: DataFrames, like Numpy arrays, display in a viewer where you can show or hide "heatmap" colors, change the format and resize the rows and columns either manually or automatically.
es: Los DataFrames, al igual que los arreglos de Numpy, se muestran en un visor donde puedes mostrar u ocultar los colores del "mapa de calor", cambiar el formato y cambiar el tamaño de las filas y columnas, ya sea de forma manual o automática.

source: Additionally, starting in Spyder 4, the Variable Explorer has MultiIndex support in its DataFrame inspector, including for multi-level and multi-dimensional indices.
es: Adicionalmente, a partir de Spyder 4, el Explorador de variables tiene soporte MultiIndex en su inspector de DataFrame, incluyendo índices multi-nivel y multidimensionales.

source: The options menu in the top right of the Variable Explorer pane allows you filter the objects shown by a number of different criteria.
es: El menú de opciones en la parte superior derecha del panel de Explorador de variables te permite filtrar los objetos mostrados por una serie de criterios diferentes.

source: It also allows you to display the min and max of Numpy arrays instead of a preview of their values.
es: También te permite mostrar el mínimo y máximo de los arreglos de NumPy en lugar de una vista previa de sus valores.

source: Toolbar buttons
es: Botones de la barra de herramientas

source: The Variable Explorer's toolbar includes several useful features that affect the entire namespace. For example, you can save the current session's data as a ``.spydata`` file, which can be loaded later to recover all the variables stored.
es: La barra de herramientas del Explorador de variables incluye varias características útiles que afectan a todo el espacio de nombres. Por ejemplo, puedes guardar los datos de la sesión actual como un archivo ``.spydata``, que se puede cargar más tarde para recuperar todas las variables almacenadas.

source: You should **not** load any ``.spydata`` file from any source you don't fully trust (ideally, only those files you've saved yourself). Like with any `Python pickle`_, it is inherently not secure against malicious code, as it can load any Python object and can execute arbitrary code on your machine. Additionally, it is not guaranteed to work reliably across all Python environments other than the one it was created in, so it should be only used as a local persistence format, not for interchange.
es: **No** debes cargar ningún archivo ``.spydata`` desde cualquier fuente en la que no confíes (idealmente, solo aquellos archivos que hayas guardado tu mismp). Al igual que con cualquier `Python pickle`_, no es inherentemente seguro contra código malicioso, ya que puede cargar cualquier objeto Python y puede ejecutar código arbitrario en tu máquina. Además, no se garantiza que funcione de forma fiable en todos los entornos de Python que no sean en aquel en el que se creó, por lo que sólo debería utilizarse como formato de persistencia local, y no para intercambio.

source: There is also a button to remove all displayed variables, and a search box to find objects by name or type.
es: También hay un botón para eliminar todas las variables mostradas, y un cuadro de búsqueda para encontrar objetos por nombre o tipo.

source: Finally, there is a button to refresh the Variable Explorer's contents, which will update it to show the current state of the code running in the IPython console.
es: Por último, hay un botón para actualizar el contenido del Explorador de variables, que lo actualizará para mostrar el estado actual del código que se ejecuta en la consola IPython.

source: Advanced functionality
es: Funcionalidad avanzada

source: The context menu, available by right-clicking any variable, provides numerous additional options to interact with objects of various types. These include renaming, removing or editing existing variables, as well as the :guilabel:`duplicate` option to create a new copy of one of them under a new name you enter in the resulting dialog box.
es: El menú contextual, disponible haciendo clic derecho en cualquier variable, proporciona numerosas opciones adicionales para interactuar con objetos de varios tipos. Estas incluyen renombrar, eliminar o editar variables existentes, así como la opción :guilabel:`Duplicar` para crear una nueva copia de una de ellas bajo un nuevo nombre que puedes ingresar en el cuadro de diálogo resultante.

source: Furthermore, you can copy and paste the value of a variable, saving it in the Variable Explorer with any name that you choose. This allows you to change the type of the variable that you are pasting which can be very useful, allowing you to, for example, easily copy the elements of a list into an array.
es: Además, puedes copiar y pegar el valor de una variable, guardándola en el Explorador de variables con el nombre que elijas. Esto te permite cambiar el tipo de variable que estás pegando, lo que puede ser muy útil. Por ejemplo, te permite copiar fácilmente los elementos de una lista en una matriz.

source: Additionally, you can create an object from scratch directly in the Variable Explorer with the :guilabel:`Insert` option, which allows you to type the key (which should be in quotation marks) and the value for the item that you want to insert. In addition to adding a new top-level variable, this feature also allows you to create a new key in a dictionary, a new element in a list, and much more.
es: Adicionalmente, puedes crear un objeto desde cero directamente en el Explorador de variables con la opción :guilabel:`Insertar`, que te permite escribir la clave (que debería estar entre comillas) y el valor del elemento que deseas insertar. Además de añadir una nueva variable de nivel superior, esta característica también te permite crear una nueva llave en un diccionario, un nuevo elemento en una lista, y mucho más.

source: For lists and Numpy arrays, more advanced options are available, including generating plots and histograms of their values appropriate to their type and dimensions.
es: Para listas y arreglos de NumPy, hay opciones avanzadas disponibles, incluyendo la generación de gráficos e histogramas de sus valores apropiados a su tipo y dimensiones.

source: You can even save an array to a ``.npy`` file by simply clicking the appropriate option, which can later be loaded by Spyder or in your code via ``numpy.load()``.
es: Incluso puedes guardar un arreglo en un archivo ``.npy`` simplemente haciendo clic en la opción apropiada, que luego puede ser cargada por Spyder o en tu código a través de ``numpy.load()``.

source: For two-dimensional arrays, you can also display them as images, treating their values as RGB colors. For this, Spyder uses Matplotlib's colormaps, which can be `easily changed to match your preferences`_.
es: En el caso de arreglos bidimensionales, también puedes mostrarlos como imágenes, tratando sus valores como colores RGB. Para esto, Spyder utiliza los mapas de colores de Matplotlib, que pueden ser `fácilmente cambiados para que coincidan con tus preferencias`_.

source: Finally, we added a context-menu action to open any object using the new Object Explorer even if they already have a builtin viewer (DataFrames, arrays, etc), allowing for deeper inspection of the inner workings of these datatypes.
es: Finalmente, hemos añadido una acción de menú contextual para abrir cualquier objeto usando el nuevo Explorador de objetos incluso si ya tienen un visor incorporado (DataFrames, arreglos, etc) permitiendo una inspección más profunda del funcionamiento interno de estos tipos de datos.
