Repository: spyder-ide/spyder-docs
Catalog: doc/locales/*/LC_MESSAGES/troubleshooting.po
Languages: es

source: If the kernel displays a long error traceback that mentions other packages like ``ipython``, ``ipykernel``, ``jupyter_client``, ``traitlets`` or ``pyzmq``, the problem may be an out of date or incompatible version of a dependency package. To fix this, activate the environment and update the key dependencies.
es: Si el núcleo muestra un seguimiento de errores largo que menciona otros paquetes como ``ipython``, ``ipykernel``, ``jupyter_client``, ``traitlets`` o ``pyzmq``, el problema puede ser una versión desactualizada o incompatible de un paquete de dependencias. Para arreglar esto, activa el entorno y actualiza las dependencias clave.

source: In an Anaconda environment:
es: En un ambiente de Anaconda:

source: Otherwise, activate your environment by whatever means you created it, and run:
es: De lo contrario, activa tu entorno por el medio que lo hayas creado, y ejecuta:

source: Check the last few lines of the error message, and see if its an ``AttributeError`` or ``ImportError``, or refers to a file you created in your current working directory or your home folder (:file:`C:/Users/YOUR_USERNAME` on Windows, :file:`/Users/YOUR_USERNAME` on macOS, or :file:`/home/YOUR_USERNAME` on Linux).
es: Comprueba las últimas líneas del mensaje de error y revisa si es un ``AttributeError`` o ``ImportError``, o si se refiere a un archivo que creaste en tu directorio de trabajo actual o en tu carpeta de inicio (:file:`C:/Users/YOUR_USERNAME` en Windows, :file:`/Users/YOUR_USERNAME` on macOS, or :file:`/home/YOUR_USERNAME` en Linux).

source: If so, the the error is likely due to your file being named the same as a Python standard library module, such as ``string.py`` or ``time.py``, which overrides the built-in module that Spyder-Kernels is trying to load. To fix this, simply rename your file to something other than one of these names, and try restarting the kernel. To check the names of these modules, see the list in the `Python standard library documentation`_.
es: Si es así, el error probablemente se deba a que tu archivo recibe el mismo nombre que un módulo de librería estándar de Python, como ``string.py`` o ``time.py``, que anula el módulo integrado que Spyder-Kernels está intentando cargar. Para arreglar esto, simplemente renombra tu archivo con un nombre distinto e intenta reiniciar el núcleo. Para comprobar los nombres de estos módulos, revisa la lista en la `Python standard library documentation`_.

source: Completion/help not working
es: El autocompletado o la ayuda no funcionan

source: To provide code completions, help and real-time analysis in the Editor, Spyder uses the Python Language Server (PyLS), an implementation of the Language Server Protocol specification used by VSCode, Atom and other popular editors/IDEs. Most help and completion issues lie outside of Spyder's control, and are either limitations with PyLS or the code that is being introspected, but some can be worked around.
es: Para proporcionar completado, ayuda y análisis de código en tiempo real en el Editor, Spyder utiliza el Python Language Server (PyLS), una implementación de la especificación del Language Server Protocol utilizado por VSCode, Atom y otros editores e IDEs populares. La mayoría de los errores de ayuda y completado están fuera del control de Spyder y son limitaciones de PyLS o del código que se está programando, pero algunos pueden ser solucionados por los usuarios.

source: Object missing docstring
es: Docstring faltante de un objeto

source: If nothing is displayed in the calltip, hover hint or help pane, the object you're trying to introspect may not have a docstring.
es: Si no se muestra nada en el calltip, las sugerencias al pasar el cursor o en el panel de ayuda, es posible que el objeto al que estás intentando realizar una introspección no tenga un docstring.

source: In this case, the only solution is to add one in the source code of the original function, method or class.
es: En este caso, la única solución es añadir uno en el código fuente de la función original, método o clase.

source: Object cannot be found
es: El objeto no puede ser encontrado

source: Some objects, whether due to being written in C, Cython or another language; generated dynamically at runtime; or being a method of an object you create, cannot be easily found without executing the code.
es: Algunos objetos, ya sea por estar escritos en C, Cython u otro idioma; por ser generados dinámicamente en tiempo de ejecución; o por ser un método de un objeto que creaste, no se pueden encontrar fácilmente sin ejecutar el código.

source: However, once you run your code in the :doc:`/panes/ipythonconsole`, you might be able to get help and completions on the object there.
es: Sin embargo, una vez que ejecutes tu código en la :doc:`/panes/ipythonconsole`, es posible que puedas obtener la ayuda y el completado del objeto allí.

source: LSP has stopped working
es: El LSP ha dejado de funcionar

source: Occasionally, especially after using Spyder for a while, code completion, help and analysis may stop working. If this is the case, you can check LSP status with the :guilabel:`LSP Python` item in Spyder's status bar at the bottom of the screen, and restart it by right-clicking it and selecting the :guilabel:`Restart Python Language Server` item.
es: Ocasionalmente, especialmente después de usar Spyder por un tiempo, el completado, la ayuda y el análisis de código pueden dejar de funcionar. Si este es el caso, puedes comprobar el estado LSP con el elemento :guilabel:`LSP Python` en la barra de estado de Spyder en la parte inferior de la pantalla, y reiniciarlo haciendo clic con el botón derecho y seleccionando el elemento :guilabel:`Reiniciar el servidor de lenguaje de Python`.

source: Spyder bug/dependency issue
es: Error de Spyder debido a problemas con sus dependencias

source: Given the variety of dependencies involved in making LSP work, an incompatible or out of date version in your environment can result in error messages, incomplete results, or help/analysis not working at all.
es: Dada la variedad de dependencias involucradas en hacer que el LSP funcione, una versión incompatible o desactualizada de tu entorno puede resultar en mensajes de error, resultados incompletos o ayuda/análisis que no funcionen en absoluto.

source: To address this, first try updating Anaconda and Spyder as described in :doc:`basic-first-aid`. If the issue still isn't resolved, update the various relevant dependencies with:
es: Para solucionar esto, primero intenta actualizar Anaconda y Spyder como se describe en :doc:`basic-first-aid`. Si el problema todavía no está resuelto, actualiza las distintas dependencias relevantes con:

source: Plugin Problems
es: Problemas de plugin

source: Plugin does not work at all
es: El plugin no funciona en absoluto

source: If you have installed a Spyder plugin, but you can't see it, go to the :guilabel:`Panes` submenu of the :guilabel:`View` menu and select the plugin's name, which should make its pane visible. If you don't see the plugin there, select the :guilabel:`Dependencies` item under the :guilabel:`Help` menu and see if the plugin appears at the bottom.
es: Si tienes instalado un plugin de Spyder, pero no puedes verlo, ve al submenú :guilabel:`Paneles` del menú :guilabel:`Ver` y selecciona el nombre del plugin, que debería hacer que su panel sea visible. Si no ves el plugin allí, selecciona el elemento :guilabel:`Dependencias` en el menú :guilabel:`Ayuda` y mira si el plugin aparece en la parte inferior.

source: If the plugin with the problem is not listed in the dependencies dialog, check that you installed it in the same environment as Spyder. If you have, then the problem may well be caused by a dependency issue. Test whether you can import the plug-in manually by opening a Python console in the same environment as Spyder and typing, for instance, ``import spyder_unittest`` to test the Spyder-Unittest` plug-in; this command should run without errors.
es: Si el plugin con el problema no aparece en el diálogo de dependencias, comprueba que lo instalaste en el mismo entorno que Spyder. Si lo tienes, el problema puede deberse a un problema de dependencia. Comprueba si puedes importar el plugin manualmente abriendo una consola Python en el mismo entorno que Spyder y escribiendo, por ejemplo, ``importar spyder_unittest`` para probar el plugin de Spyder-Unittest; este comando debe ejecutarse sin errores.

source: If none of this helps you to resolve the problem, then continue to the next section.
es: Si nada de esto te ayuda a resolver el problema, entonces continúa a la siguiente sección.

source: Other issues
es: Otros problemas

source: If you get an error which mentions or involves a Spyder plugin, such as ``spyder-unittest``, ``spyder-terminal`` or ``spyder-notebook``, or if you encounter any other problem with a Spyder plugin, then the first approach should be to update Spyder and the plugin to their latest versions.
es: Si obtienes un error que mencione o involucra un plugin de Spyder, como ``spyder-unittest``, ``spyder-terminal`` o ``spyder-notebook``, o si encuentras cualquier otro problema con un plugin de Spyder, entonces el primer enfoque debe ser actualizar Spyder y el plugin a sus últimas versiones.

source: If this doesn't fix the problem, you should check the plugin's website or repository to see if it is compatible with your version of Spyder.
es: Si esto no soluciona el problema, deberías comprobar el sitio web o repositorio del plugin para ver si es compatible con tu versión de Spyder.

source: Finally, if compatibility doesn't seem to be the problem, please check those repositories to see if an issue was already opened, and report it there if not.
es: Finalmente, si la compatibilidad no parece ser el problema, por favor, comprueba esos repositorios para ver si ya se ha abierto un problema e infórmalo allí si no es así.

source: Emergency CPR
es: Kit de emergencia

source: Is Spyder not launching at all? The steps on this section should hopefully get it back up and running in no time.
es: ¿Spyder no se está lanzando en lo absoluto? Esperemos que los pasos en esta sección lo vuelvan a poner en marcha en poco tiempo.

source: Common solutions
es: Soluciones comunes

source: Try :doc:`basic-first-aid` first, which usually resolves most Spyder install-related issues.
es: Prueba primero :doc:`basic-first-aid`, que normalmente resuelve la mayoría de los problemas relacionados con la instalación de Spyder.

source: **Make sure Spyder isn't already running** and no Spyder related windows (*e.g.* :doc:`/panes/variableexplorer` dialogs) are left open, and check that the preference setting :menuselection:`Application --> Advanced Settings --> Use a single instance` isn't checked.
es: **Asegúrate de que Spyder no se esté ejecutando** y de que no haya ventanas relacionadas con Spyder abiertas (por ejemplo los diálogos :doc:`/panes/variableexplorer`) y comprueba que la configuración de preferencias :menuselection:`Aplicación --> Opciones avanzadas --> Utilizar una única instancia` no está seleccionada.

source: Try **starting Spyder via a different means**, such as from a shortcut, Anaconda navigator, or your command line (or Anaconda Prompt on Windows) by simply typing ``spyder`` then :kbd:`Enter`/:kbd:`Return`, and see if any of those work. If so, then something's wrong with your install, not Spyder itself, and so we recommend following :ref:`troubleshooting-reinstalling-spyder-ref` to uninstall and reinstall Anaconda.
es: Intenta **iniciar Spyder por medios diferentes**, como por ejemplo desde un acceso directo, Anaconda navigator o tu línea de comandos (o Anaconda Prompt en Windows) simplemente escribiendo ``spyder`` luego :kbd:`Enter`/:kbd:`Return`, y observa si alguno de esos medios funciona. De ser así, entonces algo está mal con tu instalación, no con Spyder en sí, por lo que recomendamos seguir :ref:`troubleshooting-reinstalling-spyder-ref` para desinstalar y reinstalar Anaconda.

source: **Disable any security software** you may be using, such as a firewall or antivirus, as these products can occasionally interfere with Spyder or its related packages. Make sure to re-enable it if it doesn't fix the problem, and if it does, add a rule or exception for Spyder or Python.
es: **Desactiva cualquier software de seguridad** que estés usando, como un firewall o antivirus, ya que estos productos pueden interferir ocasionalmente con Spyder o sus paquetes relacionados. Asegúrate de volver a activarlo si esto no soluciona el problema, y si lo hace, agrega una regla o excepción para Spyder o Python.

source: If it is currently installed "for just you", **try uninstalling and reinstalling Anaconda "for all users" instead**, and vice versa, as some systems can have issues with one or the other installation method.
es: Si actualmente está instalado "solo para ti", **intenta desinstalar y reinstalar Anaconda "para todos los usuarios"**, y viceversa, ya que algunos sistemas pueden tener problemas con uno u otro método de instalación.

source: **Check and repair/reset permissions**, your disk, and OS if all else fails.
es: **Comprueba y repara o reestablece tus permisos**, tu disco y tu sistema operativo si todo lo demás falla.

source: Advanced tricks
es: Trucos avanzados

source: If none of the above solves the problem, you can try starting Spyder directly from its Python source files which may either get it running, or at least provide useful information to help debug the issue further.
es: Si nada de lo anterior resuelve el problema, puedes intentar iniciar Spyder directamente desde sus archivos fuente de Python, lo que puede hacer que se ejecute, o al menos proporcionar información útil para ayudar a depurar aún más el problema.

source: This technique consists of starting Spyder from your terminal (or Anaconda Prompt on Windows) by manually running the Spyder startup routine ( :guilabel:`start.py` ) with a known good Python interpreter, and observing the results.
es: Esta técnica consiste en iniciar Spyder desde tu terminal (o Anaconda Prompt en Windows) ejecutando manualmente la rutina de inicio de Spyder ( :guilabel:`start. y` ) con un buen intérprete de Python conocido, y observando los resultados.

source: To do so, you'll need to:
es: Para hacerlo, necesitarás:

source: Find the path to the Spyder :file:`app` directory from the command line. For this, run:
es: Encuentra la ruta al directorio :file:`app` de Spyder desde la línea de comandos. Para esto, ejecuta:

source: Go to the output path of the above command on your command line:
es: Vaya a la ruta de salida del comando anterior en tu línea de comandos:

source: Once inside the :file:`app` directory, run ``python start.py`` to launch Spyder.
es: Una vez dentro del directorio :file:`app`, ejecuta ``python start.py`` para iniciar Spyder.

source: #. If it doesn't start successfully, then you should see an error traceback printed; carefully copy that for future reference. Also run ``python mainwindow.py``, and record your results as well.
es: Si no se inicia con éxito, deberías ver un seguimiento de errores impreso; cópialo cuidadosamente para futuras referencias. También ejecuta ``python mainwindow.py``, y registra sus resultados también.

source: (*Windows only*) In case the command window disappears immediately after the error, create a ``.bat`` file in the :file:`app` directory with the following content:
es: (*Solo Windows*) En caso de que la ventana de comandos desaparezca inmediatamente después del error, crea un archivo ``.bat`` en el directorio :file:`app` con el siguiente contenido:

source: Replace ``<PYTHON-PATH>`` with the output of:
es: Reemplaza ``<PYTHON-PATH>`` con la salida de:

source: Then, double click the batch file to run it, and you should see the error information you need.
es: Luego, haz doble clic en el archivo por lotes para ejecutarlo, y deberías ver la información de error que necesitas.

source: If reading the output (particularly the last line) doesn't help you solve the problem, then record all of it carefully, and post it as part of your bug report as described under the :doc:`submit-a-report` section.
es: Si leer el resultado (particularmente la última línea) no te ayuda a resolver el problema, regístralo todo cuidadosamente y publícalo como parte de tu informe de error como se describe en la sección :doc:`submit-a-report` .

source: First Steps
es: Primeros Pasos

source: If Spyder crashes or you receive an error message, please read the following troubleshooting steps before opening a new issue. There's a good chance that someone else has already experienced the same problem, so checking for an existing solution will likely get Spyder working again for you as quickly as possible.
es: Si Spyder se bloquea o recibes un mensaje de error, por favor lee los siguientes pasos de solución de problemas antes de abrir uno nuevo. Hay una buena posibilidad de que alguien más ya haya experimentado el mismo problema, así que comprobar si ya hay una solución existente probablemente hará que Spyder vuelva a trabajar para ti lo más rápido posible.

source: To make sure you're getting the most relevant help for your problem, please make sure the issue is actually related to Spyder:
es: Para asegurarte de que estás recibiendo la ayuda más relevante para tu problema, por favor asegúrate de que el problema está realmente relacionado con Spyder:

source: If the problem appears to be a result of *your own code*, `Stack Overflow`_ is a better place to start.
es: Si el problema parece ser el resultado de *tu propio código*, `Stack Overflow`_ es un mejor lugar para empezar.

source: If the bug also occurs in the *standard Python, IPython, or QtConsole* environments, or only with *a specific package*, it is unlikely to be something in Spyder, and you should report it to those sources instead.
es: Si el error también ocurre en los entornos *estándar de Python, IPython, o QtConsole*, o solo con *un paquete específico*, es poco probable que sea algo en Spyder, y deberías reportarlo a esas fuentes en su lugar.

source: If the problem lies with *your specific install*, uninstalling and clean-reinstalling the `Anaconda`_ distribution is strongly recommended. As the other methods of installing Spyder can result in tricky user-specific problems, we generally aren't able to give individual support for install issues.
es: Si el problema radica en *tu instalación específica*, se recomienda encarecidamente desinstalar y reinstalar la distribución `Anaconda`_. Como los otros métodos de instalación de Spyder pueden resultar en complicados problemas específicos del usuario, generalmente no somos capaces de dar soporte individual para problemas de instalación.

source: Just like the programs you code in it, Spyder is written in Python, so you can often figure out many problems just by reading the last line of the traceback or error message. To view it, simply click :guilabel:`Show details` in the Spyder error dialog.
es: Al igual que los programas que codificas en él, Spyder está escrito en Python, por lo que a menudo puedes resolver muchos problemas con solo leer la última línea del traceback o mensaje de error. Para verlo, simplemente haz clic en :guilabel:`Mostrar detalles` en la ventana de error de Spyder.

source: Often, that alone will tell you how to fix the problem on your own, but if not, we're here to help.
es: A menudo, eso por sí solo te dirá cómo solucionar el problema por tu cuenta, pero si no, estamos aquí para ayudarte.

source: Where to go from here
es: Donde buscar ayuda a partir de aquí

source: If you check out our list of issue categories and problem descriptions and see a question, error message or traceback that looks familiar, the relevant sub-section will likely be of the most specific help solving your issue as quickly as possible.
es: Si revisas nuestra lista de categorías de incidencias y descripciones de problemas y ves una pregunta, mensaje de error o seguimiento te resulte familiar, es probable que la subsección correspondiente te brinde la ayuda más específica para resolver tu problema rápidamente.

source: As a first step to solving your issue, you can try some :doc:`basic-first-aid`.
es: Como primer paso para resolver tu problema, puedes probar algo de :doc:`basic-first-aid`.

source: If Spyder won't launch, check the :doc:`emergency-cpr` section and see if that clears it up.
es: Si Spyder no se inicia, comprueba la sección de :doc:`emergency-cpr` y verifica si eso soluciona el problema.

source: If your problem is related to the kernel not starting, autocompletion or a plugin go to :doc:`common-illnesses` section.
es: Si tu problema está relacionado con el núcleo que no se inicia, el autocompletado o un plugin, ve a la sección :doc:`common-illnesses`.

source: If you still can't get it to work, and the problem is indeed Spyder-related, you should consult the the :doc:`call-for-help` section for other resources to explore.
es: Si todavía no puedes hacer que funcione, y el problema está realmente relacionado con Spyder, deberías consultar la sección :doc:`call-for-help` para ver otros recursos para explorar.

source: Finally, if you couldn't solve your problem and want to submit an issue to our Github issue tracker, so the bug can hopefully be fixed for everyone, :doc:`submit-a-report`.
es: Por último, si no pudiste resolver tu problema y deseas enviar un issue a nuestro gestor de issues de Github, para que el error puede corregirse para todos, usa :doc:`submit-a-report`.

source: Troubleshooting
es: Solución de problemas

source: Submit a Report
es: Enviar un reporte

source: If you can't fix your issue with any of the troubleshooting steps, then you'll want to submit it to our issue tracker so our team can take a look at it for you. You'll need a `Github account`_ to do this, so make sure you have one before you begin (a good idea anyway).
es: Si no puedes solucionar tu problema con ninguno de los pasos de solución de problemas, entonces querrás enviarlo a nuestro gestor de issues de GitHub para que nuestro equipo pueda echarle un vistazo por usted. Para hacer esto necesitarás una `Github account`_, así que asegúrate de tener una antes de comenzar (una buena idea de todos modos).

source: Before you submit an issue, make sure you've searched a description of the problem and a relevant portion of the error traceback, on both Google and Spyder's `issue tracker`_ to make sure it hasn't been submitted before. If that's the case, your issue will be closed as a duplicate.
es: Antes de enviar un issue, asegúrate de haber buscado una descripción del problema y una parte relevante del seguimiento de errores, tanto en Google como en el `issue tracker`_ de Spyder para asegurarte de que no ha sido enviado antes. Si ese es el caso, tu problema se cerrará como un duplicado.

source: Ways to submit an issue
es: Formas de enviar un issue

source: There are several ways to submit an issue, either from Spyder or GitHub directly. In order of preference and difficulty:
es: Hay varias maneras de enviar un issue, ya sea desde Spyder o GitHub directamente. Por orden de preferencia y dificultad:
