Repository: spyder-ide/spyder-docs
Catalog: doc/locales/*/LC_MESSAGES/troubleshooting.po
Languages: es

source: Basic First Aid
es: Primera ayuda básica

source: These suggestions, while more of a shotgun approach, tend to fix the majority of reported issues just on their own.
es: Estas sugerencias, si bien son más un enfoque de shotgun, tienden a arreglar la mayoría de los problemas informados por sí solos.

source: Recommended troubleshooting steps
es: Pasos recomendados para la solución de problemas

source: **Restart Spyder**, and try what you were doing before again.
es: **Reinicia Spyder**, y prueba lo que estabas haciendo antes de nuevo.

source: **Upgrade Spyder** to the latest release, and you might find your issue is resolved (along with new features, enhancements, and other bug fixes). Minor releases come out every couple months, so unless you've updated recently, there is a good chance your version isn't the latest. You can find out with the :guilabel:`Check for updates` command under the :guilabel:`Help` menu.
es: **Actualiza Spyder** a la última versión, y puede que encuentres que tu problema está resuelto (junto con nuevas características, mejoras y otras correcciones de errores). Los lanzamientos menores salen cada par de meses, así que a menos que se haya actualizado recientemente, hay una buena posibilidad de que tu versión no sea la última. Puedes encontrar con el comando :guilabel:`Buscar actualizaciones` en el menú de :guilabel:`Ayuda`.

source: To perform the update with Conda (strongly recommended), from your terminal (or Anaconda Prompt on Windows) run:
es: Para realizar la actualización con Conda (altamente recomendado), desde tu terminal (o en el Anaconda Prompt en Windows):

source: **Update Spyder's dependencies and environment**, either by installing the latest version of your distribution (e.g. the recommended Anaconda), or with the relevant "update all" command in your terminal (or Anaconda Prompt on Windows). To get the latest stable version of everything using Conda, you can run:
es: **Actualiza las dependencias y el entorno de Spyder**, instalando la última versión de tu distribución (p. ej. el recomendado Anaconda), o con el comando correspondiente "update all" en tu terminal (o en el Anaconda Prompt en Windows). Para obtener la última versión estable de todo usando Conda puedes ejecutar:

source: **Restart your machine**, in case the problem lies with a lingering process or another such issue.
es: **Reinicie tu máquina**, en caso de que el problema resida en un proceso de permanencia o de cualquier otro tipo.

source: **Restore Spyder's config files** to their defaults, which solves a huge variety of Spyder issues. From your terminal (or Anaconda Prompt on Windows), run:
es: **Restaura los archivos de configuración de Spyder** a sus valores predeterminados, lo que resuelve una gran variedad de problemas de Spyder. Desde tu terminal (o en el Anaconda Prompt en Windows), ejecuta:

source: This will reset your preferences, as well as any custom keyboard shortcuts or syntax highlighting schemes. If you particularly care about any of those, you should make a copy of the :file:`.spyder-py3` folder in your user home directory (:file:`C:/Users/YOUR_USERNAME` on Windows, :file:`/Users/YOUR_USERNAME` on macOS, or :file:`/home/YOUR_USERNAME` on Linux), and restore it afterwards if this doesn't solve the problem.
es: Esto restablecerá tus preferencias, así como cualquier atajo de teclado personalizado o esquemas de resaltado de sintaxis. Si te preocupa especialmente alguno de ellos, deberías hacer una copia de la carpeta :file:`.spyder-py3` en tu directorio de inicio de usuario (:file:`C:/Users/YOUR_USERNAME` en Windows, :file:`/Users/YOUR_USERNAME` en macOS, o :file:`/home/YOUR_USERNAME` en Linux), y restaurarlo después si esto no resuelve el problema.

source: **Try installing Spyder into a new Conda environment** (recommended) or ``virtualenv``/``venv``, and see if the issue reoccurs.
es: **Intenta instalar Spyder en un nuevo entorno Conda** (recomendado) o ``virtualenv``/``venv``, y mira si el problema vuelve a producirse.

source: In your system terminal (or Anaconda Prompt on Windows), run the following commands to create an a fresh, clean environment and start Spyder in it:
es: En tu terminal de sistema (o en el Anaconda Prompt en Windows), ejecuta los siguientes comandos para crear un entorno fresco y limpio e iniciar Spyder en él:

source: If this fixes the issue, the problem was likely due to another package installed on your system, particularly if done with pip, which can cause many problems and should be avoided if at all possible.
es: Si esto soluciona el problema es porque probable el problema se deba a otro paquete instalado en tu sistema, especialmente si se hace con pip que puede causar muchos problemas y debe evitarse si es posible.

source: **Watch our video** on solving and avoiding problems with pip, Conda and Conda-Forge, and follow its instructions.
es: **Mira nuestro vídeo** para resolver y evitar problemas con pip, Conda y Conda-Forge, y sigue sus instrucciones.

source: Reinstalling Spyder
es: Reinstalar Spyder

source: If none of the previous steps solve your issue, you should do a full uninstall of Spyder by whatever means you originally installed it.
es: Si ninguno de los pasos anteriores resuelve tu problema, deberías hacer una desinstalación completa de Spyder por el mismo medio que lo hayas instalado originalmente.

source: For Anaconda, follow all the steps under Option B in the `Anaconda uninstall guide`_, delete the Anaconda directory wherever it was originally installed, and (on Windows) remove the :file:`%appdata%/python` directory if it exists.
es: Para Anaconda, sigue todos los pasos bajo la opción B en la `Anaconda uninstall guide`_, borra el directorio de Anaconda dondequiera que fue instalado originalmente, y (en Windows) elimina el directorio :file:`%appdata%/python` si existe.

source: Then, do a clean install of the latest version of the `Anaconda distribution`_ which is how we recommend you install Spyder and keep it up to date.
es: Luego, haz una instalación limpia de la última versión de la `Anaconda distribution`_ que es la forma en que te recomendamos instalar Spyder y mantenerlo actualizado.

source: While you are welcome to get Spyder working on your own by one of the many other means we offer, we are only able to provide individual support for install-related issues for users of the Anaconda distribution. In particular, pip installation, while doable, is only really for experts, as there are many pitfalls involved and different issues specific to your setup, which is why we recommend using Conda whenever possible. For further information, please visit our :doc:`/installation`.
es: Aunque eres bienvenido a hacer que Spyder trabaje por tu cuenta por uno de los muchos otros medios que ofrecemos, solo podemos proporcionar soporte individual para problemas relacionados con la instalación para los usuarios de la distribución Anaconda. En particular, la instalación de pip, aunque factible, es realmente para expertos ya que hay muchas dificultades involucradas y diferentes problemas específicos para su configuración, por eso recomendamos usar Conda siempre que sea posible. Para más información, por favor visite nuestro :doc:`/installation`.

source: Isolating problems
es: Aislar problemas

source: If you get an error while running a specific line, block, or script/program, it may not be an issue with Spyder, but rather something lower down in the packages it depends on. Try running it in the following in order if and until it starts working as you expect. If you manage to isolate the bug, report it to the last one it *doesn't* work in.
es: Si obtienes un error al ejecutar una línea, bloque o programa específico, puede que no sea un problema con Spyder, sino más bien algo más bajo en los paquetes de los que depende. Intenta ejecutarlo de la siguiente manera en orden hasta que comience a funcionar como esperas. Si logras aislar el error, repórtarlo al último en el que *no* funciona.

source: **Spyder** itself, of course! Make sure you can reproduce the error after closing and reopening it, if possible.
es: ¡**Spyder** mismo, por supuesto! Asegúrate de que puedas reproducir el error después de cerrarlo y reabrirlo, si es posible.

source: **A bare QtConsole instance**, e.g. launched from Anaconda navigator or from the Anaconda Prompt/Terminal/command line (Windows/Mac/Linux) with ``jupyter qtconsole``.
es: **Una instancia de QtConsole**, por ejemplo, lanzada desde el navegador Anaconda o desde Anaconda Prompt/Consola/línea de comando (Windows/Mac/Linux) con ``jupyter qtconsole``.

source: QtConsole is the GUI console backend Spyder depends on to run its code, so most issues involving Spyder's :doc:`/panes/ipythonconsole` are actually something with QtConsole instead, and can be reported to their `issue tracker`_.
es: QtConsole es el backend de la consola GUI Spyder del que depende para ejecutar su código, así que la mayoría de los problemas involucrando :doc:`/panes/ipythonconsole` son en realidad algo relacionado con QtConsole y pueden ser reportados a su `issue tracker`_.

source: **An IPython command line shell**, launched with e.g. ``ipython`` from the Anaconda Prompt/Terminal/command line (Windows/Mac/Linux). Reproducible bugs can be reported to their `Github page`_, though make sure to read their guidelines and docs first.
es: **Un intérprete de línea de comandos IPython** lanzado con, por ejemplo, ``ipython`` desde Anaconda Prompt/Consola/línea de comandos (Windows/Mac/Linux). Los errores reproducibles pueden ser reportados a su `Github page`_, aunque primero asegúrate de leer sus directrices y documentos.

source: **A standard Python interpreter**, either run as a script file with ``python path/to/your/file.py`` or launched interactively with ``python`` from your Anaconda Prompt/Terminal/command line (Windows/Mac/Linux). While it is not impossible that you've found Python bug, it is much more likely to be an issue with the code itself or a package you are using, so your best sources are the `Python docs`_ and the other resources listed above.
es: **Un intérprete estándar de Python** que puedes ejecutar como un archivo de script con ``python path/to/your/file.py`` o interactivamente con ``python`` desde Anaconda Prompt/Consola/línea de comandos (Windows/Mac/Linux). Aunque no es imposible que hayas encontrado un error en Python, es mucho más probable que sea un problema con el código en sí mismo o con un paquete que estés usando, así que tus mejores fuentes son la `Python docs`_ y los demás recursos listados anteriormente.

source: If the problem reoccurs in a similar or identical way with any of these methods (other than only Spyder itself), then it is almost certainly not an issue with Spyder, and would be best handled elsewhere. As we usually aren't able to do much about issues not related to Spyder, a forum like `Stack Overflow`_ or the relevant package's docs is a much better place to get help or report the issue.
es: Si el problema se reproduce de forma similar o idéntica con cualquiera de estos métodos (aparte de Spyder en sí), entonces casi con toda seguridad no es un problema con Spyder, y sería mejor manejarlo en otros lugares. Como normalmente no somos capaces de hacer mucho sobre problemas no relacionados con Spyder, un foro como `Stack Overflow`_ o la documentación de paquetes relevantes son lugares mucho más apropiados para obtener ayuda o reportar el problema.

source: See the :doc:`call-for-help` section for other places to look for information and assistance.
es: Vea la sección :doc:`call-for-help` para conocer otros lugares para buscar información y asistencia.

source: Debugging and patching
es: Depuración y ajuste del código de Spyder

source: If you know your way around Python, you can often diagnose and even fix Spyder issues yourself, since the IDE is written in the same language you use in it. You can explore the error messages you're receiving and Spyder's inner workings with the :guilabel:`Internal Console`, available under the menu item :menuselection:`View --> Panes --> Internal Console`.
es: Si conoces Python, a menudo puedes diagnosticar e incluso solucionar los problemas de Spyder tú mismo, ya que la IDE está escrita en el mismo idioma que utilizas en él. Puedes explorar los mensajes de error que estás recibiendo y el funcionamiento interno de Spyder con la :guilabel:`Terminal interna`, disponible bajo el menú :menuselection:`Ver --> Paneles --> Terminal interna`.

source: For more detailed debug output, start Spyder from the command line (Anaconda Prompt on Windows) with ``spyder --debug-info verbose``.
es: Para obtener una salida de depuración más detallada, inicia Spyder desde la línea de comandos (Anaconda Prompt en Windows) con ``spyder --debug-info verbose``.

source: Even if you don't manage to fix the problem yourself, this output can be very helpful in aiding us to quickly narrow down and solve your issue for you.
es: Incluso si no logras solucionar el problema por ti mismo, esta salida puede ser muy útil para ayudarnos a reducir rápidamente y resolver tu problema por ti.

source: Calling for Help
es: Pedir ayuda

source: Aside from this troubleshooting guide, there are a number of other sources of documentation and troubleshooting information you can check before submitting an issue, as they might already offer an answer, or at least help you better understand the problem. Even if we aren't able to help you, these places might.
es: Además de esta guía de solución de problemas, hay una serie de otras fuentes de documentación e información de solución de problemas que puedes consultar antes de enviar un problema, ya que es posible que ya ofrezcan una respuesta o al menos te ayuden a comprender mejor el problema. Incluso si no somos capaces de ayudarte, estos lugares podrían hacerlo.

source: Spyder-related platforms
es: Plataformas relacionadas con Spyder

source: Spyder's FAQ section
es: Sección de preguntas frecuentes (FAQ) de Spyder

source: Spyder's documentation has a FAQ section, where you might find the answers that you are looking for.
es: La documentación de Spyder tiene una sección de preguntas frecuentes, donde puedes encontrar las respuestas que estás buscando.

source: Spyder's YouTube channel
es: Canal de YouTube de Spyder

source: Our `YouTube channel`_ contains helpful videos that will guide you through many of Spyder's features, and provide a starting point for newer users.
es: Nuestro `YouTube channel`_ contiene videos útiles que te guiarán a través de muchas de las características de Spyder y proporcionan un punto de partida para los nuevos usuarios.

source: Spyder Gitter
es: Gitter de Spyder

source: We have a public `Gitter room`_ where you can chat directly with the Spyder developers. If you've got a quick question to ask the team and are looking for a quick answer, this is a great place to go.
es: Tenemos una sala pública `Gitter`_ donde puedes chatear directamente con los desarrolladores de Spyder. Si tienes una pregunta rápida para hacer al equipo y estás buscando una respuesta rápida, este es un buen lugar para ir.

source: Spyder Google Group
es: Grupo de Google de Spyder

source: Our `Google Group`_ is great for help-related questions, particularly those you aren't sure are a full-on Spyder issue.
es: Nuestro `Google Group`_ es ideal para preguntas relacionadas con la ayuda, en particular aquellas que no estás seguro de que sean un problema de Spyder.

source: Spyder website
es: Sitio web de Spyder

source: The `Spyder site`_ contains basic information about the IDE and links to many other helpful resources.
es: El `Spyder site`_ contiene información básica sobre el IDE y enlaces a muchos otros recursos útiles.

source: Stack Overflow tag
es: Etiqueta Stack Overflow

source: `Stack Overflow`_ is a great place to start searching and posting, particularly if your question is more programming-related, or has to do with something specific to your own code. It has an vibrant Spyder community as well, with new questions posted every day, and the developers (especially Carlos Cordoba, the lead maintainer) are active in answering them.
es: `Stack Overflow`_ es un buen lugar para empezar a buscar y publicar, particularmente si tu pregunta está más relacionada con la programación o tiene que ver con algo específico de tu propio código. También tiene una vibrante comunidad Spyder, con nuevas preguntas publicadas todos los días y los desarrolladores (especialmente Carlos Cordoba, el mantenedor principal) están activos para responderlas.

source: OpenTeams support
es: Soporte de OpenTeams

source: On `OpenTeams`_, you can get help from expert Spyder consultants. OpenTeams offers services from Spyder experts ranging from a brief consultation to an experienced team to help you with a large scale implementation project.
es: En `OpenTeams`_, puedes obtener ayuda de consultores expertos Spyder. OpenTeams ofrece servicios desde expertos de Spyder que van desde una breve consulta a un equipo experimentado para ayudarte con un proyecto de implementación a gran escala.

source: Python resources
es: Recursos de Python

source: Official Python help page
es: Página oficial de ayuda de Python

source: The `Python help page`_ is a great resource that lists a number of places you can get assistance, support and learning resources for the language and its packages.
es: La Página de ayuda de Python (`Python help page`_) es un gran recurso que lista una serie de lugares en los que puedes obtener asistencia, soporte y recursos de aprendizaje para del lenguaje y sus paquetes.

source: Python documentation
es: Documentación de Python

source: The `Python docs`_ can help you understand a number of issues that can be caused by quirks in the language itself, or misunderstandings as to how it behaves.
es: La `Python docs`_ puede ayudarte a entender una serie de problemas que pueden ser causados por peculiaridades del lenguaje en sí o malentendidos sobre cómo se comporta.

source: Python subreddits
es: Los subreddits de Python

source: `r/python`_ and `r/learnpython`_ are resources you can use to ask about and discuss issues with Python and its packages. The former is aimed more at general Python usage, and the latter more specifically at beginners.
es: `r/python`_ y `r/learnpython`_ son recursos que puedes usar para preguntar y discutir problemas con Python y sus paquetes. La primera se dirige más al uso general de Python, y la segunda es más específica para principiantes.

source: Data science/SciPy resources:
es: Recursos de ciencia de datos/SciPy:

source: Anaconda help
es: Ayuda de Anaconda

source: The `Anaconda docs`_ site offers free community help and documentation for the Anaconda applications, installing the Anaconda distribution, and using the Conda package and environment manager; along with paid support options.
es: El sitio `Anaconda docs`_ ofrece ayuda y documentación gratuita de la comunidad para las aplicaciones de Anaconda, la instalación de la distribución de Anaconda y el uso del administrador de paquetes y entornos Conda; junto con opciones de soporte pagas.

source: SciPy.org website
es: Sitio web de SciPy.org

source: The `Scipy website`_ is the the central home of the SciPy stack, with information, documentation, help, and bug tracking for many of the core packages used with Spyder, including NumPy, SciPy, Matplotlib, Pandas, Sympy and IPython.
es: El `Scipy website`_ es el hogar central de SciPy, con información, documentación, ayuda, y seguimiento de errores para muchos de los paquetes principales utilizados con Spyder, incluyendo NumPy, SciPy, Matplotlib, Pandas, Sympy y IPython.

source: Project Jupyter
es: Proyecto Jupyter

source: `Jupyter`_ is the development hub for IPython, Spyder's QtConsole, Jupyter notebooks used with the `Spyder-Notebook`_ plugin, and more.
es: `Jupyter`_ es el centro de desarrollo de IPython, el QtConsole de Spyder, los Jupyter notebooks usados con el plugin `Spyder-Notebook`_ y más.

source: Data Science Stack Exchange
es: Stack Exchange de Data Science

source: The `Data Science`_ site in Stack Exchange can be very useful for questions that relate more to data science than programming specifically.
es: El sitio `Data Science`_ en Stack Exchange puede ser muy útil para preguntas que se relacionan más con la ciencia de datos que con la programación específica.

source: Common Illnesses
es: Problemas comunes

source: Beyond the general troubleshooting steps, some frequently-reported problems require more specialized solutions.
es: Más allá de los pasos generales de la solución de problemas, algunos problemas reportados con frecuencia requieren soluciones más especializadas.

source: Errors starting the kernel
es: Errores al iniciar el núcleo

source: If you receive the message ``An error occurred while starting the kernel`` in the :doc:`/panes/ipythonconsole`, Spyder was unable to launch a new Python interpreter in the current working environment to run your code. There are a number of problems that can cause this, but most can be fixed fairly quickly with a few easy steps.
es: Si recibes el mensaje ``Ocurrió un error mientras iniciaba el núcleo`` en el :doc:`/panes/ipythonconsole`, Spyder no pudo lanzar un nuevo intérprete de Python en el entorno de trabajo actual para ejecutar su código. Hay una serie de problemas que pueden causarlo, pero la mayoría se puede solucionar con bastante rapidez con unos pocos pasos fáciles.

source: Spyder-Kernels not installed/incompatible
es: Spyder-Kernels no está instalado o es incompatible

source: Spyder requires a supported version of the ``spyder-kernels`` package to be present in the working environment you want to run your console in.
es: Spyder requiere que una versión compatible del paquete ``spyder-kernels`` esté presente en el entorno de trabajo en el que deseas ejecutar tu consola.

source: It is included by default with Anaconda, but if you want to run your code in another Python environment or installation, you'll need to make sure it's installed and updated to the latest version.
es: Se incluye por defecto con Anaconda, pero si quieres ejecutar tu código en otro entorno Python o instalación, necesitarás asegurarte de que esté instalado y actualizado a la última versión.

source: Check the required version of spyder-kernels for your version of Spyder in the following table:
es: Revisa la versión requerida de los spyder-kernels para tu versión de Spyder en la siguiente tabla:

source: Spyder and Spyder-Kernels version compatibility
es: Compatibilidad de versiones de Spyder y Spyder-Kernels

source: To do so, activate the environment, then install ``spyder-kernels``. If using Anaconda, open a terminal (Anaconda Prompt on Windows) and run:
es: Para ello, activa el entorno, a continuación, instala ``spyder-kernels``. Si utilizas Anaconda, abre una consola (Anaconda Prompt en Windows) y ejecuta:

source: Otherwise, activate your environment by whatever means you created it, and execute:
es: De lo contrario, activa tu entorno por el medio que lo hayas creado, y ejecuta:

source: For both of the previous commands, replace ``<VERSION>`` with the corresponding version in the table.
es: Para los dos comandos anteriores, reemplaza ``<VERSION>`` con la versión correspondiente en la tabla.

source: Issue with another dependency
es: Problemas con otra dependencia
