Repository: spyder-ide/spyder-docs
Catalog: doc/locales/*/LC_MESSAGES/troubleshooting.po
Languages: es

source: **If Spyder presents an error dialog** you can submit an issue directly from it. You will have to fill out a title for your issue, specify the steps that lead to this problem and click :guilabel:`submit to Github`. This will prefill an error report with your environment details, key versions and dependencies and automatically insert the error/traceback for you.
es: **Si Spyder presenta un reporte de problemas** puedes enviar un issue directamente desde él. Tendrás que llenar un título para tu petición, especificar los pasos que llevan a este problema y hacer clic en :guilabel:`Enviar a Github`. Esto prellenará un reporte de error con los detalles de tu entorno, las versiones claves y las dependencias, e insertará automáticamente el error o traceback por ti.

source: **If Spyder opens and your issue does not involve an error dialog**, the best way to do so is to simply select :guilabel:`Report issue` from the :guilabel:`Help` menu, which manually brings up the issue report form and fills in the key information about your Spyder installation. Describe the issue you're experiencing (including any error/traceback information) along with a descriptive title, and click :guilabel:`Submit to Github`.
es: **Si Spyder se abre y tu problema no implica un diálogo de error**, la mejor manera de hacerlo es simplemente seleccionar :guilabel:`Reporte de error` en el menú :guilabel:`Ayuda`, que muestra manualmente el formulario de informe del problema y rellena la información clave sobre tu instalación de Spyder. Describe el problema que estás experimentando (incluyendo cualquier información de error/seguimiento) junto con un título descriptivo, y haz clic en :guilabel:`Enviar a Github`.

source: **If Spyder won't launch**, you can submit a report manually at our issues page on `Github`_. Unlike the above, you'll need to manually provide the versions of everything (Spyder, Python, OS, Qt/PyQt, Anaconda, and Spyder's dependencies) as listed in the error report template; see below for more on that.
es: **Si Spyder no se lanza**, puedes enviar un informe manualmente en nuestra página de issues en `Github`_. A diferencia de lo anterior, necesitarás proporcionar manualmente las versiones de todo (Spyder, Python, OS, Qt/PyQt, Anaconda y las dependencias de Spyder) como se muestra en la plantilla de informe de errores; ver abajo para más información sobre eso.

source: Once you submit your report, our team will try to get back to you as soon as possible, often within 24 hours or less, to try to help you fix it.
es: Una vez que envíes tu informe, nuestro equipo intentará responderte lo antes posible, a menudo dentro de 24 horas o menos, para tratar de ayudarte a arreglarlo.

source: What to include in your report
es: Qué incluir en tu informe

source: **Please include as much as possible of the following in your report** to maximize your chances of getting relevant help and our ability to diagnose, reproduce and solve your issue.
es: **Por favor, incluye la mayor cantidad posible de la siguiente información en tu informe** para aumentar las posibilidades de obtener ayuda relevante y facilitar nuestra capacidad de diagnosticar, reproducir y resolver tu problema.

source: The key items, in order of priority:
es: Los elementos clave, en orden de prioridad son:

source: The full, **complete error message or traceback** copy/pasted or automatically entered exactly as displayed by Spyder:
es: El **mensaje de error completo o el traceback** copiado y pegado, o ingresado automáticamente, tal como aparece en Spyder:

source: Auto-generated reports directly from the error dialog should include this automatically, but double check to make sure.
es: Los informes autogenerados directamente desde el cuadro de diálogo de error deben incluir esto automáticamente, pero compruébalo dos veces para asegurarte.

source: You can copy and paste this from the the :guilabel:`Show Details` section of the error dialog.
es: Puedes copiar y pegar esto de la sección :guilabel:`Mostrar detalles` en el diálogo de error.

source: If not present, or a dialog is not displayed, you can also find it printed to Spyder's :guilabel:`Internal Console`, located under the :guilabel:`View` menu at :menuselection:`Panes --> Internal Console`.
es: Si no está presente o no se muestra un diálogo, también puedes encontrarlo impreso en la :guilabel:`Terminal interna` de Spyder, ubicada en el menú :guilabel:`Ver` en :menuselection:`Paneles --> Terminal interna`.

source: If you prefer, or if Spyder won't start, you can start Spyder from your command line (or Anaconda prompt on windows) with ``spyder`` and copy the output printed there.
es: Si lo prefieres, o si Spyder no se inicia, puede iniciar Spyder desde tu línea de comandos (o Anaconda Prompt en Windows) con ``spyder`` y copiar la salida impresa allí.

source: If you are reporting a specific behavior rather than an error, or the message does not fully explain what occurs, please describe in detail what actually happened, and what you expected Spyder to do.
es: Si estás reportando un comportamiento específico en lugar de un error, o el mensaje no explica completamente lo que ocurre, por favor describe en detalle lo que realmente ocurrió, y lo que esperabas que Spyder hiciera.

source: A **detailed, step by step description of exactly what you did** leading up to the error occurring, complete with sample code that triggers it, if applicable.
es: Una **descripción detallada y paso a paso de exactamente lo que hiciste** antes de que ocurriera el error, incluyendo código de ejemplo que lo provoque, si es aplicable.

source: **Information about Spyder and its environment** as listed in the error report template, which you can find under :guilabel:`About Spyder` in the :guilabel:`Help` menu; along with its key dependencies, shown in the dialog under :menuselection:`Help --> Dependencies` (there's a button to copy-paste them).
es: **Información sobre Spyder y su entorno** tal y como se indica en la plantilla de reporte de errores, que puedes encontrar bajo :guilabel:`Acerca de Spyder` en el menú :guilabel:`Ayuda`; junto con sus dependencias clave, mostradas en el diálogo :menuselection:`Ayuda --> Dependencias` (hay un botón para copiarlas).

source: If Spyder won't launch, paste the output of ``conda list`` from your command line (or Anaconda prompt on Windows) in the :guilabel:`Dependencies` section of the issue template.
es: Si Spyder no se lanza, pega la salida de ``lista conda`` desde tu línea de comandos (o Anaconda Prompt en Windows) en la sección :guilabel:`Dependencias` de la plantilla de incidencias.

source: **How you installed Spyder** and any other relevant packages, *e.g.* Anaconda, MacPorts or pip and **whether Spyder has worked before** since you installed it.
es: **Cómo instalaste Spyder** y cualquier otro paquete relevante, *por ejemplo* Anaconda, MacPorts o pip y **si Spyder ha funcionado antes** desde que lo instalaste.

source: **What else you've tried to fix it**, *e.g.* from this guide or elsewhere on the web, and if you've **tried to reproduce it in standalone QtConsole, IPython, and/or the plain Python** interpreter.
es: **Qué más intentaste para solucionarlo**, *por ejemplo*, siguiendo esta guía o buscando en otros sitios web, y si **has intentado reproducir el problema en una QtConsole independiente, IPython, y/o el intérprete de Python simple**.

source: **Whether the problem occurred consistently before** in similar situations or if this is the first time you've observed it.
es: **Si el problema ha ocurrido de manera consistente** en situaciones similares o si es la primera vez que lo observas.

source: **Anything else special or unusual** about your system, environment, packages, or specific usage that might have anything to do with the problem
es: **Cualquier otra cosa especial o inusual** sobre tu sistema, entorno, paquetes o uso específico que pueda tener algo que ver con el problema

source: If including block(s) of code in your report, be sure to precede and follow it with a line of three backticks \`\`\` to get a code block like this:
es: Si incluyes bloque(s) de código en tu informe, asegúrate de precederlos y seguirlos con una línea de tres comillas invertidas \`\`\` para obtener un bloque de código como este:

source: Otherwise, your code will likely contain random formatting or missing indentation, making it difficult to examine and run it to reproduce and fix your issue.
es: De lo contrario, es probable que tu código contenga un formato aleatorio o falta de indentación, lo que dificultará examinarlo y ejecutarlo para reproducir y solucionar tu problema.
